Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/tutorial/appendix.po
Languages: fa

source: Appendix
fa: ضمیمه

source: Interactive Mode
fa: حالت تعاملی

source: There are two variants of the interactive :term:`REPL`. The classic basic interpreter is supported on all platforms with minimal line control capabilities.
fa: دو نوع از :term:`REPL` تعاملی وجود دارد. مفسر پایه کلاسیک در تمام پلتفرم ها با حداقل قابلیت های کنترل خط پشتیبانی می شود.

source: On Windows, or Unix-like systems with :mod:`curses` support, a new interactive shell is used by default. This one supports color, multiline editing, history browsing, and paste mode. To disable color, see :ref:`using-on-controlling-color` for details. Function keys provide some additional functionality. :kbd:`F1` enters the interactive help browser :mod:`pydoc`. :kbd:`F2` allows for browsing command-line history with neither output nor the :term:`>>>` and :term:`...` prompts. :kbd:`F3` enters "paste mode", which makes pasting larger blocks of code easier. Press :kbd:`F3` to return to the regular prompt.
fa: در ویندوز یا سیستم‌های شبه یونیکس با پشتیبانی از :mod:`curses`، به طور پیش‌فرض از یک پوسته تعاملی جدید استفاده می‌شود. این یکی از رنگ‌ها، ویرایش چند خطی، مرور تاریخ و حالت چسباندن پشتیبانی می‌کند. برای غیرفعال کردن رنگ، برای جزئیات بیشتر به :ref:`using-on-controlling-color` مراجعه کنید. کلیدهای عملکرد برخی از عملکردهای اضافی را ارائه می دهند. :kbd:`F1` وارد مرورگر کمک تعاملی :mod:`pydoc` می شود. :kbd:`F2` امکان مرور تاریخچه خط فرمان را بدون خروجی و فرمان های :term:`>>>` و :term:`...` فراهم می کند. :kbd:`F3` وارد "حالت چسباندن" می شود که چسباندن بلوک های بزرگتر کد را آسان تر می کند. برای بازگشت به دستور معمولی, :kbd:`F3` را فشار دهید.

source: When using the new interactive shell, exit the shell by typing :kbd:`exit` or :kbd:`quit`. Adding call parentheses after those commands is not required.
fa: هنگام استفاده از پوسته تعاملی جدید، با تایپ :kbd:`exit` یا :kbd:`quit` از پوسته خارج شوید. اضافه کردن پرانتز تماس بعد از آن دستورات لازم نیست.

source: If the new interactive shell is not desired, it can be disabled via the :envvar:`PYTHON_BASIC_REPL` environment variable.
fa: اگر پوسته تعاملی جدید مورد نظر نباشد، می توان آن را از طریق متغیر محیطی :envvar:`PYTHON_BASIC_REPL` غیرفعال کرد.

source: Error Handling
fa: رسیدگی به خطا

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit status; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
fa: هنگامی که یک خطا رخ می دهد، مترجم یک پیام خطا و یک ردیابی پشته را چاپ می کند. در حالت تعاملی، سپس به اعلان اولیه باز می گردد. هنگامی که ورودی از یک فایل می آید، پس از چاپ ردیابی پشته، با وضعیت خروج غیر صفر خارج می شود. (استثناهایی که توسط یک بند :keyword:`except` در دستور :keyword:`try` استفاده می شود, در این زمینه خطا نیستند.) برخی از خطاها بدون قید و شرط کشنده هستند و باعث خروجی با وضعیت خروج غیر صفر می شوند. این در مورد ناهماهنگی های داخلی و برخی موارد تمام شدن حافظه صدق می کند. همه پیام های خطا در جریان خطای استاندارد نوشته می شوند. خروجی عادی از دستورات اجرا شده در خروجی استاندارد نوشته می شود.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
fa: تایپ کاراکتر وقفه (معمولا :kbd:`Control-C` یا :kbd:`Delete`) در اعلان اولیه یا ثانویه، ورودی را لغو می کند و به اعلان اصلی باز می گردد. [#]_ تایپ یک وقفه در حین اجرای فرمان، استثناء :exc:`KeyboardInterrupt` را افزایش می‌دهد، که ممکن است توسط یک دستور :keyword:`try` مدیریت شود.

source: Executable Python Scripts
fa: اسکریپت های اجرایی پایتون

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
fa: در سیستم‌های BSD'ish Unix، اسکریپت‌های پایتون را می‌توان مستقیماً مانند اسکریپت‌های پوسته با قرار دادن خط :: قابل اجرا ساخت.

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
fa: (با فرض اینکه مفسر روی :envvar:`PATH` کاربر باشد) در ابتدای اسکریپت و دادن حالت اجرایی به فایل. ``#!`` باید دو کاراکتر اول فایل باشد. در برخی از پلتفرم‌ها، این خط اول باید با پایان خط به سبک یونیکس (``'\n'``) به پایان برسد، نه پایان خط ویندوز (``'\r\n'``). توجه داشته باشید که کاراکتر هش یا پوند، ``'#'``، برای شروع یک نظر در پایتون استفاده می شود.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
fa: با استفاده از دستور :program:`chmod` می توان به اسکریپت یک حالت اجرایی یا مجوز داد.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
fa: در سیستم های ویندوز، هیچ مفهومی از "حالت اجرایی" وجود ندارد. نصب‌کننده پایتون به‌طور خودکار فایل‌های ``.py`` را با ``python.exe`` مرتبط می‌کند تا با دوبار کلیک کردن روی فایل پایتون آن را به‌عنوان یک اسکریپت اجرا کند. پسوند همچنین می تواند ``.pyw`` باشد، در این صورت، پنجره کنسولی که به طور معمول ظاهر می شود، سرکوب می شود.

source: The Interactive Startup File
fa: فایل راه اندازی تعاملی

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
fa: هنگامی که از پایتون به صورت تعاملی استفاده می کنید، هر بار که مفسر شروع می شود، اجرای برخی از دستورات استاندارد اغلب مفید است. شما می توانید این کار را با تنظیم یک متغیر محیطی به نام :envvar:`PYTHONSTARTUP` به نام فایل حاوی دستورات راه اندازی انجام دهید. این شبیه به ویژگی :file:`.profile` پوسته های یونیکس است.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
fa: این فایل فقط در جلسات تعاملی خوانده می شود، نه زمانی که پایتون دستورات را از یک اسکریپت می خواند، و نه زمانی که :file:`/dev/tty` به عنوان منبع صریح دستورات داده می شود (که در غیر این صورت مانند یک جلسه تعاملی رفتار می کند). در همان فضای نامی که دستورات تعاملی اجرا می‌شوند اجرا می‌شود، به طوری که اشیایی را که تعریف می‌کند یا وارد می‌کند، می‌توانند بدون صلاحیت در جلسه تعاملی استفاده شوند. همچنین می توانید دستورات ``sys.ps1`` و ``sys.ps2`` را در این فایل تغییر دهید.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
fa: اگر می‌خواهید یک فایل راه‌اندازی اضافی را از دایرکتوری فعلی بخوانید، می‌توانید آن را در فایل راه‌اندازی جهانی با استفاده از کدهایی مانند ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())`` برنامه‌ریزی کنید. اگر می خواهید از فایل راه اندازی در یک اسکریپت استفاده کنید، باید این کار را به صراحت در اسکریپت انجام دهید:

source: The Customization Modules
fa: ماژول های سفارشی سازی

source: Python provides two hooks to let you customize it: :index:`sitecustomize` and :index:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
fa: پایتون دو قلاب برای سفارشی کردن آن فراهم می کند: :index:`sitecustomize` و :index:`usercustomize`. برای اینکه ببینید چگونه کار می‌کند، ابتدا باید مکان فهرست بسته‌های سایت کاربر خود را پیدا کنید. پایتون را راه اندازی کنید و این کد را اجرا کنید:

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
fa: حالا می توانید یک فایل به نام :file:`usercustomize.py` در آن دایرکتوری ایجاد کنید و هر چیزی را که می خواهید در آن قرار دهید. هر فراخوانی پایتون را تحت تأثیر قرار می دهد، مگر اینکه با گزینه :option:`-s` شروع شود تا واردات خودکار غیرفعال شود.

source: :index:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :index:`usercustomize`. See the documentation of the :mod:`site` module for more details.
fa: :index:`sitecustomize` به همین روش کار می‌کند، اما معمولاً توسط یک مدیر رایانه در فهرست جهانی بسته‌های سایت ایجاد می‌شود و قبل از :index:`usercustomize` وارد می‌شود. برای جزئیات بیشتر به مستندات ماژول :mod:`site` مراجعه کنید.

source: Footnotes
fa: پاورقی ها

source: A problem with the GNU Readline package may prevent this.
fa: یک مشکل در بسته Readline گنو ممکن است از این امر جلوگیری کند.
