Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/tutorial/controlflow.po
Languages: hu, zh_cn

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
hu: Megjegyzendő, hogy a ``kulcsszavak`` nevű szótár tartalmának kinyomtatása előtt a ``kulcsok`` változóba a ``kulcsszavak`` szótár kulcsszavainak rendezett listáját raktuk; ha nem ezt tesszük, akkor az a sorrend, ahogy az argumentumokat kiiratjuk határozatlan lenne.
zh_cn: 注意打印时关键字参数的顺序保证与调用函数时提供它们的顺序是相匹配的。

source: Arbitrary Argument Lists
hu: Tetszőleges hosszúságú argumentumlisták
zh_cn: 任意的参数列表

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
hu: Végül itt a legritkábban használt lehetőség, amikor egy függvénynek tetszőleges számú argumentuma lehet. Ezeket az argumentumokat egy tuple-ba helyezi el a Python. A változó számosságú argumentum előtt akárhány (akár egy sem) egyszerű argumentum is előfordulhat. ::
zh_cn: 最后，最不常用的选项是可以使用任意数量的参数调用函数。这些参数会被包含在一个元组里（参见 :ref:`tut-tuples` ）。在可变数量的参数之前，可能会出现零个或多个普通参数。::

source: Normally, these ``variadic`` arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
hu: Normális esetben ezek az úgynevezett ``variadikus`` argumentumoknak kell a formális paraméterek legvégén állniuk, mivel ezek gyűjtik össze az összes maradék bemenő argumentumot, amelyet a függvénynek megadtunk. Minden formális paraméter, amely az ``*args`` paraméter után áll, csak kulcsszóval hívható meg, nem lehet hely szerinti argumentumként meghívni. ::
zh_cn: 一般来说，这些 ``可变参数`` 将在形式参数列表的末尾，因为它们收集传递给函数的所有剩余输入参数。出现在 ``*args`` 参数之后的任何形式参数都是 ‘仅关键字参数’，也就是说它们只能作为关键字参数而不能是位置参数。::

source: Unpacking Argument Lists
hu: Argumentumlista kicsomagolása
zh_cn: 解包参数列表

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*`` operator to unpack the arguments out of a list or tuple::
zh_cn: 当参数已经在列表或元组中但需要为需要单独位置参数的函数调用解包时，会发生相反的情况。例如，内置的 :func:`range` 函数需要单独的 *start* 和 *stop* 参数。如果它们不能单独使用，请使用 ``*`` 运算符编写函数调用以从列表或元组中解包参数::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**`` operator::
zh_cn: 以同样的方式，字典可以使用 ``**`` 运算符来提供关键字参数::

source: Lambda Expressions
hu: Lambda-formák
zh_cn: Lambda 表达式

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
hu: A :keyword:`lambda` kulcsszóval rövid névtelen függvényeket lehet létrehozni. Íme egy függvény, amely a két argumentumának összegével tér vissza: ``lambda a, b: a+b``. A lambda-formákat mindenhol használhatjuk, ahol függvényobjektumok szerepelhetnek. Szintaktikailag egyetlen kifejezés szerepelhet bennük. Értelmét tekintve hab a normális függvények tortáján. A beágyazott függvényekhez hasonlóan látja az őt meghívó környezet minden változóját. ::
zh_cn: 可以用 :keyword:`lambda` 关键字来创建一个小的匿名函数。这个函数返回两个参数的和： ``lambda a, b: a+b`` 。Lambda函数可以在需要函数对象的任何地方使用。它们在语法上限于单个表达式。从语义上来说，它们只是正常函数定义的语法糖。与嵌套函数定义一样，lambda函数可以引用所包含域的变量::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
hu: A fenti példa arra használja a lambda-kifejezést, hogy egy függvényt adjon vissza. Ezen kívül lehetőséget biztosít, hogy egy függvényt adhassunk át argumentumként::
zh_cn: 上面的例子使用一个lambda表达式来返回一个函数。另一个用法是传递一个小函数作为参数::

source: Documentation Strings
hu: A dokumentációs karakterláncok
zh_cn: 文档字符串

source: Here are some conventions about the content and formatting of documentation strings.
hu: A dokumentációs karakterláncok tartalmával és formájával kapcsolatban egy kialakult és bevált szokásról beszélhetünk.
zh_cn: 以下是有关文档字符串的内容和格式的一些约定。

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
hu: Az első sor mindig az objektum céljának rövid, tömör összegzése. Rövidsége miatt nem kell tartalmaznia az objektum nevét vagy típusát, hiszen ezek az adatok más úton is kinyerhetők (kivéve, ha az objektum neve a függvény működését leíró ige). A szöveg nagybetűvel kezdődik és ponttal végződik.
zh_cn: 第一行应该是对象目的的简要概述。为简洁起见，它不应显式声明对象的名称或类型，因为这些可通过其他方式获得（除非名称恰好是描述函数操作的动词）。这一行应以大写字母开头，以句点结尾。

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
hu: Ha a dokumentációs karakterlánc (``docstring``) több sorból áll, a második sor üres lesz -- ezzel vizuálisan elkülönítjük az összefoglalót a leírás további részétől. Az üres sort egy vagy több rész követheti, ahol leírjuk az objektum hívásának módját, a mellékhatásokat stb.
zh_cn: 如果文档字符串中有更多行，则第二行应为空白，从而在视觉上将摘要与其余描述分开。后面几行应该是一个或多个段落，描述对象的调用约定，它的副作用等。

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
hu: Maga a Python értelmező nem szedi le a helyközöket a többsoros literális karakterláncból -- ha ezek kiszűrése szükséges, akkor ehhez külön szövegfeldolgozó programot kellene használni. Ezt a problémát a következő konvenció használatával kezeljük. Az első sor *után* a legelső nem üres sorban megjelenő szöveg behúzási távolsága határozza meg az egész dokumentációs szöveg behúzását. (A legelső sort azért nem használjuk erre a célra, mert a szöveg első betűje általában szorosan követi a karakterláncot nyitó macskakörmöt, ennek eltolása nem lenne nyilvánvaló dolog.) A ``docstring`` -- fejrészt követő minden első sorának elejéről levágunk pont ennyi helyközt. Ha ennél kevesebb helyközt tartalmaz valamely sor -- bár ilyennek nem kéne lennie -- csak a helyközök törlődnek, karakter nem vész el. A behúzások egyenlőségét ajánlott mindig a tabulátorokat kibontva ellenőrizni (általában 1 tabulátort 8 helyközzel helyettesítünk).
zh_cn: Python 解析器不会从 Python 中删除多行字符串文字的缩进，因此处理文档的工具必须在需要时删除缩进。 这是使用以下约定完成的。 文档字符串第一行 *之后* 的第一个非空行确定整个文档字符串的缩进量。（我们不能使用第一行，因为它通常与字符串的开头引号相邻，因此它的缩进在字符串文字中不明显。）然后从字符串的所有行的开头剥离与该缩进 "等效" 的空格。 缩进更少的行不应该出现，但是如果它们出现，则应该剥离它们的所有前导空格。 应在转化制表符为空格后测试空格的等效性（通常转化为8个空格）。

source: Here is an example of a multi-line docstring::
hu: Itt van egy példa a többsoros docstring-re::
zh_cn: 下面是一个多行文档字符串的例子::

source: Function Annotations
zh_cn: 函数标注

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
zh_cn: :ref:`函数标注 <function>` 是关于用户自定义函数中使用的类型的完全可选元数据信息（有关详情请参阅 :pep:`3107` 和 :pep:`484` ）。

source: :term:`Annotations <function annotation>` are stored in the :attr:`__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a positional argument, a keyword argument, and the return value annotated::
zh_cn: :term:`函数标注 <function annotation>` 以字典的形式存放在函数的 :attr:`__annotations__` 属性中，并且不会影响函数的任何其他部分。 形参标注的定义方式是在形参名称后加上冒号，后面跟一个表达式，该表达式会被求值为标注的值。 返回值标注的定义方式是加上一个组合符号 ``->``，后面跟一个表达式，该标注位于形参列表和表示 :keyword:`def` 语句结束的冒号之间。 下面的示例有一个位置参数，一个关键字参数以及返回值带有相应标注::

source: Intermezzo: Coding Style
hu: Intermezzo: kódolási stílus
zh_cn: 小插曲：编码风格

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
hu: Most már egy hosszabb és összetettebb Python kódot szeretnél írni, itt az idő, hogy beszéljünk a *kódolási stílusról*. A legtöbb nyelven többféle módon lehet írni (pontosabban *formázni*); némelyik sokkal olvashatóbb mint másikak. Az, hogy a kódunkat mások számára is olvashatóvá tegyük mindig jó ötlet, és egy helyes kódolási stílus elfogadása sokat segít ebben.
zh_cn: 现在你将要写更长，更复杂的 Python 代码，是时候讨论一下 *代码风格* 了。 大多数语言都能以不同的风格被编写（或更准确地说，被格式化）；有些比其他的更具有可读性。 能让其他人轻松阅读你的代码总是一个好主意，采用一种好的编码风格对此有很大帮助。

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
hu: A Python számára a :pep:`8` vált a stílus útmutatójává, amelyet a legtöbb projekt követ; egy nagyon olvasható és szemnek kellemes kódolási stílust javasol. Minden Python-fejlesztőnek el kellene olvasnia valamikor. Itt találod a legfontosabb pontjait:
zh_cn: 对于Python，:pep:`8` 已经成为大多数项目所遵循的风格指南；它促进了一种非常易读且令人赏心悦目的编码风格。每个Python开发人员都应该在某个时候阅读它；以下是为你提取的最重要的几个要点：

source: Use 4-space indentation, and no tabs.
hu: Használj 4-szóköz behúzást, de tabulátorokat ne!
zh_cn: 使用4个空格缩进，不要使用制表符。

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
hu: A 4 szóköz jó középút a kis behúzás (amely nagyobb egymásbaágyazási mélységet enged meg) és a nagy behúzás (egyszerűbb olvasni) között. A tabulátorok keveredést okozhatnak, így jobb, ha elkerüljük.
zh_cn: 4个空格是一个在小缩进（允许更大的嵌套深度）和大缩进（更容易阅读）的一种很好的折中方案。制表符会引入混乱，最好不要使用它。

source: Wrap lines so that they don't exceed 79 characters.
hu: Törjük úgy a sorokat, hogy ne lépjék túl a 79 karakter hosszúságot!
zh_cn: 换行，使一行不超过79个字符。

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
hu: Ez segíti azokat a felhasználókat, akiknek kisebb a kijelzőjük, és lehetővé teszi, hogy több programfájlt jelenítsünk meg egymás mellett nagyobb kijelzőn.
zh_cn: 这有助于使用小型显示器的用户，并且可以在较大的显示器上并排放置多个代码文件。

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
hu: Használj üres sorokat, hogy elválaszd a függvényeket és az osztályokat, valamint a nagyobb blokkokat egy függvényen belül!
zh_cn: 使用空行分隔函数和类，以及函数内的较大的代码块。

source: When possible, put comments on a line of their own.
hu: Ha lehet a megjegyzéseket a saját sorába írd!
zh_cn: 如果可能，把注释放到单独的一行。

source: Use docstrings.
hu: Használj dokumentációs karakterláncokat!
zh_cn: 使用文档字符串。

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
hu: Használj szóközöket a műveleti jelek körül és a vesszők után ``a = f(1, 2) + g(3, 4)``!
zh_cn: 在运算符前后和逗号后使用空格，但不能直接在括号内使用： ``a = f(1, 2) + g(3, 4)``。

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
zh_cn: 以一致的规则为你的类和函数命名；按照惯例应使用 ``UpperCamelCase`` 来命名类，而以 ``lowercase_with_underscores`` 来命名函数和方法。 始终应使用 ``self`` 来命名第一个方法参数 (有关类和方法的更多信息请参阅 :ref:`tut-firstclasses`)。

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
hu: Ne használj különleges kódolásokat, ha a kódodat várhatóan nemzetközi környezetben is használni fogják! A Python alapértelmezett UTF-8 kódolása, vagy az ASCII minden esetben jól működik.
zh_cn: 如果你的代码旨在用于国际环境，请不要使用花哨的编码。Python 默认的 UTF-8 或者纯 ASCII 在任何情况下都能有最好的表现。

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
hu: Szintén ne használj nem-ASCII karaktert az azonosítókban, ha csak a legkisebb esélye is van, hogy más nyelvet beszélő emberek fogják olvasni vagy karbantartani a kódot!
zh_cn: 同样，哪怕只有很小的可能，遇到说不同语言的人阅读或维护代码，也不要在标识符中使用非ASCII字符。

source: Footnotes
hu: Lábjegyzet
zh_cn: 备注

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
hu: Valójában az *objektumhivatkozással történő hívás* jobb elnevezés lenne, mivel, ha egy megváltoztatható objektumot adunk át, a hívó látni fogja az összes változást, amit a hívott függvény végez (elem beszúrása listába).
zh_cn: 实际上，*通过对象引用调用* 会是一个更好的表述，因为如果传递的是可变对象，则调用者将看到被调用者对其做出的任何更改（插入到列表中的元素）。
