Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/tutorial/controlflow.po
Languages: hu, zh_cn

source: More Control Flow Tools
hu: További vezérlő utasítások
zh_cn: 其他流程控制工具

source: Besides the :keyword:`while` statement just introduced, Python uses the usual flow control statements known from other languages, with some twists.
zh_cn: 除了刚刚介绍过的 :keyword:`while` 语句，Python 中也会使用其他语言中常见的流程控制语句，只是稍有变化。

source: :keyword:`!if` Statements
zh_cn: :keyword:`!if` 语句

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
hu: Talán a legjobban ismert utasítástípus az :keyword:`if` utasítás. Példa::
zh_cn: 可能最为人所熟知的编程语句就是 :keyword:`if` 语句了。例如 ::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
zh_cn: 可以有零个或多个 :keyword:`elif` 部分，以及一个可选的 :keyword:`else` 部分。 关键字 ':keyword:`!elif`' 是 'else if' 的缩写，适合用于避免过多的缩进。 一个 :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... 序列可以看作是其他语言中的 ``switch`` 或 ``case`` 语句的替代。

source: :keyword:`!for` Statements
zh_cn: :keyword:`!for` 语句

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
zh_cn: Python 中的 :keyword:`for` 语句与你在 C 或 Pascal 中可能用到的有所不同。 Python 中的 :keyword:`!for` 语句并不总是对算术递增的数值进行迭代（如同 Pascal），或是给予用户定义迭代步骤和暂停条件的能力（如同 C），而是对任意序列进行迭代（例如列表或字符串），条目的迭代顺序与它们在序列中出现的顺序一致。 例如（此处英文为双关语）:

source: If you need to modify the sequence you are iterating over while inside the loop (for example to duplicate selected items), it is recommended that you first make a copy. Iterating over a sequence does not implicitly make a copy. The slice notation makes this especially convenient::
hu: Ha szükséges megváltoztatnod egy listát amelyen végigmész a for-ciklussal (például, hogy megduplázz bizonyos kiválasztott elemeket), akkor a lista másolatát használd a for-ciklusban. A for ciklus nem hoz létre önmagától egy másolatot. A szelet (slice) jelölési móddal viszont ezt kényelmesen megteheted::
zh_cn: 如果在循环内需要修改序列中的值（比如重复某些选中的元素），推荐你先拷贝一份副本。对序列进行循环不代表制作了一个副本进行操作。切片操作使这件事非常简单：

source: With ``for w in words:``, the example would attempt to create an infinite list, inserting ``defenestrate`` over and over again.
hu: A ``for s in szavak`` használatával a példa egy végtelen listát próbálna létrehozni újra és újra hozzáfűzve a ``defenestrate`` szót.
zh_cn: 如果写成 ``for w in words:``，这个示例就会创建无限长的列表，一次又一次重复地插入 ``defenestrate``。

source: The :func:`range` Function
hu: A :func:`range` függvény
zh_cn: :func:`range` 函数

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
hu: Ha egy számsorozaton kell végighaladnunk, a :func:`range` beépített függvény lehet szolgálatunkra. Ez egy számtani sorozatot állít elő::
zh_cn: 如果你确实需要遍历一个数字序列，内置函数 :func:`range` 会派上用场。它生成算术级数::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
hu: A megadott végpont sohasem része a listának; ``range(10)`` 10 értéket hoz létre, pontosan egy tízelemű sorozat indexeit. Lehetőség van rá, hogy a sorozat más számmal kezdődjön, vagy hogy más lépésközt adjunk meg (akár negatívat is)::
zh_cn: 给定的终止数值并不在要生成的序列里；``range(10)`` 会生成10个值，并且是以合法的索引生成一个长度为10的序列。range也可以以另一个数字开头，或者以指定的幅度增加（甚至是负数；有时这也被叫做 '步进'） ::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
hu: Ha egy sorozat indexein akarunk végighaladni, használjuk a :func:`range` és :func:`len` függvényeket a következőképpen::
zh_cn: 要以序列的索引来迭代，您可以将 :func:`range` 和 :func:`len` 组合如下::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
zh_cn: 然而，在大多数这类情况下，使用 :func:`enumerate` 函数比较方便，请参见 :ref:`tut-loopidioms` 。

source: A strange thing happens if you just print a range::
zh_cn: 如果你只打印 range，会出现奇怪的结果::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
zh_cn: :func:`range` 所返回的对象在许多方面表现得像一个列表，但实际上却并不是。此对象会在你迭代它时基于所希望的序列返回连续的项，但它没有真正生成列表，这样就能节省空间。

source: We say such an object is *iterable*, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such an *iterator*. The function :func:`list` is another; it creates lists from iterables::
zh_cn: 我们说这样的对象是 *可迭代的* ，也就是说，适合作为函数和结构体的参数，这些函数和结构体期望在迭代结束之前可以从中获取连续的元素。我们已经看到 :keyword:`for` 语句就是这样一个迭代器。函数 :func:`list` 是另外一个；它从可迭代对象中创建列表。

source: Later we will see more functions that return iterables and take iterables as argument.
zh_cn: 后面，我们会看到更多返回可迭代对象的函数，和以可迭代对象作为参数的函数。

source: :keyword:`!break` and :keyword:`!continue` Statements, and :keyword:`!else` Clauses on Loops
zh_cn: :keyword:`!break` 和 :keyword:`!continue` 语句，以及循环中的 :keyword:`!else` 子句

source: The :keyword:`break` statement, like in C, breaks out of the innermost enclosing :keyword:`for` or :keyword:`while` loop.
zh_cn: :keyword:`break` 语句，和 C 中的类似，用于跳出最近的 :keyword:`for` 或 :keyword:`while` 循环.

source: Loop statements may have an :keyword:`!else` clause; it is executed when the loop terminates through exhaustion of the list (with :keyword:`for`) or when the condition becomes false (with :keyword:`while`), but not when the loop is terminated by a :keyword:`break` statement. This is exemplified by the following loop, which searches for prime numbers::
zh_cn: 循环语句可能带有一个 :keyword:`!else` 子句；它会在循环遍历完列表 (使用 :keyword:`for`) 或是在条件变为假 (使用 :keyword:`while`) 的时候被执行，但是不会在循环被 :keyword:`break` 语句终止时被执行。 这可以通过以下搜索素数的循环为例来进行说明::

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the :keyword:`for` loop, **not** the :keyword:`if` statement.)
hu: (Igen, ez a helyes kód. Nézd meg alaposan: az ``else`` ág a :keyword:`for` ciklushoz, és **nem** az :keyword:`if` utasításhoz tartozik.)
zh_cn: （是的，这是正确的代码。仔细看： ``else`` 子句属于 :keyword:`for` 循环， **不属于** :keyword:`if` 语句。）

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does that of :keyword:`if` statements: a :keyword:`!try` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the :keyword:`!try` statement and exceptions, see :ref:`tut-handling`.
zh_cn: 当和循环一起使用时，``else`` 子句与 :keyword:`try` 语句中的 ``else`` 子句的共同点多于 :keyword:`if` 语句中的子句: :keyword:`!try` 语句中的 ``else`` 子句会在未发生异常时执行，而循环中的 ``else`` 子句则会在未发生 ``break`` 时执行。 有关 :keyword:`!try` 语句和异常的更多信息，请参阅 :ref:`tut-handling`。

source: The :keyword:`continue` statement, also borrowed from C, continues with the next iteration of the loop::
hu: A :keyword:`continue` utasítás, amely szintén a C-ből származik, a következő iterációval folytatja a ciklust::
zh_cn: :keyword:`continue` 语句也是借鉴自 C 语言，表示继续循环中的下一次迭代::

source: :keyword:`!pass` Statements
zh_cn: :keyword:`!pass` 语句

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
hu: A :keyword:`pass` utasítás nem csinál semmit. Akkor használható, ha szintaktikailag szükség van egy utasításra, de a programban nem kell semmit sem csinálni. Például::
zh_cn: :keyword:`pass` 语句什么也不做。当语法上需要一个语句，但程序需要什么动作也不做时，可以使用它。例如::

source: This is commonly used for creating minimal classes::
hu: Gyakran használjuk arra, hogy minimális osztályt hozzunk létre::
zh_cn: 这通常用于创建最小的类::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
zh_cn: :keyword:`pass` 的另一个可以使用的场合是在你编写新的代码时作为一个函数或条件子句体的占位符，允许你保持在更抽象的层次上进行思考。 :keyword:`!pass` 会被静默地忽略::

source: Defining Functions
hu: Függvények definiálása
zh_cn: 定义函数

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
hu: Létrehozhatunk egy függvényt, amely egy megadott értékig írja ki a Fibonacci--sorozatot::
zh_cn: 我们可以创建一个输出任意范围内 Fibonacci 数列的函数::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
hu: A :keyword:`def` kulcsszó a függvény *definícióját* jelzi. Ezt egy függvénynévnek, majd zárójelben a paraméterek listájának kell követnie. Az utasítások -- amelyek a definíció testét alkotják -- a következő sorban kezdődnek, és behúzással kell kezdeni azokat.
zh_cn: 关键字 :keyword:`def` 引入一个函数 *定义*。它必须后跟函数名称和带括号的形式参数列表。构成函数体的语句从下一行开始，并且必须缩进。

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
hu: A függvény testének első utasítása lehet egy literális karakterlánc is; ez a karakterlánc a függvény dokumentációs karakterlánca, angolul röviden :dfn:`docstring`. (Bővebben a docstring-ről a következő fejezetben: :ref:`tut-docstrings`.) Vannak eszközök, amelyek a :dfn:`docstring`-et használják ahhoz, hogy az online vagy a nyomtatott dokumentációt automatikusan elkészítsék, vagy hogy a felhasználót segítsék a kódban történő interaktív böngészéshez. Jó szokás, hogy a docstringet beleírjuk a kódba, kérünk téged hogy te is szokjál rá.
zh_cn: 函数体的第一个语句可以（可选的）是字符串文字；这个字符串文字是函数的文档字符串或 :dfn:`docstring` 。（有关文档字符串的更多信息，请参阅 :ref:`tut-docstrings` 部分）有些工具使用文档字符串自动生成在线或印刷文档，或者让用户以交互式的形式浏览代码；在你编写的代码中包含文档字符串是一种很好的做法，所以要养成习惯。

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
zh_cn: 函数的 *执行* 会引入一个用于函数局部变量的新符号表。 更确切地说，函数中所有的变量赋值都将存储在局部符号表中；而变量引用会首先在局部符号表中查找，然后是外层函数的局部符号表，再然后是全局符号表，最后是内置名称的符号表。 因此，全局变量和外层函数的变量不能在函数内部直接赋值（除非是在 :keyword:`global` 语句中定义的全局变量，或者是在 :keyword:`nonlocal` 语句中定义的外层函数的变量），尽管它们可以被引用。

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, a new local symbol table is created for that call.
hu: A függvényhívás aktuális paraméterei (argumentumai) bekerülnek a hívott függvény helyi szimbólumtáblájába amikor azt meghívjuk, így az argumentumok mindig *értékeket* adnak át (ahol az *érték* mindig az objektumra történő *hivatkozás*, nem az objektum értéke). [#]_ Ha a függvény egy másik függvényt hív, akkor az új híváshoz egy új helyi szimbólumtábla jön létre.
zh_cn: 在函数被调用时，实际参数（实参）会被引入被调用函数的本地符号表中；因此，实参是通过 *按值调用* 传递的（其中 *值* 始终是对象 *引用* 而不是对象的值）。[#]_ 当一个函数调用另外一个函数时，将会为该调用创建一个新的本地符号表。

source: A function definition introduces the function name in the current symbol table. The value of the function name has a type that is recognized by the interpreter as a user-defined function. This value can be assigned to another name which can then also be used as a function. This serves as a general renaming mechanism::
hu: A függvénydefiníció a függvény nevét beírja az aktuális szimbólumtáblába. A függvénynév értékének van egy típusa, amelyet a fordító a felhasználó által definiált függvényként ismer fel. Ezt az értéket társíthatjuk egy másik változóhoz, amely ekkor szintén függvényként használható. Ez egy általános átnevezési eljárásként szolgál::
zh_cn: 函数定义会把函数名引入当前的符号表中。函数名称的值具有解释器将其识别为用户定义函数的类型。这个值可以分配给另一个名称，该名称也可以作为一个函数使用。这用作一般的重命名机制::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
hu: Más nyelvektől jőve kifogásolhatja valaki, hogy a ``fib`` nem függvény, hanem eljárás, mivel nem tér vissza semmilyen értékkel. Valójában azok a függvények is, amelyekben nincs :keyword:`return` utasítás, visszaadnak egy értéket, bár egy elég unalmasat. Ez az érték a ``None`` (egy beépített név). A ``None`` érték kiírását általában elnyomja az értelmező, ha csak ezt az értéket kell kiírnia. Erről meggyőződhetünk, ha akarunk a :func:`print` függvény használatával::
zh_cn: 如果你学过其他语言，你可能会认为 ``fib`` 不是函数而是一个过程，因为它并不返回值。事实上，即使没有 :keyword:`return` 语句的函数也会返回一个值，尽管它是一个相当无聊的值。这个值称为 ``None`` （它是内置名称）。一般来说解释器不会打印出单独的返回值 ``None`` ，如果你真想看到它，你可以使用 :func:`print` ::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
hu: Könnyen írhatunk olyan függvényt, amely visszatér a Fibonacci-sorozat értékeit tartalmazó listával ahelyett, hogy kiíratná azokat::
zh_cn: 写一个返回斐波那契数列的列表（而不是把它打印出来）的函数，非常简单::

source: This example, as usual, demonstrates some new Python features:
hu: Ez a példa néhány új vonását mutatja a Pythonnak:
zh_cn: 此示例中，像往常一样，演示了一些新的 Python 功能:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
zh_cn: :keyword:`return` 语句会从函数内部返回一个值。 不带表达式参数的 :keyword:`!return` 会返回 ``None``。 函数执行完毕退出也会返回 ``None``。

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
hu: A ``eredmeny.append(b)`` utasítás meghívja az ``eredmeny`` listaobjektum egy metódusát. A metódus egy olyan függvény, amely egy objektumhoz tartozik, ``obj.metódusnév`` alakban írjuk, ahol az ``obj`` valamelyik objektum (lehet egy kifejezés), és a ``metódusnév`` egy olyan metódus neve, amelyet az objektumtípus definiál. Különböző típusoknak különböző metódusai vannak. Különböző típusoknak lehet azonos nevű metódusa mindenféle kétértelműség veszélye nélkül. (Lehetőség van rá, hogy definiáljunk saját objektumokat és metódusokat *osztályok* használatával, lásd :ref:`tut-classes`)
zh_cn: ``result.append(a)`` 语句调用了列表对象 ``result`` 的 *方法* 。方法是“属于”一个对象的函数，它被命名为 ``obj.methodname`` ，其中 ``obj`` 是某个对象（也可能是一个表达式）， ``methodname`` 是由对象类型中定义的方法的名称。不同的类型可以定义不同的方法。不同类型的方法可以有相同的名称而不会引起歧义。（可以使用 *类* 定义自己的对象类型和方法，请参阅 :ref:`tut-classes` ）示例中的方法 :meth:`append` 是为列表对象定义的；它会在列表的最后添加一个新的元素。在这个示例中它相当于 ``result = result + [a]`` ，但更高效。

source: More on Defining Functions
hu: A függvények definiálásáról bővebben
zh_cn: 函数定义的更多形式

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
hu: Lehetőségünk van függvényeket definiálni változó számú argumentummal. Ennek három formája van, amelyek variálhatók.
zh_cn: 给函数定义有可变数目的参数也是可行的。这里有三种形式，可以组合使用。

source: Default Argument Values
hu: Alapértelmezett (default) argumentumértékek
zh_cn: 参数默认值

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
hu: A leghasznosabb alak az, ha egy vagy több argumentumnak is meghatározott alapértéket adunk meg (azaz egy olyan értéket, amit ez az argumentum felvesz, ha nem adunk értéket neki). Ez így egy olyan függvényt hoz létre, amelyet kevesebb argumentummal is meghívhatunk, mint amennyivel definiáltuk::
zh_cn: 最有用的形式是对一个或多个参数指定一个默认值。这样创建的函数，可以用比定义时允许的更少的参数调用，比如::

source: This function can be called in several ways:
hu: Ez a függvény többféle módon hívható meg:
zh_cn: 这个函数可以通过几种方式调用:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
hu: megadhatjuk csak a kötelező argumentumot: ``ask_ok('Valóban ki akarsz lépni?')``
zh_cn: 只给出必需的参数：``ask_ok('Do you really want to quit?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
hu: csak egy elhagyható argumentumot adunk meg: ``ask_ok('Felülírhatom a fájlt?', 2)``.
zh_cn: 给出一个可选的参数：``ask_ok('OK to overwrite the file?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
hu: minden argumentumot megadunk: ``ask_ok('Felülírhatom a fájlt?', 2, 'igen-nel vagy nem-mel válaszolj!')``.
zh_cn: 或者给出所有的参数：``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
hu: Az előző program egyben példa az :keyword:`in` kulcsszó használatára is. Így tesztelhetjük, hogy a sorozat vajon tartalmaz-e egy adott értéket, vagy nem.
zh_cn: 这个示例还介绍了 :keyword:`in` 关键字。它可以测试一个序列是否包含某个值。

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
hu: Az alapértékeket a fordító akkor határozza meg, amikor a függvény definíciójával először találkozik, emiatt ezek kiszámítása csak egyszer történik meg! Így például a következő program::
zh_cn: 默认值是在 *定义过程* 中在函数定义处计算的，所以 ::

source: will print ``5``.
hu: ``5``-öt ír ki.
zh_cn: 会打印 ``5``。

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
hu: **Fontos figyelmeztetés:** Az alapértékeket a fordító **csak egyszer** határozza meg! Emiatt különbség van, ha az alapérték megváltoztatható objektum, mint amilyen a lista, szótár vagy a legtöbb példányosodott osztály. Például az alábbi függvény összegyűjti az egymás utáni hívások során neki adott paramétereket::
zh_cn: **重要警告：** 默认值只会执行一次。这条规则在默认值为可变对象（列表、字典以及大多数类实例）时很重要。比如，下面的函数会存储在后续调用中传递给它的参数::

source: This will print ::
hu: A program kimenete::
zh_cn: 这将打印出 ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
hu: Ha nem akarod az alapértékeket láthatóvá tenni az egymást követő hívások számára, akkor inkább ehhez hasonlóan írd a függvényt::
zh_cn: 如果你不想要在后续调用之间共享默认值，你可以这样写这个函数::

source: Keyword Arguments
hu: Kulcsszavas argumentumok
zh_cn: 关键字参数

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
hu: A függvényeket akár ``kulcsszó=érték`` formában megadott, úgynevezett kulcsszavas argumentumok használatával is meghívhatunk. Például a következő függvény::
zh_cn: 也可以使用形如 ``kwarg=value`` 的 :term:`关键字参数 <keyword argument>` 来调用函数。例如下面的函数::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
hu: meghívható az összes alábbi módon::
zh_cn: 接受一个必需的参数（``voltage``）和三个可选的参数（``state``, ``action``，和 ``type``）。这个函数可以通过下面的任何一种方式调用::

source: but all the following calls would be invalid::
hu: de a következő hívások mind érvénytelenek::
zh_cn: 但下面的函数调用都是无效的::

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
hu: A függvényhívások esetén a kulcsszavas argumentumoknak a hely szerintiek után kell állniuk. Minden kulcsszavas argumentumnak olyannak kell lennie, amely egyezik a függvény által elfogadott valamelyik argumentummal (pl. az ``actor`` nem érvényes argumentum a ``parrot`` függvény számára), és a sorrendjük lényegtelen. Akár lehetnek kötelező argumentumok is (pl. ``parrot(voltage=1000)`` is érvényes). Egy hívás során nem kaphat egy argumentum egynél több alkalommal értéket. Itt van egy példa, amely nem hajtódik végre emiatt a megkötés miatt::
zh_cn: 在函数调用中，关键字参数必须跟随在位置参数的后面。传递的所有关键字参数必须与函数接受的其中一个参数匹配（比如 ``actor`` 不是函数 ``parrot`` 的有效参数），它们的顺序并不重要。这也包括非可选参数，（比如 ``parrot(voltage=1000)`` 也是有效的）。不能对同一个参数多次赋值。下面是一个因为此限制而失败的例子::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
zh_cn: 当存在一个形式为 ``**name`` 的最后一个形参时，它会接收一个字典 (参见 :ref:`typesmapping`)，其中包含除了与已有形参相对应的关键字参数以外的所有关键字参数。 这可以与一个形式为 ``*name``，接收一个包含除了已有形参列表以外的位置参数的 :ref:`元组 <tut-tuples>` 的形参 (将在下一小节介绍) 组合使用 (``*name`` 必须出现在 ``**name`` 之前。) 例如，如果我们这样定义一个函数::

source: It could be called like this::
hu: Ez meghívható így is::
zh_cn: 它可以像这样调用::

source: and of course it would print:
hu: és természetesen ezt fogja kiírni:
zh_cn: 当然它会打印::
