Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/tutorial/interpreter.po
Languages: fa, zh_cn

source: Using the Python Interpreter
fa: با استفاده از مترجم پایتون
zh_cn: 使用 Python 解释器

source: Invoking the Interpreter
fa: استناد به مترجم
zh_cn: 调用解释器

source: The Python interpreter is usually installed as :file:`/usr/local/bin/python3.8` on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
zh_cn: Python 解释器在其被使用的机器上通常安装为 :file:`/usr/local/bin/python3.8`；将 :file:`/usr/local/bin` 加入你的 Unix 终端的搜索路径就可以通过键入以下命令来启动它：

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
fa: به پوسته [#]_ از آنجایی که انتخاب دایرکتوری که مفسر در آن زندگی می کند یک گزینه نصب است، مکان های دیگری امکان پذیر است. با گورو محلی پایتون یا مدیر سیستم خود تماس بگیرید. (به عنوان مثال, :file:`/usr/local/python` یک مکان جایگزین محبوب است.)
zh_cn: 就能运行了 [#]_ 。安装时可以选择安装目录，所以解释器也可能在别的地方；可以问问你身边的 Python 大牛，或者你的系统管理员。（比如 :file:`/usr/local/python` 也是比较常用的备选路径）

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the :file:`python3.8` command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
zh_cn: 在 Windows 机器上当你从 :ref:`Microsoft Store <windows-store>` 安装 Python 之后，:file:`python3.8` 命令将可使用。 如果你安装了 :ref:`py.exe 启动器 <launcher>`，你将可以使用 :file:`py` 命令。 参阅 :ref:`setting-envvars` 了解其他启动 Python 的方式。

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
fa: تایپ یک کاراکتر انتهای فایل (:kbd:`Control-D` در یونیکس, :kbd:`Control-Z` در ویندوز) در اعلان اولیه باعث می شود که مفسر با وضعیت خروج صفر خارج شود. اگر کار نکرد، می توانید با تایپ دستور زیر از مفسر خارج شوید: ``quit()``.
zh_cn: 在主提示符中输入文件结束字符（在 Unix 系统中是 :kbd:`Control-D`，Windows 系统中是 :kbd:`Control-Z`）就退出解释器并返回退出状态为0。如果这样不管用，你还可以写这个命令退出：``quit()``。

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
fa: ویژگی‌های ویرایش خط مفسر شامل ویرایش تعاملی، جایگزینی تاریخچه و تکمیل کد در سیستم‌هایی است که از کتابخانه `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ پشتیبانی می‌کنند. شاید سریع‌ترین بررسی برای اینکه ببینید آیا ویرایش خط فرمان پشتیبانی می‌شود، تایپ :kbd:`Control-P` در اولین اعلان پایتون باشد. اگر بوق می‌دهد، ویرایش خط فرمان دارید. برای آشنایی با کلیدها به پیوست :ref:`tut-interacting` مراجعه کنید. اگر به نظر می‌رسد هیچ اتفاقی نمی‌افتد، یا اگر ``^P`` تکرار می‌شود، ویرایش خط فرمان در دسترس نیست. شما فقط می توانید از backspace برای حذف کاراکترها از خط فعلی استفاده کنید.
zh_cn: 解释器的行编辑功能在支持 `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ 库的系统中也包括交互式编辑，历史替换和代码补全等。 检测是否支持行编辑最快速的方式是在首次出现 Python 提示符时输入 :kbd:`Control-P`。 如果听到“哔”提示音，就说明支持行编辑；请参阅附录 :ref:`tut-interacting` 了解有关功能键的介绍。 如果什么都没发生，或是回显了 ``^P``，说明不支持行编辑；你只能用退格键从当前行中删除字符。

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
fa: مفسر تا حدودی مانند پوسته یونیکس عمل می کند: هنگامی که با ورودی استاندارد متصل به یک دستگاه tty فراخوانی می شود، دستورات را به صورت تعاملی می خواند و اجرا می کند. هنگامی که با آرگومان نام فایل یا با یک فایل به عنوان ورودی استاندارد فراخوانی می شود، یک *script* را از آن فایل می خواند و اجرا می کند.
zh_cn: 解释器运行的时候有点像 Unix 命令行：在一个标准输入 tty 设备上调用，它能交互式地读取和执行命令；调用时提供文件名参数，或者有个文件重定向到标准输入的话，它就会读取和执行文件中的 *脚本*。

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety with single quotes.
zh_cn: 另一种启动解释器的方式是 ``python -c command [arg] ...``，其中 *command* 要换成想执行的指令，就像命令行的 :option:`-c` 选项。由于 Python 代码中经常会包含对终端来说比较特殊的字符，通常情况下都建议用英文单引号把 *command* 括起来。

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
fa: برخی از ماژول های پایتون نیز به عنوان اسکریپت مفید هستند. اینها را می توان با استفاده از ``python -m module [arg] ...`` فراخوانی کرد، که فایل منبع را برای *module* اجرا می کند، گویی که نام کامل آن را در خط فرمان نوشته اید.
zh_cn: 有些 Python 模块也可以作为脚本使用。可以这样输入：``python -m module [arg] ...``，这会执行 *module* 的源文件，就跟你在命令行把路径写全了一样。

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
fa: وقتی از یک فایل اسکریپت استفاده می شود، گاهی اوقات مفید است که بتوان اسکریپت را اجرا کرد و بعد از آن وارد حالت تعاملی شد. این را می توان با عبور از :option:`-i` قبل از اسکریپت انجام داد.
zh_cn: 在运行脚本的时候，有时可能也会需要在运行后进入交互模式。这种时候在文件参数前，加上选项 :option:`-i` 就可以了。

source: All command line options are described in :ref:`using-on-general`.
fa: تمام گزینه های خط فرمان در :ref:`using-on-general` توضیح داده شده است.
zh_cn: 关于所有的命令行选项，请参考 :ref:`using-on-general`。

source: Argument Passing
fa: گذراندن استدلال
zh_cn: 传入参数

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
fa: وقتی برای مفسر شناخته می شود، نام اسکریپت و آرگومان های اضافی پس از آن به لیستی از رشته ها تبدیل می شود و به متغیر ``argv`` در ماژول ``sys`` اختصاص می یابد. با اجرای ``import sys`` می توانید به این لیست دسترسی پیدا کنید. طول لیست حداقل یک است. وقتی هیچ اسکریپتی و هیچ آرگومانی داده نمی شود، ``sys.argv[0]`` یک رشته خالی است. هنگامی که نام اسکریپت به عنوان ``'-'`` (به معنی ورودی استاندارد) داده می شود، ``sys.argv[0]`` روی ``'-'`` تنظیم می شود. وقتی از :option:`-c` *command* استفاده می شود، ``sys.argv[0]`` روی ``'-c'`` تنظیم می شود. هنگامی که از :option:`-m` *module* استفاده می شود، ``sys.argv[0]`` به نام کامل ماژول واقع شده تنظیم می شود. گزینه‌هایی که پس از :option:`-c` *command* یا :option:`-m` *module* یافت می‌شوند توسط پردازش گزینه مفسر پایتون مصرف نمی‌شوند، اما در ``sys.argv`` برای کنترل فرمان یا ماژول باقی می‌مانند.
zh_cn: 如果可能的话，解释器会读取命令行参数，转化为字符串列表存入 ``sys`` 模块中的 ``argv`` 变量中。执行命令 ``import sys`` 你可以导入这个模块并访问这个列表。这个列表最少也会有一个元素；如果没有给定输入参数，``sys.argv[0]`` 就是个空字符串。如果给定的脚本名是 ``'-'`` (表示标准输入)，``sys.argv[0]`` 就是 ``'-'``。使用 :option:`-c` *command* 时，``sys.argv[0]`` 就会是 ``'-c'``。如果使用选项 :option:`-m` *module*，``sys.argv[0]`` 就是包含目录的模块全名。在 :option:`-c` *command* 或 :option:`-m` *module* 之后的选项不会被解释器处理，而会直接留在 ``sys.argv`` 中给命令或模块来处理。

source: Interactive Mode
fa: حالت تعاملی
zh_cn: 交互模式

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
fa: هنگامی که دستورات از یک tty خوانده می شوند، مفسر در *interactive mode* گفته می شود. در این حالت دستور بعدی را با *primary prompt*، معمولاً سه علامت بزرگتر از (``>>>``) درخواست می کند. برای خطوط ادامه با *secondary prompt*, به طور پیش فرض سه نقطه (``...``) درخواست می کند. مترجم یک پیام خوشامدگویی را چاپ می کند که شماره نسخه و یک اعلامیه حق نسخه برداری را قبل از چاپ اولین درخواست نشان می دهد:
zh_cn: 在终端（tty）输入并执行指令时，我们说解释器是运行在 *交互模式（interactive mode）*。在这种模式中，它会显示 *主提示符（primary prompt）*，提示输入下一条指令，通常用三个大于号（``>>>``）表示；连续输入行的时候，它会显示 *次要提示符*，默认是三个点（``...``）。进入解释器时，它会先显示欢迎信息、版本信息、版权声明，然后就会出现提示符：

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
fa: هنگام ورود به ساختار چند خطی به خطوط ادامه نیاز است. به عنوان مثال، به این عبارت :keyword:`if` نگاه کنید:
zh_cn: 多行指令需要在连续的多行中输入。比如，以 :keyword:`if` 为例：

source: For more on interactive mode, see :ref:`tut-interac`.
fa: برای اطلاعات بیشتر در مورد حالت تعاملی، به :ref:`tut-interac` مراجعه کنید.
zh_cn: 有关交互模式的更多内容，请见 :ref:`tut-interac`。

source: The Interpreter and Its Environment
fa: مترجم و محیط آن
zh_cn: 解释器的运行环境

source: Source Code Encoding
fa: کد منبع کد
zh_cn: 源文件的字符编码

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
fa: به‌طور پیش‌فرض، فایل‌های منبع پایتون در UTF-8 کدگذاری شده‌اند. در آن رمزگذاری، کاراکترهای اکثر زبان‌های دنیا می‌توانند به طور همزمان در کلمات رشته‌ای، شناسه‌ها و نظرات استفاده شوند --- اگرچه کتابخانه استاندارد فقط از کاراکترهای ASCII برای شناسه‌ها استفاده می‌کند، قراردادی که هر کد قابل حمل باید از آن پیروی کند. برای نمایش درست همه این کاراکترها، ویرایشگر شما باید تشخیص دهد که فایل UTF-8 است و باید از فونتی استفاده کند که از همه کاراکترهای فایل پشتیبانی کند.
zh_cn: 默认情况下，Python 源码文件以 UTF-8 编码方式处理。在这种编码方式中，世界上大多数语言的字符都可以同时用于字符串字面值、变量或函数名称以及注释中——尽管标准库中只用常规的 ASCII 字符作为变量或函数名，而且任何可移植的代码都应该遵守此约定。要正确显示这些字符，你的编辑器必须能识别 UTF-8 编码，而且必须使用能支持打开的文件中所有字符的字体。

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
fa: برای اعلام رمزگذاری غیر از کد پیش‌فرض، باید یک خط نظر ویژه به عنوان خط *first* فایل اضافه شود. نحو به شرح زیر است:
zh_cn: 如果不使用默认编码，要声明文件所使用的编码，文件的 *第一* 行要写成特殊的注释。语法如下所示：

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
fa: که در آن *encoding* یکی از :mod:`codecs` معتبر است که توسط پایتون پشتیبانی می شود.
zh_cn: 其中 *encoding* 可以是 Python 支持的任意一种 :mod:`codecs`。

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
fa: به عنوان مثال، برای اعلام اینکه باید از رمزگذاری Windows-1252 استفاده شود، خط اول فایل کد منبع شما باید به صورت زیر باشد:
zh_cn: 比如，要声明使用 Windows-1252 编码，你的源码文件要写成：

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
fa: یک استثنا در قاعده *first line* زمانی است که کد منبع با :ref:`UNIX "shebang" line <tut-scripts>` شروع می شود. در این حالت، اعلان رمزگذاری باید به عنوان خط دوم فایل اضافه شود. به عنوان مثال::
zh_cn: 关于 *第一行* 规则的一种例外情况是，源码以 :ref:`UNIX "shebang" 行 <tut-scripts>` 开头。这种情况下，编码声明就要写在文件的第二行。例如：

source: Footnotes
fa: پاورقی ها
zh_cn: 备注

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
fa: در یونیکس، مفسر Python 3.x به طور پیش‌فرض با فایل اجرایی به نام ``python`` نصب نمی‌شود، بنابراین با یک فایل اجرایی Python 2.x که همزمان نصب شده است، تضاد ندارد.
zh_cn: 在Unix系统中，Python 3.x解释器默认安装后的执行文件并不叫作 ``python``，这样才不会与同时安装的Python 2.x冲突。
