Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/tutorial/venv.po
Languages: hu

source: Virtual Environments and Packages
hu: Virtuális környezetek és csomagok

source: Introduction
hu: Bevezetés

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
hu: A Python-alkalmazások gyakran használnak csomagokat és modulokat, amelyek nem részei a sztenderd könyvtárnak. Egyes alkalmazásoknak néha egy könyvtárnak egy speciális verziójára van szüksége, mert az alkalmazás feltételezi, hogy egy bizonyos hibát javította, vagy esetleg az alkalmazás a könyvtárnak egy idejétmúlt verziójához készült.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
hu: Ez azt jelenti, hogy talán nem elég egyetlen Python telepítése, hogy az összes alkalmazás igényeit kielégítse. Ha az A alkalmazásnak egy modul 1.0-ás verziójára van szüksége, a B alkalmazásnak pedig a 2.0-ásra, ez konfliktust okoz, és akár az 1.0-ás, akár a 2.0-ás verziót telepítem, az egyik alkalmazás képtelen lesz működni.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
hu: Erre a problémára az a megoldás, hogy :term:`virtual environment`-et hozunk létre: egy könyvtárstruktúrát, amelyben egy Python van telepítve egy bizonyos Python-verzióval, és pár további csomaggal.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
hu: A különböző alkalmazások így különböző virtuális környezeteket használhatnak. Ahhoz, hogy a korábbi példa ellentmondásos követelményeit feloldjuk, az A alkalmazás ezután a saját virtuális környezetét használhatja, amelyben az 1.0-ás verzió került telepítésre, a B alkalmazás egy másik virtuális környezetet, amelyben a 2.0-ás. Ha a B alkalmazás könyvtárát 3.0-ásra kell frissíteni, az nem befolyásolja az A alkalmazás környezetét.

source: Creating Virtual Environments
hu: Virtuális környezet létrehozása

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will usually install the most recent version of Python that you have available. If you have multiple versions of Python on your system, you can select a specific Python version by running ``python3`` or whichever version you want.
hu: A modult, amely képes virtuális környezetek létrehozására és kezelésére, :mod:`venv`-nek hívják. A :mod:`venv` gyakran a Python legfrissebb elérhető verzióját telepítik. Ha többféle Python-verzióra van szükségünk a rendszerünkön, a kiválaszthatunk egy speciális Python-verziót, a ``python3`` futtatásával, vagy amelyik verziót csak akarjuk.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
hu: Egy virtuális környezet létrehozásához határozzuk el, melyik könyvtárba szeretnénk helyezni, és futtassuk a :mod:`venv` modult szkriptként evvel a könyvtár-útvonallal::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter, the standard library, and various supporting files.
hu: Ez létrehoz egy ``oktato-kornyezet`` nevű könyvtárat, ha még nem létezik, és létrehoz újabb könyvtárakat ezen belül, amely tartalmazza a Python-értelmezőt, a sztenderd könyvtárat, és különböző támogató fájlokat.

source: Once you've created a virtual environment, you may activate it.
hu: Amikor létrehoztuk a virtuális környezetet, aktiválhatjuk.

source: On Windows, run::
hu: Windowson így::

source: On Unix or MacOS, run::
hu: Unixon (beleértve a Linuxokat) vagy MacOS-en így::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
hu: (Ez a szkript bash-shellhez készült. Ha :program:`csh` vagy :program:`fish` shellt használunk, akkor a ``activate.csh`` illetve ``activate.fish`` szkripteket kell használnunk.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
hu: A virtuális környezet megváltoztatása a shell-promptot is megváltoztatja, hogy mutassa, melyik virtuális környezetben vagyunk, és úgy módosítja a környezetet, hogy a ``python`` parancs futtatása a megfelelő Python-verziót és telepítést futtassa. Például:

source: Managing Packages with pip
hu: Csomagkezelés pip-pel

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the Python Package Index, <https://pypi.org>. You can browse the Python Package Index by going to it in your web browser, or you can use ``pip``'s limited search feature:
hu: Telepíthetünk, frissíthetünk és eltávolíthatunk csomagokat a :program:`pip` programmal. Alapból a ``pip`` a Python Package Indexből, <https://pypi.org>, telepíti a programokat. Böngészhetjük a Python Package Indexet a webböngészőnkben, vagy használhatjuk a ``pip`` korlátozott keresési lehetőségeit:

source: ``pip`` has a number of subcommands: "search", "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
hu: A ``pip``-nek van néhány alparancsa: "search", "install", "uninstall", "freeze", stb. (A ``pip`` teljes dokumentációja elérhető itt :ref:`installing-index`.)

source: You can install the latest version of a package by specifying a package's name:
hu: A csomag legfrissebb verzióját a csomagnév megadásával telepíthetjük:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
hu: A csomag egy adott verzióját is telepíthetjük, ha megadjuk a csomag nevét, amelyet ``==`` követ, majd a verziószám:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``pip install --upgrade`` to upgrade the package to the latest version:
hu: Ha ezt ismét futtatjuk, akkor a ``pip`` észre fogja venni, hogy a kívánt változat már telepítve van, és nem tesz semmit. Egy másik verziószámot is beírhatunk, ha azt szeretnénk telepíteni, vagy futtathatjuk a ``pip install --upgrade`` parancsot, hogy a legfrissebb változatra frissítsünk:

source: ``pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
hu: A ``pip uninstall`` parancs egy vagy több csomagnévvel folytatva eltávolítja a csomagokat a virtuális környezetből.

source: ``pip show`` will display information about a particular package:
hu: A ``pip show`` parancs tájékoztat a megadott csomag részleteiről:

source: ``pip list`` will display all of the packages installed in the virtual environment:
hu: A ``pip list`` megjeleníti a virtuális környezetbe telepített összes csomagot:

source: ``pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
hu: A ``pip freeze`` hasonló listát készít a telepített csomagokról, de a kimenet olyan formát használ, amilyet a ``pip install`` vár. Általában ezt a listát a ``requirements.txt`` fájlba szoktuk helyezni:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
hu: A ``requirements.txt`` ezután feltölthető a verziókövető rendszerbe, és az alkalmazással együtt közzétehető. Ekkor a felhasználók a szükséges csomagokat az ``install -r`` paranccsal telepíthetik:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the :ref:`distributing-index` guide.
hu: A ``pip`` sok más lehetőséget is rejt. A :ref:`installing-index` útmutatóban megtalálható a ``pip`` teljes dokumentációja. Ha saját csomagot hoztunk létre, amelyet elérhetővé szeretnénk tenni a Python Package Indexen, akkor a következő útmutatót érdemes elolvasnunk :ref:`distributing-index`.
