Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es, zh_cn

source: However, this idiom is unsafe, as it can give wrong results when *on_true* has a false boolean value. Therefore, it is always better to use the ``... if ... else ...`` form.
es: Como sea, este idioma no es seguro, ya que puede devolver resultados erroneos cuando *on_true* tiene un valor booleano falso. Por lo tanto, siempre es mejor utilizar la forma ``... if ... else ...`` .
zh_cn: 然而这种做法并不保险，因为当 *on_true* 具有布尔假值时将会给出错误的结果。 所以，使用 ``... if ... else ...`` 形式总是会更好。

source: Is it possible to write obfuscated one-liners in Python?
es: ¿Es posible escribir complicados comentarios en Python?
zh_cn: 是否可以用Python编写混淆的单行程序?

source: Yes. Usually this is done by nesting :keyword:`lambda` within :keyword:`!lambda`. See the following three examples, due to Ulf Bartelt::
zh_cn: 可以。通常是在 :keyword:`lambda` 中嵌套 :keyword:`!lambda` 来实现的。请参阅以下三个来自 Ulf Bartelt 的示例代码：

source: Don't try this at home, kids!
es: ¡No intentéis esto en casa, niños!
zh_cn: 请不要在家里尝试，骚年！

source: What does the slash(/) in the parameter list of a function mean?
zh_cn: 函数参数列表中的斜杠（/）是什么意思？

source: A slash in the argument list of a function denotes that the parameters prior to it are positional-only. Positional-only parameters are the ones without an externally-usable name. Upon calling a function that accepts positional-only parameters, arguments are mapped to parameters based solely on their position. For example, :func:`divmod` is a function that accepts positional-only parameters. Its documentation looks like this::
zh_cn: 函数参数列表中的斜杠表示在它之前的形参是仅限位置形参。 仅限位置形参没有外部可用的名称。 在调用接受仅限位置形参的函数时，参数只会基于它们的位置被映射到形参。 例如，:func:`divmod` 是一个接受仅限位置形参的函数。 它的文档是这样的::

source: The slash at the end of the parameter list means that both parameters are positional-only. Thus, calling :func:`divmod` with keyword arguments would lead to an error::
zh_cn: 在形参列表末尾的斜杠意味着两个形参都是仅限位置形参。 因此，附带关键字参数调用 :func:`divmod` 将会导致报错::

source: Numbers and strings
es: Numeros y strings
zh_cn: 数字和字符串

source: How do I specify hexadecimal and octal integers?
es: ¿Como especifico enteros octales y hexadecimales?
zh_cn: 如何指定十六进制和八进制整数？

source: To specify an octal digit, precede the octal value with a zero, and then a lower or uppercase "o". For example, to set the variable "a" to the octal value "10" (8 in decimal), type::
es: Para especificar un dígito octal, precede al valor octal con un cero, y después una minúscula o mayúscula "o". Por ejemplo, para establecer la variable "a" al valor octal "10" (8 en decimal), escribe::
zh_cn: 要指定一个八进制数码，则在八进制值之前加一个零和一个小写或大写字母 "o" 作为前缀。 例如，要将变量 "a" 设为八进制的 "10" (十进制的 8)，就输入::

source: Hexadecimal is just as easy. Simply precede the hexadecimal number with a zero, and then a lower or uppercase "x". Hexadecimal digits can be specified in lower or uppercase. For example, in the Python interpreter::
es: Los hexadecimales son simples. Simplemente precede al número hexadecimal con un cero, y tras ello una minúscula o mayúscula "x". Los dígitos hexadecimales pueden ser especificados en minúsculas o mayúsculas. Por ejemplo, en el intérprete Python::
zh_cn: 十六进制数也同样简单。 只要在十六进制数之前加一个零和一个小写或大写字母 "x"。 十六进制数码中的字母可以为大写或小写。 例如在 Python 解释器中输入::

source: Why does -22 // 10 return -3?
es: ¿Por qué -22 // 10 devueve -3?
zh_cn: 为什么-22 // 10返回-3？

source: It's primarily driven by the desire that ``i % j`` have the same sign as ``j``. If you want that, and also want::
es: Está principalmente conducido por el deseo de que ``i % j`` tienen el mismo signo que ``j``. Si quieres eso, y también quieres::
zh_cn: 这主要是为了让 ``i % j`` 的正负与 ``j`` 一致，如果你想要这样的结果，并且又想要::

source: then integer division has to return the floor. C also requires that identity to hold, and then compilers that truncate ``i // j`` need to make ``i % j`` have the same sign as ``i``.
es: entoces la división entera tiene que devolver el número mínimo. C también requiere mantener esta identidad así que los compiladores que truncan ``ì // j`` necesitan hacer que ``i % j`` tenga el mismo signo que ``i``.
zh_cn: 那么整除就必须向下取整。 C 同样要求保持一致，并且编译器在截短 ``i // j`` 的结果值时需要使 ``i % j`` 的正负与 ``i`` 一致。

source: There are few real use cases for ``i % j`` when ``j`` is negative. When ``j`` is positive, there are many, and in virtually all of them it's more useful for ``i % j`` to be ``>= 0``. If the clock says 10 now, what did it say 200 hours ago? ``-190 % 12 == 2`` is useful; ``-190 % 12 == -10`` is a bug waiting to bite.
zh_cn: 对于 ``i % j`` 来说 ``j`` 为负值的应用场景实际上是非常少的。 而 ``j`` 为正值的情况则非常多，并且实际上在所有情况下让 ``i % j`` 的结果为 ``>= 0`` 会更有用处。 如果现在时间为 10 时，那么 200 小时前应是几时？ ``-190 % 12 == 2`` 是有用处的；``-190 % 12 == -10`` 则是会导致意外的漏洞。

source: How do I convert a string to a number?
es: ¿Cómo convierto un string en un número?
zh_cn: 如何将字符串转换为数字？

source: For integers, use the built-in :func:`int` type constructor, e.g. ``int('144') == 144``. Similarly, :func:`float` converts to floating-point, e.g. ``float('144') == 144.0``.
es: Para los enteros, utiliza el constructor de tipo interno ::func:`int`, por ej. ``int('144') == 144``. De forma similar, :func:`float` convierte a punto-flotante, por ej. ``float('144') == 144.0``
zh_cn: 对于整数，可使用内置的 :func:`int` 类型构造器，例如 ``int('144') == 144``。 类似地，可使用 :func:`float` 转换为浮点数，例如 ``float('144') == 144.0``。

source: By default, these interpret the number as decimal, so that ``int('0144') == 144`` and ``int('0x144')`` raises :exc:`ValueError`. ``int(string, base)`` takes the base to convert from as a second optional argument, so ``int('0x144', 16) == 324``. If the base is specified as 0, the number is interpreted using Python's rules: a leading '0o' indicates octal, and '0x' indicates a hex number.
zh_cn: 默认情况下，这些操作会将数字按十进制来解读，因此 ``int('0144') == 144`` 而 ``int('0x144')`` 会引发 :exc:`ValueError`。 ``int(string, base)`` 接受第二个可选参数指定转换的基数，例如 ``int('0x144', 16) == 324``。 如果指定基数为 0，则按 Python 规则解读数字：前缀 '0o' 表示八进制，而 '0x' 表示十六进制。

source: Do not use the built-in function :func:`eval` if all you need is to convert strings to numbers. :func:`eval` will be significantly slower and it presents a security risk: someone could pass you a Python expression that might have unwanted side effects. For example, someone could pass ``__import__('os').system("rm -rf $HOME")`` which would erase your home directory.
zh_cn: 如果你只是想将字符串转为数字，请不要使用内置函数 :func:`eval`。 :func:`eval` 的速度会慢很多并且有安全风险：别人可能会传入具有你不想要的附带效果的 Python 表达式。 例如，别人可以传入 ``__import__('os').system("rm -rf $HOME")`` 这将删除你的家目录。

source: :func:`eval` also has the effect of interpreting numbers as Python expressions, so that e.g. ``eval('09')`` gives a syntax error because Python does not allow leading '0' in a decimal number (except '0').
zh_cn: :func:`eval` 还具有将数字解读为 Python 表达式的效果，这样 ``eval('09')`` 将会导致语法错误，因为 Python 不允许十进制数的首位是 '0' ('0' 除外)。

source: How do I convert a number to a string?
es: ¿Cómo convierto un número en un string?
zh_cn: 如何将数字转换为字符串？

source: To convert, e.g., the number 144 to the string '144', use the built-in type constructor :func:`str`. If you want a hexadecimal or octal representation, use the built-in functions :func:`hex` or :func:`oct`. For fancy formatting, see the :ref:`f-strings` and :ref:`formatstrings` sections, e.g. ``"{:04d}".format(144)`` yields ``'0144'`` and ``"{:.3f}".format(1.0/3.0)`` yields ``'0.333'``.
zh_cn: 例如要将数字 144 转换为字符串 '144'，可使用内置类型构造器 :func:`str`。 如果想要表示为十六进制或八进制数，可使用内置函数 :func:`hex` 或 :func:`oct`。 想要更好地格式化，请参阅 :ref:`f-strings` 和 :ref:`formatstrings` 等小节，例如 ``"{:04d}".format(144)`` 生成 ``'0144'`` 而 ``"{:.3f}".format(1.0/3.0)`` 生成 ``'0.333'``。

source: How do I modify a string in place?
es: ¿Cómo modifico un string in-place?
zh_cn: 如何修改字符串？

source: You can't, because strings are immutable. In most situations, you should simply construct a new string from the various parts you want to assemble it from. However, if you need an object with the ability to modify in-place unicode data, try using an :class:`io.StringIO` object or the :mod:`array` module::
es: No puedes, porque los strings son inmutables. En muchas situaciones, simplemente debes construir un nuevo string de las varias partes desde las que lo quieres ensamblar. De todos modos, si necesitas un objeto con la habilidad de modificar datos unicode in-place, trata de utilizar un objeto :class:`io.StringIO` o el módulo :mod:`array`::
zh_cn: 无法修改，因为字符串是不可变对象。 在大多数情况下，你应该使用你想要的各种部分来构造一个新字符串。 但是，如果你想要一个可以原地修改 Unicode 数据的对象，可尝试使用 :class:`io.StringIO` 对象或 :mod:`array` 模块::

source: How do I use strings to call functions/methods?
es: ¿Cómo utilizo strings para llamar a funciones/métodos?
zh_cn: 如何使用字符串调用函数/方法？

source: There are various techniques.
es: Existen varias técnicas.
zh_cn: 有多种技巧可供选择。

source: The best is to use a dictionary that maps strings to functions. The primary advantage of this technique is that the strings do not need to match the names of the functions. This is also the primary technique used to emulate a case construct::
es: La mejor es utilizar un diccionaro que mapea strings a las funciones. La ventaja principal de esta técnica es que los strings no necesitan tener el mismo nombre que las funciones. Esto también es una técnica principalmente utilizada para emular un constructor de casos::
zh_cn: 最好的做法是使用一个将字符串映射到函数的字典。 这一技巧的主要优势在于字符串不必与函数名称一致。 这也是用于模拟其他语言中 case 结构的主要技巧::

source: Use the built-in function :func:`getattr`::
es: Utiliza la función interna :func:`getattr`::
zh_cn: 使用内置函数 :func:`getattr` ::

source: Note that :func:`getattr` works on any object, including classes, class instances, modules, and so on.
es: Fíjate que :func:`getattr` funciona con cualquier objeto, incluyendo clases, instancias de clase, módulos, etc.
zh_cn: 请注意 :func:`getattr` 可用于任何对象，包括类、类实例、模块等等。

source: This is used in several places in the standard library, like this::
es: Se utiliza en diferentes lugares de la librería estándar, tal que así::
zh_cn: 在标准库中多次使用了这个技巧，例如::

source: Use :func:`locals` or :func:`eval` to resolve the function name::
es: Utiliza :func:`locals` o :func:`eval` para recabar el nombre de la función::
zh_cn: 使用 :func:`locals` 或 :func:`eval` 来解析出函数名::

source: Note: Using :func:`eval` is slow and dangerous. If you don't have absolute control over the contents of the string, someone could pass a string that resulted in an arbitrary function being executed.
es: Nota: Utilizarr :func:`eval` es lento y peligroso. Si no tienes control absoluto sobre los contenidos del string, alguien podría pasarle un string que podría resultar en'la ejecución de una función arbitraria.
zh_cn: 注意：使用 :func:`eval` 速度慢而且危险。 如果你不能绝对掌控字符串的内容，别人将能传入可被解析为任意函数直接执行的字符串。

source: Is there an equivalent to Perl's chomp() for removing trailing newlines from strings?
es: ¿Existe un equivalente a chomp() de Perl, para eliminar operadores de nueva linea de los strings?
zh_cn: 是否有与Perl 的chomp() 等效的方法，用于从字符串中删除尾随换行符？

source: You can use ``S.rstrip("\r\n")`` to remove all occurrences of any line terminator from the end of the string ``S`` without removing other trailing whitespace. If the string ``S`` represents more than one line, with several empty lines at the end, the line terminators for all the blank lines will be removed::
es: Puedes utilizar ``S.rstrip("\r\n")` para eliminar todas las ocurrencias de cualquier finalizador de linea del string ``S`` sin eliminar otros generadores de espacios en blanco. Si el string ``S`` se representa en más de una línea, con varias líneas vacías al final, los finalizadores de línea de todas esas líneas en blanco serán eliminados::
zh_cn: 可以使用 ``S.rstrip("\r\n")`` 从字符串 ``S`` 的末尾删除所有的换行符，而不删除其他尾随空格。如果字符串 ``S`` 表示多行，且末尾有几个空行，则将删除所有空行的换行符：

source: Since this is typically only desired when reading text one line at a time, using ``S.rstrip()`` this way works well.
es: Ya que es normal que sólo se desee cuando leemos, una línea de texto cada vez, utilizar ``S.rstrip()`` funciona perfectamente.
zh_cn: 由于通常只在一次读取一行文本时才需要这样做，所以使用 ``S.rstrip()`` 这种方式工作得很好。

source: Is there a scanf() or sscanf() equivalent?
es: ¿Existe algún equivalente a scanf() o sscanf()?
zh_cn: 是否有 scanf() 或 sscanf() 的对应物？

source: Not as such.
es: Nope.
zh_cn: 没有这样的对应物。

source: For simple input parsing, the easiest approach is usually to split the line into whitespace-delimited words using the :meth:`~str.split` method of string objects and then convert decimal strings to numeric values using :func:`int` or :func:`float`. ``split()`` supports an optional "sep" parameter which is useful if the line uses something other than whitespace as a separator.
es: Para el análisis sintáctico de entradas, el acercamiento más simple es normalmente dividir la linea en palabras delimitadas por espacios en blanco utilizando el método :meth:`~str.split` de los objetos string y después convertir los strings decimales en valores numéricos utilizando :func:`int` o :func:`float`. ``split()`` soporta un parámetro "sep" opcional el cual es útil si la línea utiliza algo más que un espacio en blanco como separador.
zh_cn: 对于简单的输入解析，最方便的做法通常是使用字符串对象的 :meth:`~str.split` 方法将一行内容拆解为以空格分隔的单词，然后使用 :func:`int` 或 :func:`float` 将表示十进制数的字符串转换为数值。 ``split()`` 支持可选的 "sep" 形参，适用于内容行使用空格符以外的分隔符的情况。

source: For more complicated input parsing, regular expressions are more powerful than C's :c:func:`sscanf` and better suited for the task.
es: Para un análisis sintáctico de entradas más complejo, las expresiones regulares son mucho más potentes que las funciones de C :c:func:`sscanf` y más apropiadas para la tarea.
zh_cn: 以于更复杂的输入解析，正则表达式会比 C 的 :c:func:`sscanf` 更强大，也更适合此类任务。

source: What does 'UnicodeDecodeError' or 'UnicodeEncodeError' error mean?
es: ¿Qué significa 'UnicodeDecodeError' o 'UnicodeEncodeError'?
zh_cn: 'UnicodeDecodeError' 或 'UnicodeEncodeError' 错误是什么意思？

source: See the :ref:`unicode-howto`.
es: Ver :ref:`unicode-howto`.
zh_cn: 见 :ref:`unicode-howto`

source: Performance
es: Rendimiento
zh_cn: 性能

source: My program is too slow. How do I speed it up?
es: Mi programa es muy lento. ¿Como puedo acelerarlo?
zh_cn: 我的程序太慢了。该如何加快速度？

source: That's a tough one, in general. First, here are a list of things to remember before diving further:
es: Esta es dura, en general. Primero, aquí tienes una lista de cosas a recordar antes de meterse en ello más a fondo:
zh_cn: 总的来说，这是个棘手的问题。首先，下面列出了深入了解前需要记住的事情：

source: Performance characteristics vary across Python implementations. This FAQ focuses on :term:`CPython`.
zh_cn: 不同的 Python 实现具有不同的性能特点。 本 FAQ 着重解答的是 :term:`CPython`。

source: Behaviour can vary across operating systems, especially when talking about I/O or multi-threading.
es: El comportamiento puede variar entre sistemas operativos, especialmente cuando hablamos de I/O o multi-threading.
zh_cn: 行为可能因操作系统而异，尤其是在谈论 I / O 或多线程时。

source: You should always find the hot spots in your program *before* attempting to optimize any code (see the :mod:`profile` module).
es: Deberías encontrar siempre los puntos "calientes" de tu programa *antes* de intentar optimizar ningún código (ver el módulo :mod:`profile`).
zh_cn: 在尝试优化任何代码 *前* ，应始终找到程序中的热点（请参阅 :mod:`profile` 模块）。

source: Writing benchmark scripts will allow you to iterate quickly when searching for improvements (see the :mod:`timeit` module).
es: Escribir scripts de testeo te permitirán iterar rápidamente cuando estemos tratando de realizar mejoras (ver el módulo :mod:`timeit`).
zh_cn: 编写基准脚本将允许您在搜索改进时快速迭代（请参阅 :mod:`timeit` 模块）。

source: It is highly recommended to have good code coverage (through unit testing or any other technique) before potentially introducing regressions hidden in sophisticated optimizations.
es: Se recomienda encarecidamente tener bien cubierto el código (a través del testeo unitario o cualquier otra técnica) antes de introducir potencialmente regresiones escondidas en optimizaciones sofisticadas.
zh_cn: 强烈建议在可能引入隐藏在复杂优化中的回归之前，要有良好的代码覆盖率（通过单元测试或任何其他技术）。

source: That being said, there are many tricks to speed up Python code. Here are some general principles which go a long way towards reaching acceptable performance levels:
es: Dicho esto, existen unos cuantos trucos para acelerar la codificación en Python. Aquí dispones de algunos principios generales de un largo camino hacia el alcance de niveles óptimos de rendimiento:
zh_cn: 话虽如此，加速Python代码有很多技巧。以下是一些可以达到可接受的性能水平的一般原则：

source: Making your algorithms faster (or changing to faster ones) can yield much larger benefits than trying to sprinkle micro-optimization tricks all over your code.
es: Hacer tus algoritmos más veloces (o cambiarlos hacia otros más veloces) puede conllevar mayores beneficios que intentar repartir trucos de micro-optimización a lo largo de tu código.
zh_cn: 使您的算法更快（或更改为更快的算法）可以产生比尝试在代码中使用微优化技巧更大的好处。

source: Use the right data structures. Study documentation for the :ref:`bltin-types` and the :mod:`collections` module.
es: Utiliza estructuras de datos s correctas. Estudia la documentación para los :ref:`bltin-types` y el módulo de :mod:`collections`.
zh_cn: 使用正确的数据结构。参考文档 :ref:`bltin-types` 和 :mod:`collections` 模块。

source: When the standard library provides a primitive for doing something, it is likely (although not guaranteed) to be faster than any alternative you may come up with. This is doubly true for primitives written in C, such as builtins and some extension types. For example, be sure to use either the :meth:`list.sort` built-in method or the related :func:`sorted` function to do sorting (and see the :ref:`sortinghowto` for examples of moderately advanced usage).
es: Cuando la librería estándar proporciona un primitivo para hacer algo, es para proporcionar casi siempre una alternativa más rápida para ti. Esto es un true doble para los primitivos C, tales como integrados y algunos tipos de extensión. Por ejemplo, asegúrate de utilizar el método integrado :meth:`list.sort` o la función relacionada para ordenar, :func:`sorted` (y ver :ref:`sortinghowto` para ejemplos de utilización avanzada).
zh_cn: 当标准库提供用于执行某些操作的原语时，可能（尽管不能保证）比您可能提出的任何替代方案更快。对于用C编写的原语，例如内置函数和一些扩展类型，这是真的。例如，请确保使用 :meth:`list.sort` 内置方法或相关的 :func:`sorted` 函数进行排序（有关适度高级用法的示例，请参阅 :ref:`sortinghowto` ）。

source: Abstractions tend to create indirections and force the interpreter to work more. If the levels of indirection outweigh the amount of useful work done, your program will be slower. You should avoid excessive abstraction, especially under the form of tiny functions or methods (which are also often detrimental to readability).
es: Las abstracciones tienden a crear indirecciones y fuerzan al intérprete a trabajar más. Si los niveles de indirección sobrepasan la cantidad de trabajo útil realizado, tu programa será más lento. Debes evitar la abstracción excesiva, especialmente en las formas de pequeñas funciones o métodos (los que normalmente detrimentan la legibilidad del código).
zh_cn: 抽象倾向于创造间接性并迫使翻译更多地工作。如果间接级别超过完成的有用工作量，则程序将变慢。你应该避免过度抽象，特别是在微小的功能或方法的形式下（这通常也会对可读性产生不利影响）。

source: If you have reached the limit of what pure Python can allow, there are tools to take you further away. For example, `Cython <http://cython.org>`_ can compile a slightly modified version of Python code into a C extension, and can be used on many different platforms. Cython can take advantage of compilation (and optional type annotations) to make your code significantly faster than when interpreted. If you are confident in your C programming skills, you can also :ref:`write a C extension module <extending-index>` yourself.
es: Si has llegado al límite de lo que Python puro te permite, existen herramientas para llevarte más allá. Por ejemplo, `Cython <http://cython.org>`_ puede compilar una versión ligeramente modificada de código Python como una extensión C, y puede ser utilizada en diferentes plataformas. Cython puede aventajarse de la compilación (y anotaciones de tipo opcional) para hacer tu código cuantitativamente más rápido que cuando se interpreta. Si dispones de buenas dotes de programación en C, puedes :ref:`escribir un módulo <extending-index> en C tú mismo`.
zh_cn: 如果你已经达到纯 Python 允许的限制，那么有一些工具可以让你走得更远。 例如， `Cython <http://cython.org>`_ 可以将稍微修改的 Python 代码版本编译为 C 扩展，并且可以在许多不同的平台上使用。 Cython 可以利用编译（和可选的类型注释）来使代码明显快于解释运行时的速度。 如果您对 C 编程技能有信心，也可以自己 :ref:`编写 C 扩展模块 <extending-index>` 。

source: The wiki page devoted to `performance tips <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.
es: La página wiki dedicada a `consejos de rendimiento <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.
zh_cn: 专门介绍 `性能提示 <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_ 的wiki页面。

source: What is the most efficient way to concatenate many strings together?
es: ¿Cuál es la forma más eficiente de concatenar strings?
zh_cn: 将多个字符串连接在一起的最有效方法是什么？

source: :class:`str` and :class:`bytes` objects are immutable, therefore concatenating many strings together is inefficient as each concatenation creates a new object. In the general case, the total runtime cost is quadratic in the total string length.
es: Los objetos :class:`str` y :class:`bytes` son inmutables, por tanto concatenar varios strings es ineficiente ya que cada concatenación crea un nuevo objeto. Por lo común, el coste de tiempo de ejecución es cuadrático en la longitud total del string.
zh_cn: :class:`str` 和 :class:`bytes` 对象是不可变的，因此将多个字符串连接在一起效率很低，因为每个连接都会创建一个新对象。在一般情况下，总运行时间是总字符串长度的二次方。

source: To accumulate many :class:`str` objects, the recommended idiom is to place them into a list and call :meth:`str.join` at the end::
es: Para acumular varios objetos :class:`str`, el idioma recomendado es colocarlos en una lista y llamar al método :meth:`str.join` al final::
zh_cn: 要连接多个 :class:`str` 对象，通常推荐的用法是将它们放入一个列表中并在结尾处调用 :meth:`str.join` ：

source: (another reasonably efficient idiom is to use :class:`io.StringIO`)
es: (otra forma eficiente es utilizar :class:`io.StringIO`)
zh_cn: （另一个合理有效的惯用方法是 :class:`io.StringIO` ）

source: To accumulate many :class:`bytes` objects, the recommended idiom is to extend a :class:`bytearray` object using in-place concatenation (the ``+=`` operator)::
es: Para acumular varios objetos :class:`bytes`, la forma recomendada es extender un objeto :class:`bytearray` utilizando concatenación in-place (con el operador ``+=``)::
zh_cn: 要连接多个 :class:`str` 对象，建议使用本地连接（ ``+=`` 运算符）扩展 :class:`bytearray` 对象：

source: Sequences (Tuples/Lists)
es: Secuencias (Tuplas/Listas)
zh_cn: 序列（元组/列表）

source: How do I convert between tuples and lists?
es: ¿Cómo convierto entre múltiples listas y tuplas?
zh_cn: 如何在元组和列表之间进行转换？

source: The type constructor ``tuple(seq)`` converts any sequence (actually, any iterable) into a tuple with the same items in the same order.
es: El constructor tipo ``tuple(seq)`` convierte cualquier secuencia (actualmente, cualquiera iterable) en una tupla con los mismos items en el mismo orden.
zh_cn: 类型构造器 ``tuple(seq)`` 可将任意序列（实际上是任意可迭代对象）转换为具有相同排列顺序的相同条目的元组。

source: For example, ``tuple([1, 2, 3])`` yields ``(1, 2, 3)`` and ``tuple('abc')`` yields ``('a', 'b', 'c')``. If the argument is a tuple, it does not make a copy but returns the same object, so it is cheap to call :func:`tuple` when you aren't sure that an object is already a tuple.
es: Por ejemplo ``tuple([1, 2, 3])`` devuelve ``(1, 2, 3)`` y ``('abc')`` devuelve ``('a', 'b', 'c')``. Si el argumento es una tupla, no crea una copia, pero sí devuelve el mismo objeto, así que en tiempo de ejecución no es caro llamar a la función :func:`tuple` cuando no estás seguro de que ese objeto sea una tupla.
zh_cn: 例如，``tuple([1, 2, 3])`` 产生 ``(1, 2, 3)`` 而 ``tuple('abc')`` 产生 ``('a', 'b', 'c')``。 如果参数为一个元组，它不会创建副本而是返回同一对象，因此如果你不确定某个对象是否为元组时也可简单地调用 :func:`tuple`。
