Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es, zh_cn

source: Only move imports into a local scope, such as inside a function definition, if it's necessary to solve a problem such as avoiding a circular import or are trying to reduce the initialization time of a module. This technique is especially helpful if many of the imports are unnecessary depending on how the program executes. You may also want to move imports into a function if the modules are only ever used in that function. Note that loading a module the first time may be expensive because of the one time initialization of the module, but loading a module multiple times is virtually free, costing only a couple of dictionary lookups. Even if the module name has gone out of scope, the module is probably available in :data:`sys.modules`.
es: Mueve solo los imports a un ámbito local, como por ejemplo dentro de una definición de función, si es preciso solucionar un problema como evitar un import circular o estás intentando reducir el tiempo de inicialización de un módulo. Esta técnica es especialmente de ayuda si varios de los imports son innecesarios dependiendo de como se ejecute el programa. También puedes querer mover los imports dentro de una función si los módulos son únicamente usados en esa función. Fíjate que cargar un módulo por primera vez puede salir caro debido al tiempo de iniciación del módulo, pero cargar un módulo múltiples veces, es virtualmente gratis, ya que sólo cuesta unas cuantas búsquedas de diccionario. Incluso si el nombre del módulo se ha ido fuera del ámbito, el módulo está disponible probablemente en :data:`sys.modules`.
zh_cn: 只有当需要解决诸如避免循环导入或试图减少模块初始化时间的问题时，才可以将导入移动到本地范围，例如在函数定义中。如果根据程序的执行方式，许多导入是不必要的，这种技术尤其有用。如果仅在某个函数中使用模块，您还可能希望将导入移到该函数中。请注意，第一次加载模块可能会因为模块的一次初始化而代价高昂，但多次加载模块实际上是免费的，只需进行几次字典查找。即使模块名称超出了作用域，模块也可能在 :data:`sys.modules` 中可用。

source: Why are default values shared between objects?
es: ¿Por qué se comparten los valores por defecto entre objetos?
zh_cn: 为什么对象之间会共享默认值？

source: This type of bug commonly bites neophyte programmers. Consider this function::
es: Este tipo de bug, les sucede normalmente a los programadores neófitos. Considera esta función::
zh_cn: 这种类型的缺陷通常会惹恼新手程序员。考虑这个函数 ::

source: The first time you call this function, ``mydict`` contains a single item. The second time, ``mydict`` contains two items because when ``foo()`` begins executing, ``mydict`` starts out with an item already in it.
es: La primera vez que llamas a esta función, ``mydict`` contiene un único elemento. La segunda vez ``mydict`` contiene dos elementos porque cuando ``foo()`` comienza a ejecutarse, ``mydict`` comienza con un elemento ya en su interior.
zh_cn: 第一次调用此函数时，``mydict`` 包含一项。第二次，``mydict`` 包含两项，因为当 ``foo()`` 开始执行时， ``mydict`` 中已经有一项了。

source: It is often expected that a function call creates new objects for default values. This is not what happens. Default values are created exactly once, when the function is defined. If that object is changed, like the dictionary in this example, subsequent calls to the function will refer to this changed object.
es: Se espera que una función de llamada cree nuevos objetos para los valores por defecto. Esto no es lo que sucede. Los valores por defecto son creados exactamente una vez, cuando la función se define. Si el objeto es modificado, como el diccionario en este ejemplo, las siguientes llamadas a la función se referirán a este objeto modificado.
zh_cn: 函数调用经常被期望为默认值创建新的对象。 但实际情况并非如此。 默认值会在函数定义时一次性地创建。 如果对象发生改变，就如本示例中的字典那样，则对函数的后续调用将会引用这个被改变的对象。

source: By definition, immutable objects such as numbers, strings, tuples, and ``None``, are safe from change. Changes to mutable objects such as dictionaries, lists, and class instances can lead to confusion.
es: Por definición, los objetos inmutables como los números, strings, tuplas, y ``None``, están a salvo de ser modificados. Las modificaciones a los objetos mutables como diccionarios, listas e instancias de clases pueden llevar a confusión.
zh_cn: 按照定义，不可变对象例如数字、字符串、元组和 ``None`` 因为不可变所以是安全的。 对可变对象例如字典、列表和类实例的改变则可能造成迷惑。

source: Because of this feature, it is good programming practice to not use mutable objects as default values. Instead, use ``None`` as the default value and inside the function, check if the parameter is ``None`` and create a new list/dictionary/whatever if it is. For example, don't write::
es: Debido a esta característica, es una buena práctica de programación no utilizar objetos mutables como valores por defecto. En su lugar, utiliza ``None`` como valor por defecto dentro de una función, comprueba si el parámetro es ``None`` y crea una nueva lista/diccionario/lo que sea si debe ser. Por ejemplo, no escribas::
zh_cn: 由于这一特性，在编程中应遵循的一项好习惯是不使用可变对象作为默认值。 而应使用 ``None`` 作为默认值和函数中的值，检查值为 ``None`` 的形参并创建相应的列表、字典或其他可变对象。 例如，不要这样写::

source: but::
zh_cn: 而要这样写::

source: This feature can be useful. When you have a function that's time-consuming to compute, a common technique is to cache the parameters and the resulting value of each call to the function, and return the cached value if the same value is requested again. This is called "memoizing", and can be implemented like this::
es: Esta característica puede ser útil. Cuando tienes una función que consume mucho tiempo de ejecución, una técnica habitual es dejar en cache los parámetros y el valor resultante de cada llamada a la función, y devuelve el valor en cache si el mismo valor es peticionado de nuevo. A esto se le llama "memoizing", y puede ser implementado del siguiente modo::
zh_cn: 这一特性有时会很有用处。 当你有一个需要进行大量耗时计算的函数时，一个常见技巧是将每次调用函数的参数和结果值缓存起来，并在同样的值被再次请求时返回缓存的值。 这称为“记忆”，具体实现方式可以是这样的::

source: You could use a global variable containing a dictionary instead of the default value; it's a matter of taste.
es: Puedes utilizar una variable global que contenga un diccionario en lugar del valor por defecto; cuestión de gustos.
zh_cn: 你也可以使用包含一个字典的全局变量而不使用参数默认值；这完全取决于个人偏好。

source: How can I pass optional or keyword parameters from one function to another?
es: ¿Como puedo pasar parámetros opcionales o de palabras clave de una función a otra?
zh_cn: 如何将可选参数或关键字参数从一个函数传递到另一个函数？

source: Collect the arguments using the ``*`` and ``**`` specifiers in the function's parameter list; this gives you the positional arguments as a tuple and the keyword arguments as a dictionary. You can then pass these arguments when calling another function by using ``*`` and ``**``::
es: Recoge los argumentos utilizando los especificadores ``*`` y ``**`` en la lista de parámetros de la función; esto te da los argumentos posicionados, como una tupla y los argumentos de palabras clave como un diccionario. Después podrás pasar estos argumentos cuando llames a otra función utilizando ``*`` y ``**``::
zh_cn: 使用函数参数列表中的 ``*`` 和 ``**`` 说明符收集参数;这会将位置参数作为元组，将关键字参数作为字典。然后，您可以使用 ``*`` 和 ``**`` 调用另一个函数时传递这些参数：

source: What is the difference between arguments and parameters?
es: ¿Cual es la diferencia entre argumentos y parámetros?
zh_cn: 形参和实参之间有什么区别？

source: :term:`Parameters <parameter>` are defined by the names that appear in a function definition, whereas :term:`arguments <argument>` are the values actually passed to a function when calling it. Parameters define what types of arguments a function can accept. For example, given the function definition::
es: Los :term:`Parámetros <parameter>` son definidos por los nombres que aparecen en la definición de una función, donde los :term:`argumentos <argument>` son valores que actualmente se le pasan a una función cuando los llamamos. Los parámetros definen qué tipo de argumentos puede aceptar una función. Por ejemplo, dada la función de una definición::
zh_cn: :term:`形参 <parameter>` 是指出现在函数定义中的名称，而 :term:`实参 <argument>` 则是在调用函数时实际传入的值。 形参定义了一个函数能接受何种类型的实参。 例如，对于以下函数定义::

source: *foo*, *bar* and *kwargs* are parameters of ``func``. However, when calling ``func``, for example::
es: *foo*, *bar* y *kwargs* son parámetros de ``func``. Cuando llamamos a ``func``, por ejemplo::
zh_cn: *foo*, *bar* 和 *kwargs* 是 ``func`` 的形参。 但是，在调用 ``func`` 时，例如：

source: the values ``42``, ``314``, and ``somevar`` are arguments.
es: los valores ``42``, ``314``, y ``somevar`` son argumentos.
zh_cn: 实际的值 ``42``, ``314`` 和 ``somevar`` 则是实参。

source: Why did changing list 'y' also change list 'x'?
es: ¿Por qué cambiando la lista 'y' también se cambia la lista 'x'?
zh_cn: 为什么更改列表 'y' 也会更改列表 'x'？

source: If you wrote code like::
es: Si has escrito el código así::
zh_cn: 如果你编写的代码就像下面一样：

source: you might be wondering why appending an element to ``y`` changed ``x`` too.
es: puedes estar pensando por qué añadiendo un elemento a ``y``, también ha cambiado ``x``.
zh_cn: 你可能想知道为什么追加一个元素也改变了x。

source: There are two factors that produce this result:
es: Existen dos factores que producen este resultado:
zh_cn: 产生这种结果有两个因素：

source: Variables are simply names that refer to objects. Doing ``y = x`` doesn't create a copy of the list -- it creates a new variable ``y`` that refers to the same object ``x`` refers to. This means that there is only one object (the list), and both ``x`` and ``y`` refer to it.
es: Las variables son nombres simples que refieren a objetos. Haciendo ``y=x`` no creas una copia de la lista -- creas una nueva variable ``y`` que refiere al mismo objeto que ``x`` refiere. Esto significa que aquí sólo tienes un objeto (la lista), y ambos ``x`` e ``y`` se refieren al mismo.
zh_cn: 变量只是指向具体对象的名称。 执行 ``y = x`` 并不会为列表创建一个副本 —— 它只是创建了一个新变量 ``y`` 指向 ``x`` 所指向的同一对象。 这意味着只存在一个对象（列表），``x`` 和 ``y`` 都是对它的引用。

source: Lists are :term:`mutable`, which means that you can change their content.
es: Las listas son :term:`mutable` lo que significa que puedes cambiar su contenido.
zh_cn: 列表属于 :term:`mutable` 对象，这意味着你可以改变它的内容。

source: After the call to :meth:`~list.append`, the content of the mutable object has changed from ``[]`` to ``[10]``. Since both the variables refer to the same object, using either name accesses the modified value ``[10]``.
es: Despues de llamar a :meth:`~list.append`, el contenido el objeto mutable ha cambiado de ``[]`` a ``[10]``. Ambas variables refieren al mismo objeto, utilizando cualquiera de los dos nombres accesamos al valor modificado ``[10]``.
zh_cn: 在调用 :meth:`~list.append` 之后，这个可变对象的内容由 ``[]`` 变为 ``[10]``。 由于两个变量都指向同一对象，因此使用任何一个名称所访问到的都是修改后的值 ``[10]``。

source: If we instead assign an immutable object to ``x``::
es: Si en su lugar asignamos un objeto inmutable a ``x``::
zh_cn: 如果我们改为将不可变对象赋值给 ``x``::

source: we can see that in this case ``x`` and ``y`` are not equal anymore. This is because integers are :term:`immutable`, and when we do ``x = x + 1`` we are not mutating the int ``5`` by incrementing its value; instead, we are creating a new object (the int ``6``) and assigning it to ``x`` (that is, changing which object ``x`` refers to). After this assignment we have two objects (the ints ``6`` and ``5``) and two variables that refer to them (``x`` now refers to ``6`` but ``y`` still refers to ``5``).
es: podemos ver que en este caso ``x`` e ``y`` ya no son iguales. Esto sucede porque los enteros son :term:`immutable`, y cuando hacemos ``x = x + 1`` no estamos mutando el entero ``5`` incrementando su valor; en su lugar, estamos creando un nuevo objeto (el entero ``6``) y asignándolo a ``x`` (es decir, cambiando al objeto que ``x`` refiere). Despues de esta función tenemos dos objetos (los enteros ``6`` y ``5`` ) y dos variables a las que se refieren (``x`` ahora refiere a ``6`` pero ``y`` todavia refiere a ``5``).
zh_cn: 我们可以看到在此情况下 ``x`` 和 ``y`` 就不再相等了。 这是因为整数是 :term:`immutable` 对象，当我们执行 ``x = x + 1`` 时我们并不是改变了 ``5`` 这个对象的值；而是创建了一个新的对象 (整数 ``6``) 并将其赋值给 ``x`` (也就是改变了 ``x`` 所指向的对象)。 在赋值之后我们就有了两个对象 (整数 ``6`` 和 ``5``) 以及分别指向它们的两个变量 (``x`` 现在指向 ``6`` 而 ``y`` 仍然指向 ``5``)。

source: Some operations (for example ``y.append(10)`` and ``y.sort()``) mutate the object, whereas superficially similar operations (for example ``y = y + [10]`` and ``sorted(y)``) create a new object. In general in Python (and in all cases in the standard library) a method that mutates an object will return ``None`` to help avoid getting the two types of operations confused. So if you mistakenly write ``y.sort()`` thinking it will give you a sorted copy of ``y``, you'll instead end up with ``None``, which will likely cause your program to generate an easily diagnosed error.
zh_cn: 某些操作 (例如 ``y.append(10)`` 和 ``y.sort()``) 是改变原对象，而看上去相似的另一些操作 (例如 ``y = y + [10]`` 和 ``sorted(y)``) 则是创建新对象。 通常在 Python 中 (以及在标准库的所有代码中) 会改变原对象的方法将返回 ``None`` 以帮助避免混淆这两种不同类型的操作。 因此如果你错误地使用了 ``y.sort()`` 并期望它将返回一个经过排序的 ``y`` 的副本，你得到的结果将会是 ``None``，这将导致你的程序产生一个容易诊断的错误。

source: However, there is one class of operations where the same operation sometimes has different behaviors with different types: the augmented assignment operators. For example, ``+=`` mutates lists but not tuples or ints (``a_list += [1, 2, 3]`` is equivalent to ``a_list.extend([1, 2, 3])`` and mutates ``a_list``, whereas ``some_tuple += (1, 2, 3)`` and ``some_int += 1`` create new objects).
zh_cn: 但是，还存在一类操作，不同的类型执行相同的操作会有不同的行为：那就是增强赋值运算符。 例如，``+=`` 会原地改变列表，但不会改变元组或整数 (``a_list += [1, 2, 3]`` 与 ``a_list.extend([1, 2, 3])`` 一样都会改变 ``a_list``，而 ``some_tuple += (1, 2, 3)`` 和 ``some_int += 1`` 则会创建新的对象)。

source: In other words:
es: En otras palabras:
zh_cn: 换而言之：

source: If we have a mutable object (:class:`list`, :class:`dict`, :class:`set`, etc.), we can use some specific operations to mutate it and all the variables that refer to it will see the change.
zh_cn: 如果我们有一个可变对象 (:class:`list`, :class:`dict`, :class:`set` 等等)，我们可以使用某些特定的操作来改变它，所有指向它的变量都会显示它的改变。

source: If we have an immutable object (:class:`str`, :class:`int`, :class:`tuple`, etc.), all the variables that refer to it will always see the same value, but operations that transform that value into a new value always return a new object.
zh_cn: 如果我们有一个不可变对象 (:class:`str`, :class:`int`, :class:`tuple` 等等)，所有指向它的变量都将显示相同样的值，但凡是会改变这个值的操作将总是返回一个新对象。

source: If you want to know if two variables refer to the same object or not, you can use the :keyword:`is` operator, or the built-in function :func:`id`.
es: Si quieres saber si dos variables referencian al mismo objeto o no, puedes usar el operador :keyword:`is`, o la función incorporada :func:`id`.
zh_cn: 如果你想知道两个变量是否指向相同的对象，你可以使用 :keyword:`is` 运算符，或内置函数 :func:`id`。

source: How do I write a function with output parameters (call by reference)?
es: ¿Como escribo una función con parámetros de salida (llamada por referencia)?
zh_cn: 如何编写带输出参数的函数（通过引用调用）？

source: Remember that arguments are passed by assignment in Python. Since assignment just creates references to objects, there's no alias between an argument name in the caller and callee, and so no call-by-reference per se. You can achieve the desired effect in a number of ways.
es: Recuerda que los argumentos se pasan por asignación en Python. Ya que la función sólo crea referencias a objetos, no hay un alias entre un nombre de argumento en el caller y el callee, por lo que no hay llamada-por-referencia per se. Puedes lograr el efecto deseado de diversas formas.
zh_cn: 请记住在 Python 中参数是通过赋值来传递的。 由于赋值只是创建了对象的引用，因此在调用者和被调用者的参数名称之间没有别名，所以本身是没有按引用调用的。 你可以通过多种方式实现所需的效果。

source: By returning a tuple of the results::
es: Retornando una tupla de los resultados::
zh_cn: 通过返回一个结果元组::

source: This is almost always the clearest solution.
es: Esta es normalmente la solución más clara.
zh_cn: 这几乎总是最清晰明了的解决方案。

source: By using global variables. This isn't thread-safe, and is not recommended.
es: Utilizando variables globales. Este no es un hilo seguro, y no se recomienda.
zh_cn: 通过使用全局变量。 这种方式不是线程安全的，而且也不受推荐。

source: By passing a mutable (changeable in-place) object::
es: Pasando un objeto mutable (modificable in-place)::
zh_cn: 通过传递一个可变 (即可原地修改的) 对象::

source: By passing in a dictionary that gets mutated::
es: Pasando un diccionario que se mute::
zh_cn: 通过传递一个会被改变的字典::

source: Or bundle up values in a class instance::
es: O juntar valores en una instancia de clase::
zh_cn: 或者在一个类实例中捆绑值::

source: There's almost never a good reason to get this complicated.
es: Casi nunca hay una buena razón para hacer esto complicado.
zh_cn: 几乎没有任何适当理由将问题如此复杂化。

source: Your best choice is to return a tuple containing the multiple results.
es: Tu mejor elección es retornar una tupla que contenga resultados múltiples.
zh_cn: 你的最佳选择是返回一个包含多个结果的元组。

source: How do you make a higher order function in Python?
es: ¿Como creas una función de orden superior en Python?
zh_cn: 如何在Python中创建高阶函数？

source: You have two choices: you can use nested scopes or you can use callable objects. For example, suppose you wanted to define ``linear(a,b)`` which returns a function ``f(x)`` that computes the value ``a*x+b``. Using nested scopes::
es: Tienes dos elecciones: puedes utilizar ámbitos anidados, o puedes utilizar objetos a los que llamar. Por ejemplo, supón que buscas definir ``linear(a,b)`` que devuelve una función ``f(x)`` que computa el valor ``a*x+b``. Utilizando ámbitos anidados::
zh_cn: 你有两种选择：使用嵌套作用域，或者使用可调用对象。 例如，假设你想要定义 ``linear(a,b)`` 使其返回一个函数 ``f(x)`` 来设计 ``a*x+b`` 的值。 可以使用以下嵌套作用域::

source: Or using a callable object::
es: O utilizando un objeto al que llamar::
zh_cn: 或使用一个可调用对象::

source: In both cases, ::
es: En ambos casos, ::
zh_cn: 在两种情况下，::

source: gives a callable object where ``taxes(10e6) == 0.3 * 10e6 + 2``.
es: tenemos objeto al que llamar donde ``taxes(10e6) == 0.3 * 10e6 + 2``.
zh_cn: 都会给出一个可调用对象，使得 ``taxes(10e6) == 0.3 * 10e6 + 2``.

source: The callable object approach has the disadvantage that it is a bit slower and results in slightly longer code. However, note that a collection of callables can share their signature via inheritance::
es: La visión del objeto al que llamar tiene la desventaja que es un poco más lenta y resulta en un código más largo. De todos modos, fíjate que una colección de objetos a los que llamar pueden compartir su marca (signature) mediante herencia::
zh_cn: 可调用对象方式的缺点是速度略慢且生成的代码略长。 但是，请注意一组可调用对象能够通过继承来共享签名::

source: Object can encapsulate state for several methods::
es: Los objetos pueden encapsular el estado por diferentes vías::
zh_cn: 对象可以封装多个方法的状态::

source: Here ``inc()``, ``dec()`` and ``reset()`` act like functions which share the same counting variable.
es: Aquí ``inc()``, ``dec()`` y``reset()`` actúan como funciones las cuales comparten la misma variable.
zh_cn: 这里 ``inc()``, ``dec()`` 和 ``reset()`` 将表现为共享同一计数变量的多个函数。

source: How do I copy an object in Python?
es: ¿Cómo copio un objeto en Python?
zh_cn: 如何在Python中复制对象？

source: In general, try :func:`copy.copy` or :func:`copy.deepcopy` for the general case. Not all objects can be copied, but most can.
es: En general, puedes intentar :func:`copy.copy` or :func:`copy.deepcopy`. No todos los objetos pueden ser copiados, pero sí la gran mayoría.
zh_cn: 一般来说，通常情况下请尝试 :func:`copy.copy` 或 :func:`copy.deepcopy`。 不是所有对象都可以复制，但多数都是可以的。

source: Some objects can be copied more easily. Dictionaries have a :meth:`~dict.copy` method::
es: Algunos objetos pueden ser copiados más facilmente. Los diccionarios tienen un método :meth:`~dict.copy`::
zh_cn: 某些对象可以方便地复制。 例如字典具有 :meth:`~dict.copy` 方法::

source: Sequences can be copied by slicing::
zh_cn: 序列可以通过切片来复制::

source: How can I find the methods or attributes of an object?
es: ¿Cómo puedo encontrar los métodos o atributos de un objeto?
zh_cn: 如何找到对象的方法或属性？

source: For an instance x of a user-defined class, ``dir(x)`` returns an alphabetized list of the names containing the instance attributes and methods and attributes defined by its class.
zh_cn: 对于一个用户自定义类的实例 x，``dir(x)`` 将返回一个按字母顺序排序的包含实例属性和方法及其类所定义的属性名称的列表。

source: How can my code discover the name of an object?
es: ¿Como puede mi código descubrir el nombre de un objeto?
zh_cn: 我的代码如何才能发现对象的名称？

source: Generally speaking, it can't, because objects don't really have names. Essentially, assignment always binds a name to a value; the same is true of ``def`` and ``class`` statements, but in that case the value is a callable. Consider the following code::
zh_cn: 通常来说是做不到的，因为对象并不真正具有名称。 在本质上，赋值总是会将一个名称绑定到某个值；``def`` 和 ``class`` 语句也是如此，但在这种情况下该值是一个可调用对象。 考虑以下代码::

source: Arguably the class has a name: even though it is bound to two names and invoked through the name B the created instance is still reported as an instance of class A. However, it is impossible to say whether the instance's name is a or b, since both names are bound to the same value.
zh_cn: 不严谨地讲，该类有一个名称：虽然它是绑定了两个名称并通过名称 B 发起调用，所创建的实例仍然被视为类 A 的一个实例。 但是实例的名称则无法确定地说是 a 或是 b，因为有两个名称被绑定到了同一个值。

source: Generally speaking it should not be necessary for your code to "know the names" of particular values. Unless you are deliberately writing introspective programs, this is usually an indication that a change of approach might be beneficial.
es: Hablando generalmente no debería ser necesario para tu código "conocer los nombres" de valores en particular. A menos que deliberadamente estés escribiendo programas introspectivos, normalmente es un indicador de que un cambio de visión sobre el código puede ser beneficioso.
zh_cn: 一般来说你的代码应该没有必要“知道”特定值的名称。 除非你是在编写特殊的内省程序，出现这样的问题通常表明如果改变方式可能会更有利。

source: In comp.lang.python, Fredrik Lundh once gave an excellent analogy in answer to this question:
es: En comp.lang.python, Fredrik Lundh proporciona una excelente analogía en respuesta a esta cuestión:
zh_cn: 在 comp.lang.python 中，Fredrik Lundh 在回答这样的问题时曾经给出过一个绝佳的类比：

source: The same way as you get the name of that cat you found on your porch: the cat (object) itself cannot tell you its name, and it doesn't really care -- so the only way to find out what it's called is to ask all your neighbours (namespaces) if it's their cat (object)...
es: De la misma forma que quieres conocer el nombre de ese gato que te has encontrado en el porche: el gato (objeto) en sí, no te puede decir su nombre y a él no le preocupa lo mas mínimo -- así que la única forma de averiguar como se llama es preguntarle a tus vecinos (namespaces) si es su gato (objeto).
zh_cn: 跟你找出在你家门廊见到的某只猫的名字所用的办法一样：猫（对象）自己无法告诉你它的名字，它根本就不在乎 —— 所以找出它叫什么名字的唯一办法是问你的所有邻居（命名空间）那是不是他们的猫（对象）……

source: ....and don't be surprised if you'll find that it's known by many names, or no name at all!
es: ...¡y no te sorprendas si lo que encuentras se conoce por muchos nombres, o por ninguno en absoluto!
zh_cn: ……并且如果你发现它有很多名字或根本没有名字也不必觉得惊讶！

source: What's up with the comma operator's precedence?
es: ¿Que pasa con la precedencia del operador 'coma'?
zh_cn: 逗号运算符的优先级是什么？

source: Comma is not an operator in Python. Consider this session::
es: La coma no es un operador en Python. Considera esta sesión::
zh_cn: 逗号在 Python 中不是运算符。 考虑这个例子::

source: Since the comma is not an operator, but a separator between expressions the above is evaluated as if you had entered::
es: La coma no es un operador, pero si un separador entre expresiones que es evaluado como si hubieras insertado::
zh_cn: 由于逗号不是运算符而是表达式之间的分隔符，以上代码的含义就相当于::

source: not::
es: no::
zh_cn: 而不是::

source: The same is true of the various assignment operators (``=``, ``+=`` etc). They are not truly operators but syntactic delimiters in assignment statements.
es: Lo mismo se aplica para varios operadores de asignación (``=``, ``+=`` etc). No son operadores realmente, pero sí delimitadores sintácticos en declaraciones de asignación.
zh_cn: 对于各种赋值运算符 (``=``, ``+=`` 等) 来说同样如此。 它们并不是真正的运算符而是赋值语句中的语法分隔符。

source: Is there an equivalent of C's "?:" ternary operator?
es: ¿Existe algún equivalente al operador ternario "?:" de C?
zh_cn: 是否有与 C 的 "?:" 三目运算符等价的东西？

source: Yes, there is. The syntax is as follows::
es: Si, lo hay. La sintaxis es la siguiente::
zh_cn: 有的。 相应语法如下::

source: Before this syntax was introduced in Python 2.5, a common idiom was to use logical operators::
es: Antes de que la sintaxis fuera introducida en Pytho 2.5, un idioma comun era utilizar operadores lógicos::
zh_cn: 在 Python 2.5 引入此语法之前，常见的做法是使用逻辑运算符::
