Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es, zh_cn

source: Programming FAQ
es: FAQ Programación
zh_cn: 编程常见问题

source: Contents
zh_cn: 目录

source: General Questions
es: Preguntas Generales
zh_cn: 一般问题

source: Is there a source code level debugger with breakpoints, single-stepping, etc.?
es: Existe algún debugger de código fuente con breakpoints, paso-a-paso, etc.?
zh_cn: Python 有没有提供断点与单步调试等功能的，源码层次的调试器？

source: Yes.
es: Sí.
zh_cn: 有的。

source: Several debuggers for Python are described below, and the built-in function :func:`breakpoint` allows you to drop into any of them.
zh_cn: 以下介绍了一些 Python 的调试器，内置函数 :func:`breakpoint` 允许你使用其中的任何一种。

source: The pdb module is a simple but adequate console-mode debugger for Python. It is part of the standard Python library, and is :mod:`documented in the Library Reference Manual <pdb>`. You can also write your own debugger by using the code for pdb as an example.
es: El módulo pdb es un debugger en consola, simple, pero adecuado a Python. Es parte de la librería estándar de Python, y es :mod:`documentado` en el Manual Referencia de la Librería <pdb>`. Puedes también escribir tu propio debugger utilizando el código para pdb como ejemplo.
zh_cn: pdb 模块是一个简单但是够用的控制台模式 Python 调试器。 它是标准 Python 库的一部分，并且 :mod:`已收录于库参考手册 <pdb>`。 你也可以通过使用 pdb 代码作为样例来编写你自己的调试器。

source: The IDLE interactive development environment, which is part of the standard Python distribution (normally available as Tools/scripts/idle), includes a graphical debugger.
es: El entorno interactivo de desarrollo IDLE, que es parte de la distribución estándar de Python (disponible como Herramientas/scripts/idle), incluye un debugger gráfico.
zh_cn: 作为标准 Python 发行版附带组件的 IDLE 交互式环境（通常位于 Tools/scripts/idle）中包含一个图形化的调试器。

source: PythonWin is a Python IDE that includes a GUI debugger based on pdb. The PythonWin debugger colors breakpoints and has quite a few cool features such as debugging non-PythonWin programs. PythonWin is available as part of `pywin32 <https://github.com/mhammond/pywin32>`_ project and as a part of the `ActivePython <https://www.activestate.com/products/python/>`_ distribution.
zh_cn: PythonWin 是一个包括基于 pdb 的 GUI 调试器的 Python IDE。 PythonWin 的调试器会为断点加上颜色，并具有许多很棒的特性，例如调试非 PythonWin 程序等。 PythonWin 是 `pywin32 <https://github.com/mhammond/pywin32>`_ 项目的组成部分，也是 `ActivePython <https://www.activestate.com/products/python/>`_ 发行版的组成部分。

source: `Eric <http://eric-ide.python-projects.org/>`_ is an IDE built on PyQt and the Scintilla editing component.
es: Eric <http://eric-ide.python-projects.org/>`_ es un IDE construído sobre PyQt y el componente de edición Scintilla.
zh_cn: `Eric <http://eric-ide.python-projects.org/>`_ 是一个基于PyQt和Scintilla编辑组件构建的IDE。

source: `trepan3k <https://github.com/rocky/python3-trepan/>`_ is a gdb-like debugger.
zh_cn: `trepan3k <https://github.com/rocky/python3-trepan/>`_ 是一个类似 gdb 的调试器。

source: `Visual Studio Code <https://code.visualstudio.com/>`_ is an IDE with debugging tools that integrates with version-control software.
zh_cn: `Visual Studio Code <https://code.visualstudio.com/>`_ 是一个带有集成了版本控制软件的调试工具的 IDE。

source: There are a number of commercial Python IDEs that include graphical debuggers. They include:
es: Hay un gran número de IDEs en versión comercial para Python que incluyen debuggers gráficos. Incluyen:
zh_cn: 有许多商业Python IDE包括图形调试器。他们包括：

source: Are there tools to help find bugs or perform static analysis?
zh_cn: 是否有能帮助寻找漏洞或执行静态分析的工具？

source: `Pylint <https://www.pylint.org/>`_ and `Pyflakes <https://github.com/PyCQA/pyflakes>`_ do basic checking that will help you catch bugs sooner.
zh_cn: `Pylint <https://www.pylint.org/>`_ 和 `Pyflakes <https://github.com/PyCQA/pyflakes>`_ 可进行基本检查来帮助你尽早捕捉漏洞。

source: Static type checkers such as `Mypy <http://mypy-lang.org/>`_, `Pyre <https://pyre-check.org/>`_, and `Pytype <https://github.com/google/pytype>`_ can check type hints in Python source code.
zh_cn: 静态类型检查器，例如 `Mypy <http://mypy-lang.org/>`_ 、 `Pyre <https://pyre-check.org/>`_ 和 `Pytype <https://github.com/google/pytype>`_ 可以检查Python源代码中的类型提示。

source: How can I create a stand-alone binary from a Python script?
es: ¿Cómo puedo crear un binario stand-alone desde un script de Python?
zh_cn: 我如何能够通过一个 Python 脚本创建一个独立运行的二进制文件？

source: You don't need the ability to compile Python to C code if all you want is a stand-alone program that users can download and run without having to install the Python distribution first. There are a number of tools that determine the set of modules required by a program and bind these modules together with a Python binary to produce a single executable.
es: No necesitas la habilidad de compilar Python a código C si lo único que buscas es un programa stand-alone que los usuarios puedan descargar y ejecutar sin tener que instalar primero la distribución Python. Hay un buen número de herramientas que determinan el conjunto de módulos requeridos por un programa y adhiere esos módulos con un binario de Python para producir un simple ejecutable.
zh_cn: 如果你想要的只是一个独立的程序，用户可以下载和运行而不必先安装Python发行版，你就不需要将Python编译成C代码。有许多工具可以确定程序所需的模块集，并将这些模块与Python二进制文件绑定在一起以生成单个可执行文件。

source: One is to use the freeze tool, which is included in the Python source tree as ``Tools/freeze``. It converts Python byte code to C arrays; a C compiler you can embed all your modules into a new program, which is then linked with the standard Python modules.
es: Una de las formas, es utilizar la herramienta de congelado, que se incluye en el árbol de origen de Python como ``Herramientas/congelar``. Convierte el código byte de Python a arrays de C; un compilador al que que incrustas todos tus módulos generando un nuevo programa, y que después es enlazado con los módulos estándar de la librería Python.
zh_cn: 一种是使用冻结工具，它包含在Python源代码树 ``Tools/freeze`` 中。它将Python字节代码转换为C数组；一个C编译器，你可以将所有模块嵌入到一个新程序中，然后将其与标准Python模块链接。

source: It works by scanning your source recursively for import statements (in both forms) and looking for the modules in the standard Python path as well as in the source directory (for built-in modules). It then turns the bytecode for modules written in Python into C code (array initializers that can be turned into code objects using the marshal module) and creates a custom-made config file that only contains those built-in modules which are actually used in the program. It then compiles the generated C code and links it with the rest of the Python interpreter to form a self-contained binary which acts exactly like your script.
es: Funciona escaneando tu código recursivamente para importar declaraciones (en ambas formas) y buscando los módulos en la ruta estándar de Python, así como también en el directorio raíz del código (para los módulos internos). Después, se convierte el bytecode de los módulos escritos en Python a lenguaje C (los inicializadores de arrays pueden ser convertidos en objetos de código utilizando el modo director) y crea un archivo config personalizado que solo contiene esos módulos internos que son los utilizados en el programa. Tras ello, compila el código C generado y lo enlaza con el resto del intérprete de Python para formar binarios auto-contenidos que actúan exactamente como tu script.
zh_cn: 它的工作原理是递归扫描源代码以获取import语句（两种形式），并在标准Python路径和源目录（用于内置模块）中查找模块。 然后，它将用Python编写的模块的字节码转换为C代码（可以使用编组模块转换为代码对象的数组初始化器），并创建一个定制的配置文件，该文件仅包含程序中实际使用的内置模块。 然后，它编译生成的C代码并将其与Python解释器的其余部分链接，以形成一个独立的二进制文件，其行为与你的脚本完全相同。

source: Obviously, freeze requires a C compiler. There are several other utilities which don't:
zh_cn: 显然，freeze 需要一个 C 编译器。 还有一些其他实用工具则不需要:

source: `py2exe <http://www.py2exe.org/>`_ for Windows binaries
zh_cn: `py2exe <http://www.py2exe.org/>`_ 用于生成 Windows 版二进制可执行文件

source: `py2app <https://github.com/ronaldoussoren/py2app>`_ for Mac OS X binaries
zh_cn: `py2app <https://github.com/ronaldoussoren/py2app>`_ 用于生成 Mac OS X 版二进制可执行文件

source: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ for cross-platform binaries
zh_cn: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ 用于生成跨平台的二进制可执行文件

source: Are there coding standards or a style guide for Python programs?
es: ¿Hay estándares de código o alguna guía de estilos para programas Python?
zh_cn: 是否有 Python 程序规范代码标准或风格指南？

source: Yes. The coding style required for standard library modules is documented as :pep:`8`.
es: Sí. El estilo de código requerido para módulos de la librería estándar es documentado como :pep:`8`.
zh_cn: 有的。 请参阅标准库模块所要求的代码风格描述文档 :pep:`8` 。

source: Core Language
es: Núcleo del lenguaje.
zh_cn: 核心语言

source: Why am I getting an UnboundLocalError when the variable has a value?
es: ¿Por qué recibo un UnboundLocalError cuando la variable tiene un valor?
zh_cn: 当变量有值时，为什么会出现UnboundLocalError？

source: It can be a surprise to get the UnboundLocalError in previously working code when it is modified by adding an assignment statement somewhere in the body of a function.
es: Puede ser sorprendente recibir el UnboundLocalError en código que funcionaba anteriormente cuando es modificado añadiendo una declaración dentro del cuerpo de una función.
zh_cn: 通过在函数体中的某处添加赋值语句，导致以前正常工作的代码被修改而得到 UnboundLocalError 会令人感到意外。

source: This code:
es: Este código:
zh_cn: 以下代码：

source: works, but this code:
es: funciona, pero este código:
zh_cn: 正常工作，但是以下代码

source: results in an UnboundLocalError:
es: devuelve un UnboundLocalError:
zh_cn: 会得到一个 UnboundLocalError ：

source: This is because when you make an assignment to a variable in a scope, that variable becomes local to that scope and shadows any similarly named variable in the outer scope. Since the last statement in foo assigns a new value to ``x``, the compiler recognizes it as a local variable. Consequently when the earlier ``print(x)`` attempts to print the uninitialized local variable and an error results.
es: Esto es porque cuando realizas una asignación a una variable en un ámbito, esa variable se convierte en local para ese ámbito y deja entrever alguna variable nombrada similarmente en el ámbito exterior. Por ej. la última declaración de un código asigna a foo un nuevo valor ``x``, el compilador lo reconoce como una variable local. Consecuentemente, cuando ``print(x)`` definido antes de inicializar la variable intenta imprimirla, nos devuelve un error.
zh_cn: 这是因为当你对作用域中的变量进行赋值时，该变量将成为该作用域的局部变量，并在外部作用域中隐藏任何类似命名的变量。由于foo中的最后一个语句为 ``x`` 分配了一个新值，编译器会将其识别为局部变量。因此，当先前的 ``print(x)`` 尝试打印未初始化的局部变量时会导致错误。

source: In the example above you can access the outer scope variable by declaring it global:
es: En el ejemplo superior, puedes acceder al ámbito externo de la variable declarándola global:
zh_cn: 在上面的示例中，你可以通过将其声明为全局来访问外部作用域变量：

source: This explicit declaration is required in order to remind you that (unlike the superficially analogous situation with class and instance variables) you are actually modifying the value of the variable in the outer scope:
es: Esta declaración explícita se requiere para recordarte que (a diferencia de una situación análoga supérflua con clases e instancias de variables), que estás modificando el valor de una variable en el ámbito exterior.
zh_cn: 这个显式声明是必需的，以便提醒你（与类和实例变量的表面类似情况不同），你实际上是在外部作用域中修改变量的值

source: You can do a similar thing in a nested scope using the :keyword:`nonlocal` keyword:
es: Puedes hacer algo similar en un ámbito anidado utilizando la palabra clave :keyword:`nonlocal`
zh_cn: 你可以使用 :keyword:`nonlocal` 关键字在嵌套作用域中执行类似的操作：

source: What are the rules for local and global variables in Python?
es: ¿Cuáles son las reglas para variables locales y globales en Python?
zh_cn: Python中的局部变量和全局变量有哪些规则？

source: In Python, variables that are only referenced inside a function are implicitly global. If a variable is assigned a value anywhere within the function's body, it's assumed to be a local unless explicitly declared as global.
es: En Python, las variables que dentro de una función solo son referenciadas son implícitamente globales. Si se asigna un valor a una variable en cualquier lugar dentro del cuerpo de la función, se asume que es local a no ser que se declare como global explícitamente.
zh_cn: 在Python中，仅在函数内引用的变量是隐式全局变量。如果在函数体内的任何位置为变量赋值，则除非明确声明为全局，否则将其视为局部值。

source: Though a bit surprising at first, a moment's consideration explains this. On one hand, requiring :keyword:`global` for assigned variables provides a bar against unintended side-effects. On the other hand, if ``global`` was required for all global references, you'd be using ``global`` all the time. You'd have to declare as global every reference to a built-in function or to a component of an imported module. This clutter would defeat the usefulness of the ``global`` declaration for identifying side-effects.
es: Aunque sea un poco sorprendente en un principio, se puede explicar con un momento de consideración. Por un lado, requerir :keyword:`global` para variables asignadas proporciona una barrera contra efectos colaterales indeseados. Por otro lado, si ``global`` fuese necesario para todas las referencias globales, sería necesario utilizar ``global`` todo el tiempo. Habría que declarar como global cada referencia a una función interna o a un componente de un módulo importado. Este impedimento destruiría la utilidad de la declaración ``global`` para identificar efectos colaterales.
zh_cn: 虽然起初有点令人惊讶，但片刻考虑就可以解释。一方面，要求 :keyword:`global` 表示已分配的变量可以防止意外的副作用。另一方面，如果所有全局引用都需要 ``global`` ，那么你一直都在使用 ``global`` 。你必须将对内置函数或导入模块的组件的每个引用声明为全局。这种杂乱会破坏 ``global`` 声明用于识别副作用的有用性。

source: Why do lambdas defined in a loop with different values all return the same result?
es: ¿Por qué todas las expresiones lambda definidas en un bucle con diferentes valores devuelven el mismo resultado?
zh_cn: 为什么在具有不同值的循环中定义的lambdas都返回相同的结果？

source: Assume you use a for loop to define a few different lambdas (or even plain functions), e.g.::
es: Asumimos que utilizas un bucle for para definir unas cuantas expresiones lambda diferentes (o incluso funciones planas), por ej.::
zh_cn: 假设你使用for循环来定义几个不同的 lambda （甚至是普通函数），例如：::

source: This gives you a list that contains 5 lambdas that calculate ``x**2``. You might expect that, when called, they would return, respectively, ``0``, ``1``, ``4``, ``9``, and ``16``. However, when you actually try you will see that they all return ``16``::
es: Esto te proporciona una lista que contiene 5 expresiones lambda que calculan ``x**2``. Podemos esperar que, cuando se llaman, devolverán respectivamente, ``0``, ``1``, ``4``, ``9``, y ``16``. De todos modos, cuando lo intentes, verás que todas devuelven ``16``::
zh_cn: 这给你一个包含5个lambdas的列表，它们计算 ``x**2`` 。你可能会期望，当它们被调用时，它们将分别返回 ``0`` 、 ``1`` 、 ``4`` 、 ``9`` 和 ``16`` 。但是，当你真正尝试时，你会看到它们都返回 ``16`` 。::

source: This happens because ``x`` is not local to the lambdas, but is defined in the outer scope, and it is accessed when the lambda is called --- not when it is defined. At the end of the loop, the value of ``x`` is ``4``, so all the functions now return ``4**2``, i.e. ``16``. You can also verify this by changing the value of ``x`` and see how the results of the lambdas change::
es: Esto sucede porque ``x`` no es local para las expresiones lambda, pero está definida en el ámbito externo, y se accede a ella cuando se llama a una expresión lambda --- no cuando está definida. Al final del bucle, el valor de ``x```es ``4``, de modo que todas las funciones ahora devuelven ``4**2``, por ej. ``16``. También puedes verificar esto cambiando el valor de ``x`` y viendo los resultados de la modificación de las expresiones lambda::
zh_cn: 发生这种情况是因为 ``x`` 不是lambdas的内部变量，而是在外部作用域中定义，并且在调用lambda时访问它 - 而不是在定义它时。 在循环结束时， ``x`` 的值是 ``4`` ，所以所有的函数现在返回 ``4**2`` ，即 ``16`` 。你还可以通过更改 ``x`` 的值来验证这一点，并查看lambdas的结果如何变化::

source: In order to avoid this, you need to save the values in variables local to the lambdas, so that they don't rely on the value of the global ``x``::
es: Para evitar esto, necesitas guardar los valores en variables locales a las expresiones lambda, de modo que no dependan del valor del ``x`` global::
zh_cn: 为了避免这种情况，你需要将值保存在lambdas的局部变量中，这样它们就不依赖于全局``x`` 的值 ::

source: Here, ``n=x`` creates a new variable ``n`` local to the lambda and computed when the lambda is defined so that it has the same value that ``x`` had at that point in the loop. This means that the value of ``n`` will be ``0`` in the first lambda, ``1`` in the second, ``2`` in the third, and so on. Therefore each lambda will now return the correct result::
es: Aquí, ``n=x`` crea una nueva variable ``n``, local para la expresión lambda y calculada cuando se define la expresión lambda, de modo que contiene el mismo valor que ``x`` tenía en ese punto del bucle. Esto significa que el valor de ``n`` será ``0`` en la primera expresión lambda, ``1`` en la segunda, ``2`` en la tercera, y así sucesivamente. Por tanto, cada expresión lambda devolverá ahora el resultado correcto::
zh_cn: 这里， ``n=x`` 在lambda本地创建一个新的变量 ``n`` ，并在定义lambda时计算，使它具有与 ``x`` 在循环中该点相同的值。这意味着 ``n`` 的值在第一个lambda中为 ``0`` ，在第二个lambda中为 ``1`` ，在第三个中为 ``2`` ，依此类推。因此每个lambda现在将返回正确的结果::

source: Note that this behaviour is not peculiar to lambdas, but applies to regular functions too.
es: Cabe destacar que este comportamiento no es solo especial para lambdas, si no que también se aplica a funciones normales.
zh_cn: 请注意，这种行为并不是lambda所特有的，但也适用于常规函数。

source: How do I share global variables across modules?
es: ¿Cómo comparto variables globales entre módulos?
zh_cn: 如何跨模块共享全局变量？

source: The canonical way to share information across modules within a single program is to create a special module (often called config or cfg). Just import the config module in all modules of your application; the module then becomes available as a global name. Because there is only one instance of each module, any changes made to the module object get reflected everywhere. For example:
es: La forma oficial para compartir información entre módulos de un mismo programa es crear un módulo especial (normalmente llamado config o cfg). Simplemente hay que importar el módulo de configuración en todos los módulos de la aplicación; el módulo entonces quedará disponible como un nombre global. Como solo hay una instancia de cada módulo, cualquier cambio hecho al objeto del módulo quedará reflejado en todas partes. Por ejemplo:
zh_cn: 在单个程序中跨模块共享信息的规范方法是创建一个特殊模块（通常称为config或cfg）。只需在应用程序的所有模块中导入配置模块；然后该模块可用作全局名称。因为每个模块只有一个实例，所以对模块对象所做的任何更改都会在任何地方反映出来。 例如：

source: Note that using a module is also the basis for implementing the Singleton design pattern, for the same reason.
es: Cabe destacar que utilizar un módulo es también la base para implementar el patrón de diseño Singleton, por el mismo motivo.
zh_cn: 请注意，出于同样的原因，使用模块也是实现Singleton设计模式的基础。

source: What are the "best practices" for using import in a module?
es: ¿Cuáles son las "mejores prácticas" para utilizar "import" en un módulo?
zh_cn: 导入模块的“最佳实践”是什么？

source: In general, don't use ``from modulename import *``. Doing so clutters the importer's namespace, and makes it much harder for linters to detect undefined names.
es: En general, no utilices ``from modulename import *``. Haciendo esto ponemos patas arriba el espacio de nombres del importador, y hacemos más complicado para los "linters" detectar nombres no definidos.
zh_cn: 通常，不要使用 ``from modulename import *`` 。这样做会使导入器的命名空间变得混乱，并且使得连接器更难以检测未定义的名称。

source: Import modules at the top of a file. Doing so makes it clear what other modules your code requires and avoids questions of whether the module name is in scope. Using one import per line makes it easy to add and delete module imports, but using multiple imports per line uses less screen space.
es: Importa los módulos en la cabecera de un archivo. Haciendo esto dejamos claro que otros módulos requiere tu código y evita preguntas sobre cual es el nombre del módulo en el ámbito. Utilizar un sólo import por línea hace fácil añadir y borrar imports de módulos, pero usar múltiples imports por línea utiliza menos espacio de pantalla.
zh_cn: 在文件的顶部导入模块。这样做可以清楚地了解代码所需的其他模块，并避免了模块名称是否在范围内的问题。每行导入一个模块可以轻松添加和删除导入的模块，但每行导入多个模块会占用更少的屏幕空间。

source: It's good practice if you import modules in the following order:
es: Es una buena práctica importar los módulos en el siguiente orden:
zh_cn: 如果按以下顺序导入模块，这是一种很好的做法：

source: standard library modules -- e.g. ``sys``, ``os``, ``getopt``, ``re``
es: módulos de librerías estándar -- por ej.: ``sys``, ``os``, ``getopt``, ``re``
zh_cn: 标准库模块 -- 例如： ``sys``, ``os``, ``getopt``, ``re``

source: third-party library modules (anything installed in Python's site-packages directory) -- e.g. mx.DateTime, ZODB, PIL.Image, etc.
es: módulos de librerías de terceras-partes (cualquier paquete instalado en el directorio de paquetes de Python) -- por ej.: mx.DateTime, ZODB, PIL.Image, etc.
zh_cn: 第三方库模块（安装在Python的site-packages目录中的任何内容） -- 例如mx.DateTime，ZODB，PIL.Image等

source: locally-developed modules
es: módulos desarollados localmente
zh_cn: 本地开发的模块

source: It is sometimes necessary to move imports to a function or class to avoid problems with circular imports. Gordon McMillan says:
es: A veces resulta necesario mover los imports a una función o clase para evitar problemas con imports circulares. Gordon McMillan dice:
zh_cn: 有时需要将模块导入语句移动到函数或类里面，以避免循环导入问题。Gordon McMillan 说：

source: Circular imports are fine where both modules use the "import <module>" form of import. They fail when the 2nd module wants to grab a name out of the first ("from module import name") and the import is at the top level. That's because names in the 1st are not yet available, because the first module is busy importing the 2nd.
es: Los imports circulares están bien cuando ambos módulos utilizan la forma "import<module>" del import. Fallan cuando el segundo módulo quiere coger un nombre del primero ("from module import name") y el import está en el nivel superior. Esto sucede porque los nombres en el primer import no están todavía disponibles, porque está aún ocupado importando el segundo módulo.
zh_cn: 当两个模块都使用 "import <module>" 的导入形式时，循环导入就可以了。但是当第 2 个模块想从第 1 个模块中获取一个名称 ("from module import name") 并且导入位于顶层时，就会出错。 这是因为第 1 个模块中的名称还不可用，因为第 1 个模块正在忙着导入第 2 个模块。

source: In this case, if the second module is only used in one function, then the import can easily be moved into that function. By the time the import is called, the first module will have finished initializing, and the second module can do its import.
es: En este caso, si el segundo módulo es utilizado únicamente en una función, entonces el import puede ser movido fácilmente dentro de esa función. Mientras se llama al import, el primer módulo habrá finalizado su inicialización, y el segundo módulo puede realizar su import sin problemas.
zh_cn: 在这种情况下，如果第二个模块仅用于一个函数，则可以轻松地将模块导入语句移动到该函数中。调用导入时，第一个模块将完成初始化，第二个模块可以进行导入。

source: It may also be necessary to move imports out of the top level of code if some of the modules are platform-specific. In that case, it may not even be possible to import all of the modules at the top of the file. In this case, importing the correct modules in the corresponding platform-specific code is a good option.
es: Puede ser necesario mover imports fuera del nivel superior de código si alguno de los módulos son específicos de plataforma. En ese caso, puede no ser posible importar todos los módulos en la cabecera del archivo. En este caso, importar los módulos correctos en el código correspondiente a la plataforma específica es una buena opción.
zh_cn: 如果某些模块是特定于平台的，则可能还需要将模块导入语句移出顶级代码。在这种情况下，甚至可能无法导入文件顶部的所有模块。在这种情况下，在相应的特定于平台的代码中导入正确的模块是一个很好的选择。
