Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es, zh_cn

source: Caution: within a method of C, an assignment like ``self.count = 42`` creates a new and unrelated instance named "count" in ``self``'s own dict. Rebinding of a class-static data name must always specify the class whether inside a method or not::
zh_cn: 注意：在 C 的某个方法内部，像 ``self.count = 42`` 这样的赋值将在 ``self`` 自身的字典中新建一个名为 "count" 的不相关实例。 想要重新绑定类静态数据名称就必须总是指明类名，无论是在方法内部还是外部::

source: Static methods are possible::
es: Los métodos son posibles::
zh_cn: 静态方法是可行的：

source: However, a far more straightforward way to get the effect of a static method is via a simple module-level function::
zh_cn: 然而，获得静态方法效果的更直接的方法是通过一个简单的模块级函数：

source: If your code is structured so as to define one class (or tightly related class hierarchy) per module, this supplies the desired encapsulation.
zh_cn: 如果您的代码是结构化的，以便为每个模块定义一个类（或紧密相关的类层次结构），那么这就提供了所需的封装。

source: How can I overload constructors (or methods) in Python?
es: ¿Cómo puedo sobrecargar constructores (o métodos) en Python?
zh_cn: 如何在Python中重载构造函数（或方法）？

source: This answer actually applies to all methods, but the question usually comes up first in the context of constructors.
es: Esta respuesta se aplica actualmente a todos los métodos, pero la cuestión viene dada habitualmente, primero en el contexto de los constructores.
zh_cn: 这个答案实际上适用于所有方法，但问题通常首先出现在构造函数的上下文中。

source: In C++ you'd write
zh_cn: 在C ++中，你会这样写

source: In Python you have to write a single constructor that catches all cases using default arguments. For example::
zh_cn: 在Python中，您必须编写一个构造函数，使用默认参数捕获所有情况。例如：

source: This is not entirely equivalent, but close enough in practice.
zh_cn: 这不完全等同，但在实践中足够接近。

source: You could also try a variable-length argument list, e.g. ::
zh_cn: 你也可以尝试一个可变长度的参数列表，例如::

source: The same approach works for all method definitions.
zh_cn: 相同的方法适用于所有方法定义。

source: I try to use __spam and I get an error about _SomeClassName__spam.
zh_cn: 我尝试使用 __spam ，但是得到一个关于 _SomeClassName__spam 的错误信息。

source: Variable names with double leading underscores are "mangled" to provide a simple but effective way to define class private variables. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with any leading underscores stripped.
zh_cn: 以双下划线打头的变量会被“更名”以提供一种定义类私有变量的简单而有效的方式。 任何形式为 ``__spam`` 的标识符（至少前缀两个下划线，至多后缀一个下划线）文本会被替换为 ``_classname__spam``，其中 ``classname`` 为去除了全部前缀下划线的当前类名称。

source: This doesn't guarantee privacy: an outside user can still deliberately access the "_classname__spam" attribute, and private values are visible in the object's ``__dict__``. Many Python programmers never bother to use private variable names at all.
zh_cn: 这并不能保证私密性：外部用户仍然可以访问 "_classname__spam" 属性，私有变量值也在对象的 ``__dict__`` 中可见。 许多 Python 程序员从来都不使用这种私有变量名称。

source: My class defines __del__ but it is not called when I delete the object.
zh_cn: 类定义了 __del__ 方法，但是删除对象时没有调用它。

source: There are several possible reasons for this.
es: Hay varios razones por esta.
zh_cn: 这有几个可能的原因。

source: The del statement does not necessarily call :meth:`__del__` -- it simply decrements the object's reference count, and if this reaches zero :meth:`__del__` is called.
zh_cn: del 语句不一定调用 :meth:`__del__` —— 它只是减少对象的引用计数，如果（引用计数）达到零，才会调用 :meth:`__del__`。

source: If your data structures contain circular links (e.g. a tree where each child has a parent reference and each parent has a list of children) the reference counts will never go back to zero. Once in a while Python runs an algorithm to detect such cycles, but the garbage collector might run some time after the last reference to your data structure vanishes, so your :meth:`__del__` method may be called at an inconvenient and random time. This is inconvenient if you're trying to reproduce a problem. Worse, the order in which object's :meth:`__del__` methods are executed is arbitrary. You can run :func:`gc.collect` to force a collection, but there *are* pathological cases where objects will never be collected.
zh_cn: 如果数据结构包含循环链接（例如，每个子级都有一个父级引用，每个父级都有一个子级列表的树），则引用计数将永远不会返回零。尽管Python 偶尔会运行一个算法来检测这样的循环，但在数据结构的引用计数清零后，垃圾收集器可能需要一段时间来运行，因此 :meth:`__del__` 方法可能会在不方便和随机的时间被调用。这对于重现一个问题，是非常不方便的。更糟糕的是，对象 :meth:`__del__` 的方法执行顺序是任意的。虽然可以运行 :func:`gc.collect` 来强制回收，但在一些病态的情况下，对象永远不会被回收。

source: Despite the cycle collector, it's still a good idea to define an explicit ``close()`` method on objects to be called whenever you're done with them. The ``close()`` method can then remove attributes that refer to subobjects. Don't call :meth:`__del__` directly -- :meth:`__del__` should call ``close()`` and ``close()`` should make sure that it can be called more than once for the same object.
zh_cn: 尽管有循环收集器，但在对象上定义一个显式的 ``close()`` 方法以便在用完之后调用它仍然是一个好主意。 这样 ``close()`` 方法可以随即删除引用子对象的属性。 不要直接调用 :meth:`__del__` —— 应该由 :meth:`__del__` 调用 ``close()``，并且 ``close()`` 能确保可以被同一对象多次地调用。

source: Another way to avoid cyclical references is to use the :mod:`weakref` module, which allows you to point to objects without incrementing their reference count. Tree data structures, for instance, should use weak references for their parent and sibling references (if they need them!).
zh_cn: 另一种避免循环引用的方法是使用 :mod:`weakref` 模块，该模块允许您指向对象而不增加其引用计数。例如，树状数据结构应该对其父级和同级引用使用弱引用（如果需要的话！）

source: Finally, if your :meth:`__del__` method raises an exception, a warning message is printed to :data:`sys.stderr`.
zh_cn: 最后，如果 :meth:`__del__` 方法引发异常，会将警告消息打印到 :data:`sys.stderr` 。

source: How do I get a list of all instances of a given class?
zh_cn: 如何获取给定类的所有实例的列表？

source: Python does not keep track of all instances of a class (or of a built-in type). You can program the class's constructor to keep track of all instances by keeping a list of weak references to each instance.
zh_cn: Python不跟踪类（或内置类型）的所有实例。您可以对类的构造函数进行编程，以通过保留每个实例的弱引用列表来跟踪所有实例。

source: Why does the result of ``id()`` appear to be not unique?
zh_cn: 为什么 ``id()`` 的结果看起来不是唯一的？

source: The :func:`id` builtin returns an integer that is guaranteed to be unique during the lifetime of the object. Since in CPython, this is the object's memory address, it happens frequently that after an object is deleted from memory, the next freshly created object is allocated at the same position in memory. This is illustrated by this example:
zh_cn: :func:`id` 返回一个整数，该整数在对象的生命周期内保证是唯一的。因为在CPython中，这是对象的内存地址，所以经常发生在从内存中删除对象之后，下一个新创建的对象被分配在内存中的相同位置。这个例子说明了这一点：

source: The two ids belong to different integer objects that are created before, and deleted immediately after execution of the ``id()`` call. To be sure that objects whose id you want to examine are still alive, create another reference to the object:
zh_cn: 这两个id属于之前创建的不同整数对象，并在执行 ``id()`` 调用后立即删除。要确保要检查其id的对象仍处于活动状态，请创建对该对象的另一个引用：

source: Modules
zh_cn: 模块

source: How do I create a .pyc file?
zh_cn: 如何创建 .pyc 文件？

source: When a module is imported for the first time (or when the source file has changed since the current compiled file was created) a ``.pyc`` file containing the compiled code should be created in a ``__pycache__`` subdirectory of the directory containing the ``.py`` file. The ``.pyc`` file will have a filename that starts with the same name as the ``.py`` file, and ends with ``.pyc``, with a middle component that depends on the particular ``python`` binary that created it. (See :pep:`3147` for details.)
zh_cn: 当首次导入模块时（或当前已编译文件创建之后源文件发生了改动），在 ``.py`` 文件所在目录的 ``__pycache__`` 子目录下会创建一个包含已编译代码的 ``.pyc`` 文件。该 ``.pyc`` 文件的名称开头部分将与 ``.py`` 文件名相同，并以 ``.pyc`` 为后缀，中间部分则依据创建它的 ``python`` 版本而各不相同。（详见 :pep:`3147`。）

source: One reason that a ``.pyc`` file may not be created is a permissions problem with the directory containing the source file, meaning that the ``__pycache__`` subdirectory cannot be created. This can happen, for example, if you develop as one user but run as another, such as if you are testing with a web server.
zh_cn: 无法创建 ``.pyc`` 文件的可能原因是包含源文件的目录存在权限问题，这意味着 ``__pycache__`` 子目录无法被创建。 举例来说，如果你以某一用户来开发程序但以另一用户身份来运行程序时就可能发生问题，测试 Web 服务器就属于这种情况。

source: Unless the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable is set, creation of a .pyc file is automatic if you're importing a module and Python has the ability (permissions, free space, etc...) to create a ``__pycache__`` subdirectory and write the compiled module to that subdirectory.
zh_cn: 除非设置了 :envvar:`PYTHONDONTWRITEBYTECODE` 环境变量，否则当你导入模块并且 Python 具有创建 ``__pycache__`` 子目录并将已编译模块写入该子目录的能力（权限、存储空间等等）时就会自动创建 .pyc 文件。

source: Running Python on a top level script is not considered an import and no ``.pyc`` will be created. For example, if you have a top-level module ``foo.py`` that imports another module ``xyz.py``, when you run ``foo`` (by typing ``python foo.py`` as a shell command), a ``.pyc`` will be created for ``xyz`` because ``xyz`` is imported, but no ``.pyc`` file will be created for ``foo`` since ``foo.py`` isn't being imported.
zh_cn: 在最高层级运行的 Python 脚本不被视为导入，因此不会创建 ``.pyc`` 文件。 例如，如果你有一个最高层级模块文件 ``foo.py``，它又导入了另一个模块 ``xyz.py``，当你运行 ``foo`` 模块 (通过输入终端命令 ``python foo.py``)，则将为 ``xyz`` 创建一个 ``.pyc``，因为 ``xyz`` 是被导入的，但不会为 ``foo`` 创建 ``.pyc`` 文件，因为 ``foo.py`` 不是被导入的。

source: If you need to create a ``.pyc`` file for ``foo`` -- that is, to create a ``.pyc`` file for a module that is not imported -- you can, using the :mod:`py_compile` and :mod:`compileall` modules.
zh_cn: 如果你需要为 ``foo`` 创建 ``.pyc`` 文件 —— 即为不是被导入的模块创建 ``.pyc`` 文件 —— 你可以使用 :mod:`py_compile` 和 :mod:`compileall` 模块。

source: The :mod:`py_compile` module can manually compile any module. One way is to use the ``compile()`` function in that module interactively::
zh_cn: :mod:`py_compile` 模块能够手动编译任意模块。 一种做法是交互式地使用该模块中的 ``compile()`` 函数::

source: This will write the ``.pyc`` to a ``__pycache__`` subdirectory in the same location as ``foo.py`` (or you can override that with the optional parameter ``cfile``).
zh_cn: 这将会将 ``.pyc`` 文件写入与 ``foo.py`` 相同位置下的 ``__pycache__`` 子目录（或者你也可以通过可选参数 ``cfile`` 来重载该行为）。

source: You can also automatically compile all files in a directory or directories using the :mod:`compileall` module. You can do it from the shell prompt by running ``compileall.py`` and providing the path of a directory containing Python files to compile::
es: Puedes compilar automáticamente todos los archivos de un directorio o directorios utilizando el módulo :mod:`compileall`. Puedes hacerlo desde terminal ejecutando ``compileall.py`` y proporcionando la ruta al directorio contenedor de archivos Python a compilar::
zh_cn: 你还可以使用 :mod:`compileall` 模块自动编译一个目录或多个目录下的所有文件。 具体做法可以是在命令行提示符中运行 ``compileall.py`` 并提供包含要编译 Python 文件的目录路径::

source: How do I find the current module name?
zh_cn: 如何找到当前模块名称？

source: A module can find out its own module name by looking at the predefined global variable ``__name__``. If this has the value ``'__main__'``, the program is running as a script. Many modules that are usually used by importing them also provide a command-line interface or a self-test, and only execute this code after checking ``__name__``::
zh_cn: 模块可以通过查看预定义的全局变量 ``__name__`` 找到自己的模块名称。如果它的值为 ``'__main__'`` ，程序将作为脚本运行。通常，通过导入使用的许多模块也提供命令行界面或自检，并且只在检查 ``__name__`` 之后，才执行之后的代码::

source: How can I have modules that mutually import each other?
zh_cn: 如何让模块相互导入？

source: Suppose you have the following modules:
zh_cn: 假设您有以下模块：

source: The problem is that the interpreter will perform the following steps:
zh_cn: 问题是解释器将执行以下步骤：

source: main imports foo
zh_cn: 首先导入foo

source: Empty globals for foo are created
zh_cn: 创建用于foo的空全局变量

source: foo is compiled and starts executing
zh_cn: foo被编译并开始执行

source: foo imports bar
zh_cn: foo 导入 bar

source: Empty globals for bar are created
zh_cn: 创建了用于bar 的空全局变量

source: bar is compiled and starts executing
zh_cn: bar被编译并开始执行

source: bar imports foo (which is a no-op since there already is a module named foo)
zh_cn: bar导入foo（这是一个空操作（no-op ），因为已经有一个名为foo的模块）

source: The last step fails, because Python isn't done with interpreting ``foo`` yet and the global symbol dictionary for ``foo`` is still empty.
zh_cn: 最后一步失败了，因为Python还没有解释foo，而foo的全局符号字典仍然是空的。

source: The same thing happens when you use ``import foo``, and then try to access ``foo.foo_var`` in global code.
zh_cn: 当你使用 ``import foo`` ，然后尝试在全局代码中访问 ``foo.foo_var`` 时，会发生同样的事情。

source: There are (at least) three possible workarounds for this problem.
es: Existen (al menos) tres posibles escenarios para este problema.
zh_cn: 这个问题有（至少）三种可能的解决方法。

source: Guido van Rossum recommends avoiding all uses of ``from <module> import ...``, and placing all code inside functions. Initializations of global variables and class variables should use constants or built-in functions only. This means everything from an imported module is referenced as ``<module>.<name>``.
es: Guido van Rossum recomienda evitar todo uso de ``from <module> import ...``, y colocar todo el código dentro de las funciones, inicializaciones o variables globales, y las variables de clase deberían utilizar constantes o funciones internas únicamente. Esto significa que todo módulo importado es referenciado como ``<module>.<name>``.
zh_cn: Guido van Rossum 建议避免使用 ``from <module> import ...`` ，并将所有代码放在函数中。全局变量和类变量的初始化只能使用常量或内置函数。这意味着导入模块中的所有内容都被引用为 ``<module>.<name>`` 。

source: Jim Roskind suggests performing steps in the following order in each module:
es: Jim Roskind sugiere realizar los siguientes pasos en el siguiente orden en cada módulo:
zh_cn: Jim Roskind建议在每个模块中按以下顺序执行步骤：

source: exports (globals, functions, and classes that don't need imported base classes)
es: exports (globales, funciones y clases que no necesitan clases base importadas)
zh_cn: 导出（全局变量，函数和不需要导入基类的类）

source: ``import`` statements
es: declaraciones ``import``
zh_cn: ``导入`` 声明

source: active code (including globals that are initialized from imported values).
es: código activo (incluyendo globales que son inicializadas de valores importados).
zh_cn: 活动代码（包括从导入值初始化的全局变量）。

source: van Rossum doesn't like this approach much because the imports appear in a strange place, but it does work.
es: a van Rossum no le gusta demasiado esta visión porque los imports aparecen en lugares extraños, pero funciona.
zh_cn: van Rossum不喜欢这种方法，因为导入出现在一个陌生的地方，但这种方法确实有效。

source: Matthias Urlichs recommends restructuring your code so that the recursive import is not necessary in the first place.
es: Matthias Urlichs recomienda reestructurar tu código de modo que el import recursivo no sea necesario en primer lugar.
zh_cn: Matthias Urlichs建议重构代码，以便首先不需要递归导入。

source: These solutions are not mutually exclusive.
es: Estas soluciones no son exclusivas mútuamente.
zh_cn: 这些解决方案并不相互排斥。

source: __import__('x.y.z') returns <module 'x'>; how do I get z?
zh_cn: __import__('x.y.z') 返回 <module 'x'>; 如何获取z?

source: Consider using the convenience function :func:`~importlib.import_module` from :mod:`importlib` instead::
zh_cn: 考虑使用 :mod:`importlib` 中的函数 :func:`~importlib.import_module` ：

source: When I edit an imported module and reimport it, the changes don't show up. Why does this happen?
zh_cn: 当我编辑了导入过的模块并重新导入它时，这些变化没有显示出来。为什么会这样？

source: For reasons of efficiency as well as consistency, Python only reads the module file on the first time a module is imported. If it didn't, in a program consisting of many modules where each one imports the same basic module, the basic module would be parsed and re-parsed many times. To force re-reading of a changed module, do this::
zh_cn: 出于效率和一致性的原因，Python仅在第一次导入模块时读取模块文件。如果不这么做，在一个由许多模块组成的程序中，每个模块都会导入相同的基本模块，那么基本模块将被解析和重新解析多次。要强制重新读取已更改的模块，请执行以下操作::

source: Warning: this technique is not 100% fool-proof. In particular, modules containing statements like ::
zh_cn: 警告：这种技术不是100％万无一失。特别是包含如下语句的模块

source: will continue to work with the old version of the imported objects. If the module contains class definitions, existing class instances will *not* be updated to use the new class definition. This can result in the following paradoxical behaviour::
zh_cn: 将继续使用旧版本的导入对象。如果模块包含类定义，则不会更新现有的类实例以使用新的类定义。这可能导致以下矛盾行为::

source: The nature of the problem is made clear if you print out the "identity" of the class objects::
zh_cn: 如果打印出类对象的“标识”，问题的本质就会明确：

source: `Boa Constructor <http://boa-constructor.sourceforge.net/>`_ is an IDE and GUI builder that uses wxWidgets. It offers visual frame creation and manipulation, an object inspector, many views on the source like object browsers, inheritance hierarchies, doc string generated html documentation, an advanced debugger, integrated help, and Zope support.
es: `Boa Constructor <http://boa-constructor.sourceforge.net/>`_ es un IDE y constructor de GUI que utiliza wxWidgets. Ofrece un marco de creación visual y manipulación, un inspector de objetos, diferentes vistas sobre el código como buscadores de objetos, jerarquías de herencias, documentación html generada mediante strings, un debugger avanzado, ayuda integrada y soporte Zope.

source: Is there a tool to help find bugs or perform static analysis?
es: ¿Existe alguna herramienta de ayuda para encontrar bugs o realizar análisis estáticos?

source: PyChecker is a static analysis tool that finds bugs in Python source code and warns about code complexity and style. You can get PyChecker from http://pychecker.sourceforge.net/.
es: PyChecker es una herramienta de análisis estático que te ayuda a encontrar bugs en el código fuente de Python y advierte sobre la complejidad del código y el estilo. Puedes obtener PyChecker desde http://pychecker.sourceforge.net/.

source: Obviously, freeze requires a C compiler. There are several other utilities which don't. One is Thomas Heller's py2exe (Windows only) at
es: Obviamente, el congelado requiere un compilador de C. Existen muchas otras utilidades que no requieren tal cosa. Una de ellas es Thomas Heller's py2exe (sólo Windows) en

source: Use the :func:`reversed` built-in function, which is new in Python 2.4::
es: Utiliza la función integrada :func:`reversed`, nueva en Python 2.4::

source: With Python 2.3, you can use an extended slice syntax::
es: Con Python 2.3, puedes utilizar notación slice extendida::
