Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es, zh_cn

source: The type constructor ``list(seq)`` converts any sequence or iterable into a list with the same items in the same order. For example, ``list((1, 2, 3))`` yields ``[1, 2, 3]`` and ``list('abc')`` yields ``['a', 'b', 'c']``. If the argument is a list, it makes a copy just like ``seq[:]`` would.
es: El constructor tipo `list(seq)`` convierte cualquier secuencia u objeto iterable en una lista con los mismos items en el mismo orden. Por ejemplo ``list((1, 2, 3))`` devuelve ``[1, 2, 3]`` y ``list('abc')`` devuelve ``['a', 'b', 'c']``. Si el argumento es una lista, hace una copia del modo ``seq[:]``.
zh_cn: 类型构造器 ``list(seq)`` 可将任意序列或可迭代对象转换为具有相同排列顺序的相同条目的列表。 例如，``list((1, 2, 3))`` 产生 ``[1, 2, 3]`` 而 ``list('abc')`` 产生 ``['a', 'b', 'c']``。 如果参数为一个列表，它会像 ``seq[:]`` 那样创建一个副本。

source: What's a negative index?
es: ¿Qué es un índice negativo?
zh_cn: 什么是负数序号？

source: Python sequences are indexed with positive numbers and negative numbers. For positive numbers 0 is the first index 1 is the second index and so forth. For negative indices -1 is the last index and -2 is the penultimate (next to last) index and so forth. Think of ``seq[-n]`` as the same as ``seq[len(seq)-n]``.
es: Las secuencias Python son indexadas con númreos positivos y números negativos Para los números positivos, 0 es el primer index, 1 es el segundo y así sucesivamente. Piensa en ``seq[-n]`` como equidad de ``seq[len(seq)-n]``.
zh_cn: Python 序列使用正数或负数作为序号或称索引号。 对于正数序号，第一个序号为 0 而 1 为第二个序号，依此类推。 对于负数序号，倒数第一个序号为 -1 而倒数第二个序号为 -2，依此类推。 可以认为 ``seq[-n]`` 就相当于 ``seq[len(seq)-n]``。

source: Using negative indices can be very convenient. For example ``S[:-1]`` is all of the string except for its last character, which is useful for removing the trailing newline from a string.
es: Utilizar índices negativos puede ser conveniente. Por ejemplo ``S[:-1]`` es todo el string, excepto su último carácter, el cual es útil para borrar el salto de linea de un string.
zh_cn: 使用负数序号有时会很方便。 例如 ``S[:-1]`` 就是原字符串去掉最后一个字符，这可以用来移除某个字符串末尾的换行符。

source: How do I iterate over a sequence in reverse order?
es: ¿Cómo itero sobre una secuencia en orden inverso?
zh_cn: 如何以相反的顺序迭代序列？

source: Use the :func:`reversed` built-in function::
zh_cn: 使用 :func:`reversed` 内置函数::

source: This won't touch your original sequence, but build a new copy with reversed order to iterate over.
es: Esto no tocará tu secuencia original, pero crea una nueva copia con orden inverso para volver a iterar.
zh_cn: 这不会修改您的原始序列，而是构建一个反向顺序的新副本以进行迭代。

source: How do you remove duplicates from a list?
es: ¿Cómo borrar duplicados de una lista?
zh_cn: 如何从列表中删除重复项？

source: See the Python Cookbook for a long discussion of many ways to do this:
es: Ver el Libro de Cocina Python para una discusión más amplia sobre formas de realizar esto:
zh_cn: 有关执行此操作的许多方法的详细讨论，请参阅 Python Cookbook:

source: If you don't mind reordering the list, sort it and then scan from the end of the list, deleting duplicates as you go::
es: Si no te importa reordenar la lista, ordénala y tras ello haz un scan desde el inicio de la lista, borrando los duplicados por el camino::
zh_cn: 如果您不介意重新排序列表，请对其进行排序，然后从列表末尾进行扫描，删除重复项：

source: If all elements of the list may be used as set keys (i.e. they are all :term:`hashable`) this is often faster ::
es: Si todos los elementos de la lista pueden usarse como claves set (por ej. si todas son :term:`hashable`), suele ser más rápido::
zh_cn: 如果列表的所有元素都可以用作设置键（即：它们都是 :term:`hashable` ），这通常会更快::

source: This converts the list into a set, thereby removing duplicates, and then back into a list.
es: Esto convierte la lista en un set, de este modo borramos los duplicados, y volvemos a convertirlo en lista.
zh_cn: 这会将列表转换为集合，从而删除重复项，然后返回到列表中。

source: How do you remove multiple items from a list
zh_cn: 如何从列表中删除多个项？

source: As with removing duplicates, explicitly iterating in reverse with a delete condition is one possibility. However, it is easier and faster to use slice replacement with an implicit or explicit forward iteration. Here are three variations.::
zh_cn: 对于删除重复项，一种可能的做法是设置删除条件显式地进行反向迭代。但是更容易也更快速的做法是进行隐式或显式的正向迭代并使用切片替代。 以下列出了三种方式。::

source: The list comprehension may be fastest.
zh_cn: 列表推导式可能是最快的。

source: How do you make an array in Python?
es: ¿Como creas un array en Python?
zh_cn: 如何在Python中创建数组？

source: Use a list::
es: Utiliza una lista::
zh_cn: 使用列表::

source: Lists are equivalent to C or Pascal arrays in their time complexity; the primary difference is that a Python list can contain objects of many different types.
es: Las listas son equivalentes a los arrays de C o Pascal en su complejidad temporal; la diferencia primordial es que una lista de Python puede contener objetos de muchos tipos diferentes.
zh_cn: 列表在时间复杂度方面相当于C或Pascal数组；主要区别在于，python列表可以包含许多不同类型的对象。

source: The ``array`` module also provides methods for creating arrays of fixed types with compact representations, but they are slower to index than lists. Also note that the Numeric extensions and others define array-like structures with various characteristics as well.
es: El módulo ``array`` también proporciona métodos para crear arrays de tipos fijos, con representaciones compactas, pero son más lentos de indexar que las listas. Fíjate que las extensiones Numeric y otras, definen estructuras similares a los arrays con diferentes características.
zh_cn: ``array`` 模块还提供了创建具有紧凑表示的固定类型的数组的方法，但它的索引速度比列表慢。还要注意，数字扩展和其他扩展还定义了具有各种特性的类似数组的结构。

source: To get Lisp-style linked lists, you can emulate cons cells using tuples::
es: Para tener listas linkadas estilo Lisp, puedes emular cons cells utilizando tuplas::
zh_cn: 要获取Lisp样式的列表，可以使用元组模拟cons单元：

source: If mutability is desired, you could use lists instead of tuples. Here the analogue of lisp car is ``lisp_list[0]`` and the analogue of cdr is ``lisp_list[1]``. Only do this if you're sure you really need to, because it's usually a lot slower than using Python lists.
es: Si se desea mutabilidad, puedes utilizar listas en lugar de tuplas. Aquí la analogía de coche lisp es ``lisp_list[0]`` y el análogo de cdr es ``lisp_list[1]``. Haz esto sólo si estás seguro de que lo necesitas, porque normalmente es más lento que utilizar listas Python.
zh_cn: 如果需要可变性，可以使用列表而不是元组。这里模拟lisp car的是 ``lisp_list[0]`` ，模拟cdr的是 ``lisp_list[1]`` 。只有在你确定真的需要的时候才这样做，因为它通常比使用Python列表慢得多。

source: How do I create a multidimensional list?
es: ¿Cómo creo una lista multidimensional?
zh_cn: 如何创建多维列表？

source: You probably tried to make a multidimensional array like this::
es: Probablemente hayas intentado crear un array multidimensional del siguiente modo::
zh_cn: 你可能试图制作一个像这样的多维数组::

source: This looks correct if you print it:
zh_cn: 如果你打印它，看起来是正确的：

source: But when you assign a value, it shows up in multiple places:
es: Pero cuando asignas un valor, se muestra en varios lugares:
zh_cn: 但是，当你给某一项赋值时，会同时在多个位置显示变化：

source: The reason is that replicating a list with ``*`` doesn't create copies, it only creates references to the existing objects. The ``*3`` creates a list containing 3 references to the same list of length two. Changes to one row will show in all rows, which is almost certainly not what you want.
es: La razón es que replicando una lista con ``*`` no crea copias, tan sólo crea referencias a los objetos existentes. ``*3`` crea una lista que contiene 3 referencias a la misma lista de longitud dos. Los cambios a una fila se mostrarán en todas las filas, lo que es claramente, algo que no quieres.
zh_cn: 其中的原因在于使用 ``*`` 对列表执行重复操作并不是创建副本，它只是创建现有对象的引用。 ``*3`` 创建了对长度为二的同一列表的 3 个引用。 对某一行的改变会作用于所有行，通常这一定不是你所希望的。

source: The suggested approach is to create a list of the desired length first and then fill in each element with a newly created list::
es: Un acercamiento sugerido es, primero crear una lista de longitud deseada y después rellenar en cada elemento con una nueva lista::
zh_cn: 建议的做法是先创建一个所需长度的列表，然后其中的元素再以一个新创建的列表来填充::

source: This generates a list containing 3 different lists of length two. You can also use a list comprehension::
es: Esto genera una lista que contiene 3 listas diferentes de longitud 2. Tambien puedes utilizar una comprensión de lista::
zh_cn: 这样就生成了一个包含 3 个长度为二的不同列表的列表。 你也可以使用列表推导式::

source: Or, you can use an extension that provides a matrix datatype; `NumPy <http://www.numpy.org/>`_ is the best known.
zh_cn: 或者你还可以使用提供矩阵类型的扩展包；其中最著名的是 `NumPy <http://www.numpy.org/>`_。

source: How do I apply a method to a sequence of objects?
es: ¿Como aplico un método a una secuencia de objetos?
zh_cn: 如何将方法应用于一系列对象？

source: Use a list comprehension::
es: Usa una comprensión de lista::
zh_cn: 可以使用列表推导式：

source: Why does a_tuple[i] += ['item'] raise an exception when the addition works?
es: ¿Por qué a_tuple[i] += ['item'] lanza una excepción cuando funciona la adición?
zh_cn: 为什么 a_tuple[i] += ['item'] 会在执行加法时引发异常？

source: This is because of a combination of the fact that augmented assignment operators are *assignment* operators, and the difference between mutable and immutable objects in Python.
es: Esto sucede por la combinación del hecho de que los operadores de asignación aumentada son operadores de *assignment*, y por la diferencia entre objetos mutables e inmutables en Python.
zh_cn: 这是由两个事实共同导致的结果，一是增强赋值运算符属于 *赋值* 运算符，二是在 Python 中存在可变和不可变两种不同的对象。

source: This discussion applies in general when augmented assignment operators are applied to elements of a tuple that point to mutable objects, but we'll use a ``list`` and ``+=`` as our exemplar.
es: Esto se aplica en general cuando los operadores de asignación aumentada se aplican a elementos de una tupla que apunta a objetos mutables, pero utilizaremos ``list`` y ``+=`` como ejemplo.
zh_cn: 此处的讨论在任何对元组中指向可变对象的元素使用增强赋值运算符的情况都是普遍成立的，但在此我们只以 ``list`` 和 ``+=`` 来举例。

source: If you wrote::
es: Si has escrito::
zh_cn: 如果你写成这样::

source: The reason for the exception should be immediately clear: ``1`` is added to the object ``a_tuple[0]`` points to (``1``), producing the result object, ``2``, but when we attempt to assign the result of the computation, ``2``, to element ``0`` of the tuple, we get an error because we can't change what an element of a tuple points to.
es: La razón para la excepción debería estar clara inmediatamente: ``1`` es añadido al objeto ``a_tuple[0]`` que apunta a (``1``), produciendo el objeto resultado, ``2``, pero cuando intentamos asignar el resultado de la operación, ``2``, al elemento ``0`` de la tupla, tenemos un error porque no podemos cambiar aquelllo a lo que apunta un elemento de la tupla.
zh_cn: 发生异常的原因是显而易见的: ``1`` 会与对象 ``a_tuple[0]`` 相加，而该对象为 (``1``)，得到结果对象 ``2``，但当我们试图将运算结果 ``2`` 赋值给元组的 ``0`` 号元素时就将报错，因为我们不能改变元组的元素所指向的对象。

source: Under the covers, what this augmented assignment statement is doing is approximately this::
es: Bajo la superficie, lo que está haciendo esta declaración de asignación aumentada es aproximadamente esto::
zh_cn: 在表层之处，以上增强赋值语句所做的大致是这样::

source: It is the assignment part of the operation that produces the error, since a tuple is immutable.
es: Es la parte de la operación de asignación la que produce el error, ya que una tupla es inmutable.
zh_cn: 由于元组是不可变的，因此操作的赋值部分会引发错误。

source: When you write something like::
es: Cuando escribes algo así::
zh_cn: 当你这样写的时候::

source: The exception is a bit more surprising, and even more surprising is the fact that even though there was an error, the append worked::
es: La excepción es un poco más sorprendente, e incluso más sorprendente es el hecho de que incluso aunque hubiera un error, el añadido haya funcionado::
zh_cn: 发生异常会令人略感吃惊，还有一个更为令人吃惊的事实：虽然有报错，但是添加操作却生效了::

source: To see why this happens, you need to know that (a) if an object implements an ``__iadd__`` magic method, it gets called when the ``+=`` augmented assignment is executed, and its return value is what gets used in the assignment statement; and (b) for lists, ``__iadd__`` is equivalent to calling ``extend`` on the list and returning the list. That's why we say that for lists, ``+=`` is a "shorthand" for ``list.extend``::
es: Para ver por qué sucede esto, necesitas saber que (a) si un objeto implementa el método mágico ``__iadd__``, se le llama cuando se ejecuta la asignación aumentada ``+=``, y devuelve lo que está declarado en la asignación; y (b) para listas, ``__iadd__`` equivale a llamar a ``extend`` en la lista y retornar dicha lista. Esto es por qué decimos que para listas, ``+=`` es un "shorthand" de ``list.extend``::
zh_cn: 要明白为何会这样，你需要知道 (a) 如果一个对象实现了 ``__iadd__`` 魔术方法，它会在执行 ``+=`` 增强赋值时被调用，并且其返回值将用于该赋值语句； (b) 对于列表来说，``__iadd__`` 等价于在列表上调用 ``extend`` 并返回该列表。 因此对于列表我们可以说 ``+=`` 就是 ``list.extend`` 的“快捷方式”::

source: This is equivalent to::
es: Esto equivale a::
zh_cn: 这相当于::

source: The object pointed to by a_list has been mutated, and the pointer to the mutated object is assigned back to ``a_list``. The end result of the assignment is a no-op, since it is a pointer to the same object that ``a_list`` was previously pointing to, but the assignment still happens.
es: El objeto apuntado por una a_list ha sido mutado, y el apuntador del objeto mutado es asignado a ``a_list``. El resultado de la asignación es un no-op, ya que es un apuntador al mismo objeto al que estaba apuntando ``a_list``, pero la asignación se sigue ejecutando.
zh_cn: a_list 所引用的对象已被修改，而引用被修改对象的指针又重新被赋值给 ``a_list``。 赋值的最终结果没有变化，因为它是引用 ``a_list`` 之前所引用的同一对象的指针，但仍然发生了赋值操作。

source: Thus, in our tuple example what is happening is equivalent to::
zh_cn: 因此，在我们的元组示例中，发生的事情等同于：

source: The ``__iadd__`` succeeds, and thus the list is extended, but even though ``result`` points to the same object that ``a_tuple[0]`` already points to, that final assignment still results in an error, because tuples are immutable.
zh_cn: ``__iadd__`` 成功执行，因此列表得到了扩充，但是虽然 ``result`` 指向了 ``a_tuple[0]`` 已经指向的同一对象，最后的赋值仍然导致了报错，因为元组是不可变的。

source: I want to do a complicated sort: can you do a Schwartzian Transform in Python?
zh_cn: 我想做一个复杂的排序：你能用Python做一个Schwartzian变换吗？

source: The technique, attributed to Randal Schwartz of the Perl community, sorts the elements of a list by a metric which maps each element to its "sort value". In Python, use the ``key`` argument for the :meth:`list.sort` method::
zh_cn: 该技术归功于Perl社区的 Randal Schwartz，它通过将每个元素映射到其 "排序值（sort value）" 的度量对列表中的元素进行排序。在Python中，使用 :meth:`list.sort` 方法的 ``key`` 参数：

source: How can I sort one list by values from another list?
zh_cn: 如何按其他列表中的值对一个列表进行排序？

source: Merge them into an iterator of tuples, sort the resulting list, and then pick out the element you want. ::
zh_cn: 将它们合并到元组的迭代器中，对结果列表进行排序，然后选择所需的元素。

source: An alternative for the last step is::
es: Una alternativa al último paso es::
zh_cn: 最后一步的替代方案是::

source: If you find this more legible, you might prefer to use this instead of the final list comprehension. However, it is almost twice as slow for long lists. Why? First, the ``append()`` operation has to reallocate memory, and while it uses some tricks to avoid doing that each time, it still has to do it occasionally, and that costs quite a bit. Second, the expression "result.append" requires an extra attribute lookup, and third, there's a speed reduction from having to make all those function calls.
zh_cn: 如果你觉得这个更容易读懂，那么你可能更喜欢使用这个而不是前面的列表推导。然而，对于长列表来说，它的速度几乎是原来的两倍。为什么？首先， ``append()`` 操作必须重新分配内存，虽然它使用了一些技巧来避免每次都这样做，但它仍然偶尔需要这样做，而且代价相当高。第二，表达式 "result.append" 需要额外的属性查找。第三，必须执行所有这些函数调用会降低速度。

source: Objects
es: Objetos
zh_cn: 对象

source: What is a class?
es: ¿Qué es una clase?
zh_cn: 什么是类？

source: A class is the particular object type created by executing a class statement. Class objects are used as templates to create instance objects, which embody both the data (attributes) and code (methods) specific to a datatype.
zh_cn: ``类`` 是通过执行类语句创建的特定对象类型。``类对象`` 被当作模板来创建实例对象，实例对象包含了特定于数据类型的数据（属性）和代码（方法）。

source: A class can be based on one or more other classes, called its base class(es). It then inherits the attributes and methods of its base classes. This allows an object model to be successively refined by inheritance. You might have a generic ``Mailbox`` class that provides basic accessor methods for a mailbox, and subclasses such as ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` that handle various specific mailbox formats.
zh_cn: 类可以基于一个或多个的其他类，称之为基类（ES），它继承基类的属性和方法，这样就可以通过继承来连续地细化对象模型。例如：您可能有一个 ``Mailbox`` 类提供邮箱的基本访问方法.，它的子类 ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` 用于处理各种特定邮箱格式。

source: What is a method?
es: ¿Qué es un método?
zh_cn: 什么是方法？

source: A method is a function on some object ``x`` that you normally call as ``x.name(arguments...)``. Methods are defined as functions inside the class definition::
zh_cn: ``方法`` 实际上就是类定义中的函数。对于某个对象 ``x`` 上的方法，通常称为 ``x.name(arguments...)`` 。

source: What is self?
es: ¿Qué es self?
zh_cn: 什么是 self ？

source: Self is merely a conventional name for the first argument of a method. A method defined as ``meth(self, a, b, c)`` should be called as ``x.meth(a, b, c)`` for some instance ``x`` of the class in which the definition occurs; the called method will think it is called as ``meth(x, a, b, c)``.
zh_cn: Self 只是 ``方法`` 的第一个参数的常规名称。例如：对于某个类的某个实例 ``x`` ，其方法 ``meth(self, a, b, c)`` 实际上应该被称为 ``x.meth(a, b, c)`` ；对于被调用的方法会被称为 ``meth(x, a, b, c)`` 。

source: See also :ref:`why-self`.
es: Ver también :ref:`why-self`.
zh_cn: 另请参阅 :ref:`why-self` 。

source: How do I check if an object is an instance of a given class or of a subclass of it?
es: ¿Cómo compruebo si un objeto es una instancia de una clase dada o una subclase de ella?
zh_cn: 如何检查对象是否为给定类或其子类的一个实例？

source: Use the built-in function ``isinstance(obj, cls)``. You can check if an object is an instance of any of a number of classes by providing a tuple instead of a single class, e.g. ``isinstance(obj, (class1, class2, ...))``, and can also check whether an object is one of Python's built-in types, e.g. ``isinstance(obj, str)`` or ``isinstance(obj, (int, float, complex))``.
zh_cn: 可使用内置函数 ``isinstance(obj, cls)``。 你可以提供一个元组而不是单个类来检查某个对象是否为任意多个类当中某一个类的实例，例如 ``isinstance(obj, (class1, class2, ...))``，也可以检查某个对象是否为 Python 内置类型当中某一个类型的对象，例如 ``isinstance(obj, str)`` 或 ``isinstance(obj, (int, float, complex))``。

source: Note that most programs do not use :func:`isinstance` on user-defined classes very often. If you are developing the classes yourself, a more proper object-oriented style is to define methods on the classes that encapsulate a particular behaviour, instead of checking the object's class and doing a different thing based on what class it is. For example, if you have a function that does something::
zh_cn: 请注意大多数程序不会经常对用户自定义类使用 :func:`isinstance`。 如果是你自已开发的类，更正确的面向对象风格是在类中定义方法来封装特定的行为，而不是检查对象的类并根据它属于什么类来做不同的事。 例如，如果你有一个执行某些操作的函数::

source: A better approach is to define a ``search()`` method on all the classes and just call it::
es: Un mejor acercamiento es definir un método ``search()`` en todas las clases y simplemente llamarlo::
zh_cn: 更好的方法是在所有类上定义一个 ``search()`` 方法，然后调用它：

source: What is delegation?
es: ¿Qué es delegación?
zh_cn: 什么是委托？

source: Delegation is an object oriented technique (also called a design pattern). Let's say you have an object ``x`` and want to change the behaviour of just one of its methods. You can create a new class that provides a new implementation of the method you're interested in changing and delegates all other methods to the corresponding method of ``x``.
zh_cn: 委托是一种面向对象的技巧（也称为设计模式）。 假设您有一个对象 ``x`` 并且想要改变其中一个方法的行为。 您可以创建一个新类，它提供您感兴趣的方法的新实现，并将所有其他方法委托给 ``x`` 的相应方法。

source: Python programmers can easily implement delegation. For example, the following class implements a class that behaves like a file but converts all written data to uppercase::
zh_cn: Python程序员可以轻松实现委托。 例如，以下类实现了一个类，该类的行为类似于文件，但将所有写入的数据转换为大写：

source: Here the ``UpperOut`` class redefines the ``write()`` method to convert the argument string to uppercase before calling the underlying ``self._outfile.write()`` method. All other methods are delegated to the underlying ``self._outfile`` object. The delegation is accomplished via the ``__getattr__`` method; consult :ref:`the language reference <attribute-access>` for more information about controlling attribute access.
zh_cn: 在这里 ``UpperOut`` 类重新定义了 ``write()`` 方法在调用下层的 ``self._outfile.write()`` 方法之前将参数字符串转换为大写形式。 所有其他方法都被委托给下层的 ``self._outfile`` 对象。 委托是通过 ``__getattr__`` 方法来完成的；请参阅 :ref:`语言参考 <attribute-access>` 了解有关控制属性访问的更多信息。

source: Note that for more general cases delegation can get trickier. When attributes must be set as well as retrieved, the class must define a :meth:`__setattr__` method too, and it must do so carefully. The basic implementation of :meth:`__setattr__` is roughly equivalent to the following::
zh_cn: 请注意对于更一般的情况来说，委托可能包含更多细节问题。 当某些属性既需要读取又需要设置时，类还必须定义 :meth:`__setattr__` 方法，并且这样做必须小心谨慎。 :meth:`__setattr__` 的基本实现大致相当于以下代码::

source: Most :meth:`__setattr__` implementations must modify ``self.__dict__`` to store local state for self without causing an infinite recursion.
zh_cn: 大多数 :meth:`__setattr__` 实现必须修改 ``self.__dict__`` 来为自身保存局部状态而又不至于造成无限递归。

source: How do I call a method defined in a base class from a derived class that overrides it?
es: ¿Cómo llamo a un método definido en una clase base, de una clase derivada que la sobreescribe?
zh_cn: 如何从覆盖基类的派生类调用基类中定义的方法?

source: Use the built-in :func:`super` function::
es: Utiliza la función integrada :func:`super`::
zh_cn: 使用内置的 :func:`super` 函数：

source: For version prior to 3.0, you may be using classic classes: For a class definition such as ``class Derived(Base): ...`` you can call method ``meth()`` defined in ``Base`` (or one of ``Base``'s base classes) as ``Base.meth(self, arguments...)``. Here, ``Base.meth`` is an unbound method, so you need to provide the ``self`` argument.
zh_cn: 对于 Python 3.0之前的版本，您可能正在使用经典类：对于诸如 ``class Derived(Base): ...`` 之类的类定义，可以将在 ``Base`` (或 ``Base`` 中的一个的基类）中定义的方法 ``meth()`` 调用为 ``Base.meth(self, arguments...)`` 。这里， ``Base.meth`` 是一个未绑定的方法，因此您需要提供 ``self`` 参数。

source: How can I organize my code to make it easier to change the base class?
es: ¿Cómo organizar mi código para hacer más simple el cambio de la clase base?
zh_cn: 如何组织代码以便更改基类？

source: You could define an alias for the base class, assign the real base class to it before your class definition, and use the alias throughout your class. Then all you have to change is the value assigned to the alias. Incidentally, this trick is also handy if you want to decide dynamically (e.g. depending on availability of resources) which base class to use. Example::
zh_cn: 可以为基类定义别名，在类定义之前为其分配实际基类，并在整个类中使用别名。然后更改分配给别名的值，就能实现上述要求。顺便提一下，如果你想动态决定（例如，取决于资源的可用性）要使用哪个基类，这个技巧也很方便。例如：

source: How do I create static class data and static class methods?
es: ¿Cómo creo una clase estática de datos y métodos estáticos de clase?
zh_cn: 如何创建静态类数据和静态类方法？

source: Both static data and static methods (in the sense of C++ or Java) are supported in Python.
es: Ambos, datos estáticos y métodos estáticos (pensando en C++ o Java), son soportados en Python
zh_cn: Python支持静态数据和静态方法（在C ++或Java的意义上）。

source: For static data, simply define a class attribute. To assign a new value to the attribute, you have to explicitly use the class name in the assignment::
zh_cn: 对于静态数据，只需定义一个类属性。要为属性分配新值，就必须在赋值中显式使用类名：

source: ``c.count`` also refers to ``C.count`` for any ``c`` such that ``isinstance(c, C)`` holds, unless overridden by ``c`` itself or by some class on the base-class search path from ``c.__class__`` back to ``C``.
zh_cn: 对于任意 ``c`` 来说只要 ``isinstance(c, C)`` 为真，则 ``c.count`` 同样也指向 ``C.count``，除非被 ``c`` 自身，或者从 ``c.__class__`` 回到 ``C`` 的基类搜索路径上的某个类所重载。
