Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/using/configure.po
Languages: uk

source: The :c:macro:`PyAPI_FUNC()`, :c:macro:`PyAPI_API()` and :c:macro:`PyMODINIT_FUNC()` macros of :file:`Include/pyport.h` are defined differently depending if the ``Py_BUILD_CORE_MODULE`` macro is defined:
uk: Макроси :c:macro:`PyAPI_FUNC()`, :c:macro:`PyAPI_API()` та :c:macro:`PyMODINIT_FUNC()` :file:`Include/pyport.h` визначаються по-різному залежно від того, чи визначено макрос ``Py_BUILD_CORE_MODULE``:

source: Use ``Py_EXPORTED_SYMBOL`` if the ``Py_BUILD_CORE_MODULE`` is defined
uk: Використовуйте ``Py_EXPORTED_SYMBOL``, якщо ``Py_BUILD_CORE_MODULE`` визначено

source: Use ``Py_IMPORTED_SYMBOL`` otherwise.
uk: В іншому випадку використовуйте ``Py_IMPORTED_SYMBOL``.

source: If the ``Py_BUILD_CORE_BUILTIN`` macro is used by mistake on a C extension built as a shared library, its ``PyInit_xxx()`` function is not exported, causing an :exc:`ImportError` on import.
uk: Якщо макрос ``Py_BUILD_CORE_BUILTIN`` використовується помилково в розширенні C, створеному як спільна бібліотека, його функція ``PyInit_xxx()`` не експортується, що спричиняє :exc:`ImportError` під час імпорту.

source: Compiler and linker flags
uk: Прапори компілятора та компонувальника

source: Options set by the ``./configure`` script and environment variables and used by ``Makefile``.
uk: Параметри, встановлені сценарієм ``./configure`` і змінними середовища та використовуються ``Makefile``.

source: Preprocessor flags
uk: Прапори препроцесора

source: Value of :envvar:`CPPFLAGS` variable passed to the ``./configure`` script.
uk: Значення змінної :envvar:`CPPFLAGS` передається до сценарію ``./configure``.

source: (Objective) C/C++ preprocessor flags, e.g. ``-I<include dir>`` if you have headers in a nonstandard directory ``<include dir>``.
uk: (Мета) Прапори препроцесора C/C++, напр. ``-I <include dir>``, якщо у вас є заголовки в нестандартному каталозі ``<include dir>``.

source: Both :envvar:`CPPFLAGS` and :envvar:`LDFLAGS` need to contain the shell's value for setup.py to be able to build extension modules using the directories specified in the environment variables.
uk: І :envvar:`CPPFLAGS`, і :envvar:`LDFLAGS` повинні містити значення оболонки для setup.py, щоб мати можливість створювати модулі розширення за допомогою каталогів, указаних у змінних середовища.

source: Extra preprocessor flags added for building the interpreter object files.
uk: Для побудови об’єктних файлів інтерпретатора додано додаткові позначки препроцесора.

source: Default: ``$(BASECPPFLAGS) -I. -I$(srcdir)/Include $(CONFIGURE_CPPFLAGS) $(CPPFLAGS)``.
uk: Типове значення: ``$(BASECPPFLAGS) -I. -I$(srcdir)/Включити $(CONFIGURE_CPPFLAGS) $(CPPFLAGS)``.

source: Compiler flags
uk: Прапори компілятора

source: C compiler command.
uk: Команда компілятора C.

source: Example: ``gcc -pthread``.
uk: Приклад: ``gcc -pthread``.

source: C++ compiler command.
uk: Команда компілятора C++.

source: Example: ``g++ -pthread``.
uk: Приклад: ``g++ -pthread``.

source: C compiler flags.
uk: Прапори компілятора C.

source: :envvar:`CFLAGS_NODIST` is used for building the interpreter and stdlib C extensions. Use it when a compiler flag should *not* be part of the distutils :envvar:`CFLAGS` once Python is installed (:issue:`21121`).
uk: :envvar:`CFLAGS_NODIST` використовується для створення інтерпретатора та розширень stdlib C. Використовуйте його, коли прапор компілятора *не* повинен бути частиною distutils :envvar:`CFLAGS` після встановлення Python (:issue:`21121`).

source: Extra C compiler flags.
uk: Додаткові позначки компілятора C.

source: Value of :envvar:`CFLAGS` variable passed to the ``./configure`` script.
uk: Значення змінної :envvar:`CFLAGS` передається до сценарію ``./configure``.

source: Value of :envvar:`CFLAGS_NODIST` variable passed to the ``./configure`` script.
uk: Значення змінної :envvar:`CFLAGS_NODIST` передається до сценарію ``./configure``.

source: Base compiler flags.
uk: Базові прапори компілятора.

source: Optimization flags.
uk: Прапори оптимізації.

source: Strict or non-strict aliasing flags used to compile ``Python/dtoa.c``.
uk: Суворі або нестрогі прапорці псевдонімів, які використовуються для компіляції ``Python/dtoa.c``.

source: Compiler flags used to build a shared library.
uk: Прапори компілятора, які використовуються для створення спільної бібліотеки.

source: For example, ``-fPIC`` is used on Linux and on BSD.
uk: Наприклад, ``-fPIC`` використовується в Linux і BSD.

source: Extra C flags added for building the interpreter object files.
uk: Для побудови об’єктних файлів інтерпретатора додано додаткові позначки C.

source: Default: ``$(CCSHARED)`` when :option:`--enable-shared` is used, or an empty string otherwise.
uk: Типове значення: ``$(CCSHARED)``, коли :option:`--enable-shared` використовується, або порожній рядок в інших випадках.

source: Default: ``$(BASECFLAGS) $(OPT) $(CONFIGURE_CFLAGS) $(CFLAGS) $(EXTRA_CFLAGS)``.
uk: Типове значення: ``$(BASECFLAGS) $(OPT) $(CONFIGURE_CFLAGS) $(CFLAGS) $(EXTRA_CFLAGS)``.

source: Default: ``$(CONFIGURE_CFLAGS_NODIST) $(CFLAGS_NODIST) -I$(srcdir)/Include/internal``.
uk: Типове значення: ``$(CONFIGURE_CFLAGS_NODIST) $(CFLAGS_NODIST) -I$(srcdir)/Include/internal``.

source: C flags used for building the interpreter object files.
uk: Прапорці C, які використовуються для побудови об'єктних файлів інтерпретатора.

source: Default: ``$(PY_CFLAGS) $(PY_CFLAGS_NODIST) $(PY_CPPFLAGS) $(CFLAGSFORSHARED)``.
uk: Типове значення: ``$(PY_CFLAGS) $(PY_CFLAGS_NODIST) $(PY_CPPFLAGS) $(CFLAGSFORSHARED)``.

source: Default: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE``.
uk: Типове значення: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE``.

source: Compiler flags to build a standard library extension module as a built-in module, like the :mod:`posix` module.
uk: Прапори компілятора для створення стандартного модуля розширення бібліотеки як вбудованого модуля, як-от модуль :mod:`posix`.

source: Default: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE_BUILTIN``.
uk: Типове значення: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE_BUILTIN``.

source: Purify command. Purify is a memory debugger program.
uk: Команда очищення. Purify — це програма для налагодження пам'яті.

source: Default: empty string (not used).
uk: За замовчуванням: порожній рядок (не використовується).

source: Linker flags
uk: Прапори компонувальника

source: Linker command used to build programs like ``python`` and ``_testembed``.
uk: Команда компонувальника, яка використовується для створення таких програм, як ``python`` і ``_testembed``.

source: Value of :envvar:`LDFLAGS` variable passed to the ``./configure`` script.
uk: Значення змінної :envvar:`LDFLAGS` передається до сценарію ``./configure``.

source: Avoid assigning :envvar:`CFLAGS`, :envvar:`LDFLAGS`, etc. so users can use them on the command line to append to these values without stomping the pre-set values.
uk: Уникайте призначення :envvar:`CFLAGS`, :envvar:`LDFLAGS` тощо, щоб користувачі могли використовувати їх у командному рядку для додавання до цих значень без порушення попередньо встановлених значень.

source: :envvar:`LDFLAGS_NODIST` is used in the same manner as :envvar:`CFLAGS_NODIST`. Use it when a linker flag should *not* be part of the distutils :envvar:`LDFLAGS` once Python is installed (:issue:`35257`).
uk: :envvar:`LDFLAGS_NODIST` використовується так само, як :envvar:`CFLAGS_NODIST`. Використовуйте його, коли прапор компонувальника *не* повинен бути частиною distutils :envvar:`LDFLAGS` після встановлення Python (:issue:`35257`).

source: Value of :envvar:`LDFLAGS_NODIST` variable passed to the ``./configure`` script.
uk: Значення змінної :envvar:`LDFLAGS_NODIST` передається до сценарію ``./configure``.

source: Linker flags, e.g. ``-L<lib dir>`` if you have libraries in a nonstandard directory ``<lib dir>``.
uk: Прапори компонування, напр. ``-L <lib dir>``, якщо у вас є бібліотеки в нестандартному каталозі ``<lib dir>``.

source: Linker flags to pass libraries to the linker when linking the Python executable.
uk: Прапорці компонувальника для передачі бібліотек компонувальнику під час компонування виконуваного файлу Python.

source: Example: ``-lrt``.
uk: Приклад: ``-lrt``.

source: Command to build a shared library.
uk: Команда для створення спільної бібліотеки.

source: Default: ``@LDSHARED@ $(PY_LDFLAGS)``.
uk: Типове значення: ``@LDSHARED@ $(PY_LDFLAGS)``.

source: Command to build ``libpython`` shared library.
uk: Команда для створення спільної бібліотеки ``libpython``.

source: Default: ``@BLDSHARED@ $(PY_CORE_LDFLAGS)``.
uk: За замовчуванням: ``@BLDSHARED@ $(PY_CORE_LDFLAGS)``.

source: Default: ``$(CONFIGURE_LDFLAGS) $(LDFLAGS)``.
uk: Типове значення: ``$(CONFIGURE_LDFLAGS) $(LDFLAGS)``.

source: Default: ``$(CONFIGURE_LDFLAGS_NODIST) $(LDFLAGS_NODIST)``.
uk: Типове значення: ``$(CONFIGURE_LDFLAGS_NODIST) $(LDFLAGS_NODIST)``.

source: Linker flags used for building the interpreter object files.
uk: Прапори компонувальника, які використовуються для створення файлів об’єктів інтерпретатора.
