Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/using/configure.po
Languages: uk

source: Configure Python
uk: Налаштувати Python

source: Configure Options
uk: Налаштувати параметри

source: List all ``./configure`` script options using::
uk: Перелічіть усі параметри сценарію ``./configure`` за допомогою::

source: See also the :file:`Misc/SpecialBuilds.txt` in the Python source distribution.
uk: Дивіться також :file:`Misc/SpecialBuilds.txt` у вихідному дистрибутиві Python.

source: General Options
uk: Загальні параметри

source: Support loadable extensions in the :mod:`_sqlite` extension module (default is no).
uk: Підтримка завантажуваних розширень у модулі розширення :mod:`_sqlite` (за замовчуванням ні).

source: See the :meth:`sqlite3.Connection.enable_load_extension` method of the :mod:`sqlite3` module.
uk: Перегляньте метод :meth:`sqlite3.Connection.enable_load_extension` модуля :mod:`sqlite3`.

source: Disable IPv6 support (enabled by default if supported), see the :mod:`socket` module.
uk: Вимкніть підтримку IPv6 (увімкнено за замовчуванням, якщо підтримується), перегляньте модуль :mod:`socket`.

source: Define the size in bits of Python :class:`int` digits: 15 or 30 bits.
uk: Визначте розмір у бітах цифр Python :class:`int`: 15 або 30 біт.

source: Define the ``PYLONG_BITS_IN_DIGIT`` to ``15`` or ``30``.
uk: Визначте ``PYLONG_BITS_IN_DIGIT`` як ``15`` або ``30``.

source: See :data:`sys.int_info.bits_per_digit <sys.int_info>`.
uk: Див. :data:`sys.int_info.bits_per_digit <sys.int_info>`.

source: Set the Python executable suffix to *SUFFIX*.
uk: Установіть для виконуваного файлу Python суфікс *SUFFIX*.

source: Select the default time zone search path for :data:`zoneinfo.TZPATH`. See the :ref:`Compile-time configuration <zoneinfo_data_compile_time_config>` of the :mod:`zoneinfo` module.
uk: Виберіть шлях пошуку часового поясу за умовчанням для :data:`zoneinfo.TZPATH`. Перегляньте :ref:`конфігурацію під час компіляції <zoneinfo_data_compile_time_config>` модуля :mod:`zoneinfo`.

source: Default: ``/usr/share/zoneinfo:/usr/lib/zoneinfo:/usr/share/lib/zoneinfo:/etc/zoneinfo``.
uk: За замовчуванням: ``/usr/share/zoneinfo:/usr/lib/zoneinfo:/usr/share/lib/zoneinfo:/etc/zoneinfo``.

source: See :data:`os.pathsep` path separator.
uk: Дивіться роздільник шляхів :data:`os.pathsep`.

source: Build the ``_decimal`` extension module using a thread-local context rather than a coroutine-local context (default), see the :mod:`decimal` module.
uk: Створіть модуль розширення ``_decimal``, використовуючи локальний контекст потоку, а не локальний контекст співпрограми (за замовчуванням), дивіться модуль :mod:`decimal`.

source: See :data:`decimal.HAVE_CONTEXTVAR` and the :mod:`contextvars` module.
uk: Перегляньте :data:`decimal.HAVE_CONTEXTVAR` і модуль :mod:`contextvars`.

source: Override order to check db backends for the :mod:`dbm` module
uk: Порядок перевизначення, щоб перевірити серверні частини бази даних для модуля :mod:`dbm`

source: A valid value is a colon (``:``) separated string with the backend names:
uk: Дійсним значенням є розділений двокрапкою (``:``) рядок із іменами серверної частини:

source: Disable C locale coercion to a UTF-8 based locale (enabled by default).
uk: Вимкнути приведення локалі C до локалі на основі UTF-8 (увімкнено за умовчанням).

source: Don't define the ``PY_COERCE_C_LOCALE`` macro.
uk: Не визначайте макрос ``PY_COERCE_C_LOCALE``.

source: See :envvar:`PYTHONCOERCECLOCALE` and the :pep:`538`.
uk: Перегляньте :envvar:`PYTHONCOERCECLOCALE` і :pep:`538`.

source: Python library directory name (default is ``lib``).
uk: Ім’я каталогу бібліотеки Python (за замовчуванням – ``lib``).

source: Fedora and SuSE use ``lib64`` on 64-bit platforms.
uk: Fedora та SuSE використовують ``lib64`` на 64-розрядних платформах.

source: See :data:`sys.platlibdir`.
uk: Перегляньте :data:`sys.platlibdir`.

source: Directory of wheel packages used by the :mod:`ensurepip` module (none by default).
uk: Каталог пакетів коліс, які використовуються модулем :mod:`ensurepip` (за умовчанням немає).

source: Some Linux distribution packaging policies recommend against bundling dependencies. For example, Fedora installs wheel packages in the ``/usr/share/python-wheels/`` directory and don't install the :mod:`ensurepip._bundled` package.
uk: Деякі політики упаковки дистрибутивів Linux рекомендують не об’єднувати залежності. Наприклад, Fedora встановлює пакунки коліс у каталог ``/usr/share/python-wheels/`` і не встановлює пакунок :mod:`ensurepip._bundled`.

source: Install Options
uk: Параметри встановлення

source: Don't build nor install test modules, like the :mod:`test` package or the :mod:`_testcapi` extension module (built and installed by default).
uk: Не створюйте та не встановлюйте тестові модулі, наприклад пакет :mod:`test` або модуль розширення :mod:`_testcapi` (створений і встановлений за замовчуванням).

source: Select the :mod:`ensurepip` command run on Python installation:
uk: Виберіть команду :mod:`ensurepip`, запущену під час встановлення Python:

source: ``upgrade`` (default): run ``python -m ensurepip --altinstall --upgrade`` command.
uk: ``оновлення`` (за замовчуванням): запустіть команду ``python -m securepip --altinstall --upgrade``.

source: ``install``: run ``python -m ensurepip --altinstall`` command;
uk: ``встановити``: запустіть команду ``python -m securepip --altinstall``;

source: ``no``: don't run ensurepip;
uk: ``ні``: не запускати securepip;

source: Performance options
uk: Параметри виконання

source: Enable Profile Guided Optimization (PGO) using :envvar:`PROFILE_TASK` (disabled by default).
uk: Увімкніть керовану оптимізацію профілю (PGO) за допомогою :envvar:`PROFILE_TASK` (вимкнено за умовчанням).

source: The C compiler Clang requires ``llvm-profdata`` program for PGO. On macOS, GCC also requires it: GCC is just an alias to Clang on macOS.
uk: Компілятор C Clang вимагає програми ``llvm-profdata`` для PGO. У macOS GCC також вимагає цього: GCC — це просто псевдонім Clang у macOS.

source: Disable also semantic interposition in libpython if ``--enable-shared`` and GCC is used: add ``-fno-semantic-interposition`` to the compiler and linker flags.
uk: Вимкніть також семантичне вставлення в libpython, якщо ``--enable-shared`` і GCC використовуються: додайте ``-fno-semantic-interposition`` до позначок компілятора та компонувальника.

source: Use ``-fno-semantic-interposition`` on GCC.
uk: Використовуйте ``-fno-semantic-interposition`` на GCC.

source: Environment variable used in the Makefile: Python command line arguments for the PGO generation task.
uk: Змінна середовища, яка використовується в Makefile: аргументи командного рядка Python для завдання створення PGO.

source: Default: ``-m test --pgo --timeout=$(TESTTIMEOUT)``.
uk: За замовчуванням: ``-m test --pgo --timeout=$(TESTTIMEOUT)``.

source: Enable Link Time Optimization (LTO) in any build (disabled by default).
uk: Увімкніть оптимізацію часу підключення (LTO) у будь-якій збірці (за умовчанням вимкнено).

source: The C compiler Clang requires ``llvm-ar`` for LTO (``ar`` on macOS), as well as an LTO-aware linker (``ld.gold`` or ``lld``).
uk: Для компілятора C Clang потрібен ``llvm-ar`` для LTO (``ar`` для macOS), а також компонувальник, що підтримує LTO (``ld.gold`` або ``lld``).

source: Enable computed gotos in evaluation loop (enabled by default on supported compilers).
uk: Увімкнути обчислені gotos у циклі оцінки (увімкнено за замовчуванням у підтримуваних компіляторах).

source: Disable the specialized Python memory allocator :ref:`pymalloc <pymalloc>` (enabled by default).
uk: Вимкніть спеціалізований розподільник пам’яті Python :ref:`pymalloc <pymalloc>` (увімкнено за замовчуванням).

source: See also :envvar:`PYTHONMALLOC` environment variable.
uk: Дивіться також змінну середовища :envvar:`PYTHONMALLOC`.

source: Disable static documentation strings to reduce the memory footprint (enabled by default). Documentation strings defined in Python are not affected.
uk: Вимкніть статичні рядки документації, щоб зменшити обсяг пам’яті (увімкнено за замовчуванням). Це не впливає на рядки документації, визначені в Python.

source: Don't define the ``WITH_DOC_STRINGS`` macro.
uk: Не визначайте макрос ``WITH_DOC_STRINGS``.

source: See the ``PyDoc_STRVAR()`` macro.
uk: Перегляньте макрос ``PyDoc_STRVAR()``.

source: Enable C-level code profiling with ``gprof`` (disabled by default).
uk: Увімкніть профілювання коду рівня C за допомогою ``gprof`` (вимкнено за умовчанням).

source: Python Debug Build
uk: Збірка налагодження Python

source: A debug build is Python built with the :option:`--with-pydebug` configure option.
uk: Збірка для налагодження — це Python, створений із параметром налаштування :option:`--with-pydebug`.

source: Effects of a debug build:
uk: Наслідки збірки налагодження:

source: Display all warnings by default: the list of default warning filters is empty in the :mod:`warnings` module.
uk: Відображати всі попередження за замовчуванням: список стандартних фільтрів попереджень порожній у модулі :mod:`warnings`.

source: Add ``d`` to :data:`sys.abiflags`.
uk: Додайте ``d`` до :data:`sys.abiflags`.

source: Add :func:`sys.gettotalrefcount` function.
uk: Додайте функцію :func:`sys.gettotalrefcount`.

source: Add :option:`-X showrefcount <-X>` command line option.
uk: Додайте параметр командного рядка :option:`-X showrefcount <-X>`.

source: Install :ref:`debug hooks on memory allocators <default-memory-allocators>` to detect buffer overflow and other memory errors.
uk: Встановіть :ref:`debug хуки на розподільники пам’яті <default-memory-allocators>`, щоб виявити переповнення буфера та інші помилки пам’яті.

source: Define ``Py_DEBUG`` and ``Py_REF_DEBUG`` macros.
uk: Визначте макроси ``Py_DEBUG`` і ``Py_REF_DEBUG``.

source: Add sanity checks on the function arguments.
uk: Додайте перевірку правильності аргументів функції.

source: Unicode and int objects are created with their memory filled with a pattern to detect usage of uninitialized objects.
uk: Об’єкти Unicode та int створюються з пам’яттю, заповненою шаблоном для виявлення використання неініціалізованих об’єктів.

source: Ensure that functions which can clear or replace the current exception are not called with an exception raised.
uk: Переконайтеся, що функції, які можуть очистити або замінити поточний виняток, не викликаються з викликом виключення.

source: The garbage collector (:func:`gc.collect` function) runs some basic checks on objects consistency.
uk: Збирач сміття (:func:`gc.collect` функція) запускає деякі базові перевірки узгодженості об’єктів.

source: The :c:macro:`Py_SAFE_DOWNCAST()` macro checks for integer underflow and overflow when downcasting from wide types to narrow types.
uk: Макрос :c:macro:`Py_SAFE_DOWNCAST()` перевіряє цілочисельне переповнення та переповнення під час переходу від широких типів до вузьких.

source: See also the :ref:`Python Development Mode <devmode>` and the :option:`--with-trace-refs` configure option.
uk: Дивіться також :ref:`Режим розробки Python <devmode>` і параметр налаштування :option:`--with-trace-refs`.

source: Release builds and debug builds are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro (see the :option:`--with-trace-refs` option), which introduces the only ABI incompatibility.
uk: Збірки випусків і збірки для налагодження тепер сумісні з ABI: визначення макросу ``Py_DEBUG`` більше не передбачає макрос ``Py_TRACE_REFS`` (див. параметр :option:`--with-trace-refs`), який вводить єдиний Несумісність ABI.

source: Debug options
uk: Параметри налагодження

source: :ref:`Build Python in debug mode <debug-build>`: define the ``Py_DEBUG`` macro (disabled by default).
uk: :ref:`Збірка Python у режимі налагодження <debug-build>`: визначте макрос ``Py_DEBUG`` (вимкнено за замовчуванням).

source: Enable tracing references for debugging purpose (disabled by default).
uk: Увімкнути посилання на трасування для налагодження (вимкнено за умовчанням).

source: Effects:
uk: Ефекти:

source: Define the ``Py_TRACE_REFS`` macro.
uk: Визначте макрос ``Py_TRACE_REFS``.

source: Add :func:`sys.getobjects` function.
uk: Додайте функцію :func:`sys.getobjects`.

source: Add :envvar:`PYTHONDUMPREFS` environment variable.
uk: Додайте змінну середовища :envvar:`PYTHONDUMPREFS`.

source: This build is not ABI compatible with release build (default build) or debug build (``Py_DEBUG`` and ``Py_REF_DEBUG`` macros).
uk: Ця збірка не сумісна з ABI зі збіркою випуску (складання за замовчуванням) або збіркою налагодження (макроси ``Py_DEBUG`` і ``Py_REF_DEBUG``).

source: Build with C assertions enabled (default is no): ``assert(...);`` and ``_PyObject_ASSERT(...);``.
uk: Збірка з увімкненими твердженнями C (за замовчуванням ні): ``assert(...);`` і ``_PyObject_ASSERT(...);``.

source: If set, the ``NDEBUG`` macro is not defined in the :envvar:`OPT` compiler variable.
uk: Якщо встановлено, макрос ``NDEBUG`` не визначено в змінній компілятора :envvar:`OPT`.

source: See also the :option:`--with-pydebug` option (:ref:`debug build <debug-build>`) which also enables assertions.
uk: Дивіться також опцію :option:`--with-pydebug` (:ref:`debug build <debug-build>`), яка також вмикає твердження.

source: Enable Valgrind support (default is no).
uk: Увімкнути підтримку Valgrind (за замовчуванням ні).

source: Enable DTrace support (default is no).
uk: Увімкнути підтримку DTrace (за замовчуванням ні).

source: See :ref:`Instrumenting CPython with DTrace and SystemTap <instrumentation>`.
uk: Перегляньте :ref:`Інструментування CPython за допомогою DTrace і SystemTap <instrumentation>`.

source: Enable AddressSanitizer memory error detector, ``asan`` (default is no).
uk: Увімкнути детектор помилок пам’яті AddressSanitizer, ``asan`` (за умовчанням ні).

source: Enable MemorySanitizer allocation error detector, ``msan`` (default is no).
uk: Увімкнути детектор помилок розподілу MemorySanitizer, ``msan`` (за умовчанням ні).

source: Enable UndefinedBehaviorSanitizer undefined behaviour detector, ``ubsan`` (default is no).
uk: Увімкнути невизначений детектор поведінки UndefinedBehaviorSanitizer, ``ubsan`` (за умовчанням ні).

source: Linker options
uk: Параметри компонувальника

source: Enable building a shared Python library: ``libpython`` (default is no).
uk: Увімкнути створення спільної бібліотеки Python: ``libpython`` (за замовчуванням ні).

source: Do not build ``libpythonMAJOR.MINOR.a`` and do not install ``python.o`` (built and enabled by default).
uk: Не створюйте ``libpythonMAJOR.MINOR.a`` і не встановлюйте ``python.o`` (зібрано та ввімкнено за замовчуванням).

source: Libraries options
uk: Параметри бібліотек

source: Link against additional libraries (default is no).
uk: Посилання на додаткові бібліотеки (за замовчуванням ні).

source: Build the :mod:`pyexpat` module using an installed ``expat`` library (default is no).
uk: Зберіть модуль :mod:`pyexpat` за допомогою встановленої бібліотеки ``expat`` (за замовчуванням ні).

source: Build the ``_decimal`` extension module using an installed ``mpdec`` library, see the :mod:`decimal` module (default is no).
uk: Створіть модуль розширення ``_decimal`` за допомогою встановленої бібліотеки ``mpdec``, дивіться модуль :mod:`decimal` (за замовчуванням ні).

source: Use ``editline`` library for backend of the :mod:`readline` module.
uk: Використовуйте бібліотеку ``editline`` для серверної частини модуля :mod:`readline`.

source: Define the ``WITH_EDITLINE`` macro.
uk: Визначте макрос ``WITH_EDITLINE``.

source: Don't build the :mod:`readline` module (built by default).
uk: Не створюйте модуль :mod:`readline` (створено за замовчуванням).

source: Don't define the ``HAVE_LIBREADLINE`` macro.
uk: Не визначайте макрос ``HAVE_LIBREADLINE``.

source: Override ``libm`` math library to *STRING* (default is system-dependent).
uk: Замінити математичну бібліотеку ``libm`` на *STRING* (за замовчуванням залежить від системи).

source: Override ``libc`` C library to *STRING* (default is system-dependent).
uk: Замінити бібліотеку C ``libc`` на *STRING* (за замовчуванням залежить від системи).

source: Root of the OpenSSL directory.
uk: Корінь каталогу OpenSSL.

source: Set runtime library directory (rpath) for OpenSSL libraries:
uk: Встановити каталог бібліотеки середовища виконання (rpath) для бібліотек OpenSSL:

source: ``no`` (default): don't set rpath;
uk: ``ні`` (за замовчуванням): не встановлювати rpath;

source: ``auto``: auto-detect rpath from :option:`--with-openssl` and ``pkg-config``;
uk: ``auto``: автоматичне визначення rpath з :option:`--with-openssl` і ``pkg-config``;

source: *DIR*: set an explicit rpath.
uk: *DIR*: встановити явний rpath.

source: Security Options
uk: Параметри безпеки

source: Select hash algorithm for use in ``Python/pyhash.c``:
uk: Виберіть алгоритм хешування для використання в ``Python/pyhash.c``:

source: Built-in hash modules:
uk: Вбудовані хеш-модулі:

source: ``sha3`` (with shake);
uk: ``sha3`` (зі струшуванням);

source: Override the OpenSSL default cipher suites string:
uk: Перевизначте стандартний рядок наборів шифрів OpenSSL:

source: ``python`` (default): use Python's preferred selection;
uk: ``python`` (за замовчуванням): використовувати пріоритетний вибір Python;

source: ``openssl``: leave OpenSSL's defaults untouched;
uk: ``openssl``: залишити стандартні параметри OpenSSL без змін;

source: *STRING*: use a custom string
uk: *STRING*: використовуйте спеціальний рядок

source: See the :mod:`ssl` module.
uk: Перегляньте модуль :mod:`ssl`.

source: The settings ``python`` and *STRING* also set TLS 1.2 as minimum protocol version.
uk: Налаштування ``python`` і *STRING* також встановлюють TLS 1.2 як мінімальну версію протоколу.

source: macOS Options
uk: Параметри macOS

source: See ``Mac/README.rst``.
uk: Перегляньте ``Mac/README.rst``.

source: Create a universal binary build. *SDKDIR* specifies which macOS SDK should be used to perform the build (default is no).
uk: Створіть універсальну двійкову збірку. *SDKDIR* визначає, який macOS SDK слід використовувати для виконання збірки (за замовчуванням ні).

source: Create a Python.framework rather than a traditional Unix install. Optional *INSTALLDIR* specifies the installation path (default is no).
uk: Створіть Python.framework замість традиційної інсталяції Unix. Додатково *INSTALLDIR* визначає шлях інсталяції (за замовчуванням ні).

source: Specify the kind of universal binary that should be created. This option is only valid when :option:`--enable-universalsdk` is set.
uk: Укажіть тип універсального двійкового файлу, який потрібно створити. Цей параметр дійсний, лише якщо встановлено :option:`--enable-universalsdk`.

source: Options:
uk: Опції:

source: ``universal2``;
uk: ``універсальний2``;

source: ``32-bit``;
uk: ``32-розрядний``;

source: ``64-bit``;
uk: ``64-розрядний``;

source: ``3-way``;
uk: ``3-сторонній``;

source: ``all``.
uk: ``все``.

source: Specify the name for the python framework on macOS only valid when :option:`--enable-framework` is set (default: ``Python``).
uk: Укажіть назву для фреймворку python у macOS, дійсну лише тоді, коли встановлено :option:`--enable-framework` (за замовчуванням: ``Python``).

source: Python Build System
uk: Система збірки Python

source: Main files of the build system
uk: Основні файли системи збірки

source: :file:`Makefile.pre.in` => :file:`Makefile` (created by :file:`configure`);
uk: :file:`Makefile.pre.in` => :file:`Makefile` (створений :file:`configure`);

source: :file:`pyconfig.h` (created by :file:`configure`);
uk: :file:`pyconfig.h` (створений :file:`configure`);

source: :file:`Modules/Setup`: C extensions built by the Makefile using :file:`Module/makesetup` shell script;
uk: :file:`Modules/Setup`: розширення C, створені Makefile за допомогою сценарію оболонки :file:`Module/makesetup`;

source: Main build steps
uk: Основні етапи побудови

source: C files (``.c``) are built as object files (``.o``).
uk: Файли C (``.c``) створюються як об’єктні файли (``.o``).

source: A static ``libpython`` library (``.a``) is created from objects files.
uk: Статична бібліотека libpython (``.a``) створюється з файлів об’єктів.

source: ``python.o`` and the static ``libpython`` library are linked into the final ``python`` program.
uk: ``python.o`` і статична бібліотека ``libpython`` пов’язані в остаточну програму ``python``.

source: C extensions are built by the Makefile (see :file:`Modules/Setup`) and ``python setup.py build``.
uk: Розширення C створено за допомогою Makefile (див. :file:`Modules/Setup`) і ``python setup.py build``.

source: Main Makefile targets
uk: Основні цілі Makefile

source: ``make``: Build Python with the standard library.
uk: ``make``: Збірка Python зі стандартною бібліотекою.

source: ``make platform:``: build the ``python`` program, but don't build the standard library extension modules.
uk: ``make platform:``: створіть програму ``python``, але не створюйте стандартні модулі розширення бібліотеки.

source: ``make profile-opt``: build Python using Profile Guided Optimization (PGO). You can use the configure :option:`--enable-optimizations` option to make this the default target of the ``make`` command (``make all`` or just ``make``).
uk: ``make profile-opt``: створіть Python за допомогою Керованої оптимізації профілю (PGO). Ви можете використати опцію configure :option:`--enable-optimizations`, щоб зробити це типовим цільовою командою ``make`` (``make all`` або лише ``make``).

source: ``make buildbottest``: Build Python and run the Python test suite, the same way than buildbots test Python. Set ``TESTTIMEOUT`` variable (in seconds) to change the test timeout (1200 by default: 20 minutes).
uk: ``make buildbottest``: створіть Python і запустіть набір тестів Python так само, як buildbots тестують Python. Встановіть змінну ``TESTTIMEOUT`` (у секундах), щоб змінити час очікування тесту (1200 за замовчуванням: 20 хвилин).

source: ``make install``: Build and install Python.
uk: ``make install``: Створення та встановлення Python.

source: ``make regen-all``: Regenerate (almost) all generated files; ``make regen-stdlib-module-names`` and ``autoconf`` must be run separately for the remaining generated files.
uk: ``make regen-all``: повторно генерувати (майже) всі згенеровані файли; ``make regen-stdlib-module-names`` і ``autoconf`` потрібно запускати окремо для решти згенерованих файлів.

source: ``make clean``: Remove built files.
uk: ``make clean``: Видалити зібрані файли.

source: ``make distclean``: Same than ``make clean``, but remove also files created by the configure script.
uk: ``make distclean``: Те саме, що ``make clean``, але також видаляє файли, створені сценарієм конфігурації.

source: C extensions
uk: C розширення

source: Some C extensions are built as built-in modules, like the ``sys`` module. They are built with the ``Py_BUILD_CORE_BUILTIN`` macro defined. Built-in modules have no ``__file__`` attribute::
uk: Деякі розширення C створено як вбудовані модулі, як-от модуль ``sys``. Вони створені за допомогою визначеного макросу ``Py_BUILD_CORE_BUILTIN``. Вбудовані модулі не мають атрибута ``__file__``::

source: :file:`Modules/Setup` is used to generate Makefile targets to build C extensions. At the beginning of the files, C extensions are built as built-in modules. Extensions defined after the ``*shared*`` marker are built as dynamic libraries.
uk: :file:`Modules/Setup` використовується для створення цілей Makefile для створення розширень C. На початку файлів розширення C побудовані як вбудовані модулі. Розширення, визначені після маркера ``*shared*``, будуються як динамічні бібліотеки.

source: The :file:`setup.py` script only builds C extensions as shared libraries using the :mod:`distutils` module.
uk: Сценарій :file:`setup.py` створює лише розширення C як спільні бібліотеки за допомогою модуля :mod:`distutils`.
