Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/library/dbm.po
Languages: uk

source: :mod:`dbm` --- Interfaces to Unix "databases"
uk: :mod:`dbm` --- Інтерфейси до "баз даних" Unix

source: **Source code:** :source:`Lib/dbm/__init__.py`
uk: **Вихідний код:** :source:`Lib/dbm/__init__.py`

source: :mod:`dbm` is a generic interface to variants of the DBM database --- :mod:`dbm.gnu` or :mod:`dbm.ndbm`. If none of these modules is installed, the slow-but-simple implementation in module :mod:`dbm.dumb` will be used. There is a `third party interface <https://www.jcea.es/programacion/pybsddb.htm>`_ to the Oracle Berkeley DB.
uk: :mod:`dbm` — це загальний інтерфейс для варіантів бази даних DBM --- :mod:`dbm.gnu` або :mod:`dbm.ndbm`. Якщо жоден із цих модулів не встановлено, буде використано повільну, але просту реалізацію в модулі :mod:`dbm.dumb`. Існує `сторонній інтерфейс <https://www.jcea.es/programacion/pybsddb.htm>`_ для бази даних Oracle Berkeley.

source: A tuple containing the exceptions that can be raised by each of the supported modules, with a unique exception also named :exc:`dbm.error` as the first item --- the latter is used when :exc:`dbm.error` is raised.
uk: Кортеж, що містить винятки, які можуть бути викликані кожним із підтримуваних модулів, з унікальним винятком, який також називається :exc:`dbm.error` як перший елемент --- останній елемент використовується, коли :exc:`dbm.error` піднято.

source: This function attempts to guess which of the several simple database modules available --- :mod:`dbm.gnu`, :mod:`dbm.ndbm` or :mod:`dbm.dumb` --- should be used to open a given file.
uk: Ця функція намагається вгадати, який із кількох доступних простих модулів бази даних --- :mod:`dbm.gnu`, :mod:`dbm.ndbm` або :mod:`dbm.dumb` --- слід використовувати для відкриття заданий файл.

source: Returns one of the following values: ``None`` if the file can't be opened because it's unreadable or doesn't exist; the empty string (``''``) if the file's format can't be guessed; or a string containing the required module name, such as ``'dbm.ndbm'`` or ``'dbm.gnu'``.
uk: Повертає одне з таких значень: ``None``, якщо файл неможливо відкрити, тому що він нечитабельний або не існує; порожній рядок (``''``), якщо формат файлу неможливо вгадати; або рядок, що містить потрібну назву модуля, наприклад dbm.ndbm або dbm.gnu.

source: Open the database file *file* and return a corresponding object.
uk: Відкрийте файл бази даних *file* і поверніть відповідний об’єкт.

source: If the database file already exists, the :func:`whichdb` function is used to determine its type and the appropriate module is used; if it does not exist, the first module listed above that can be imported is used.
uk: Якщо файл бази даних уже існує, для визначення його типу використовується функція :func:`whichdb` і використовується відповідний модуль; якщо його не існує, використовується перший із перелічених вище модулів, який можна імпортувати.

source: The optional *flag* argument can be:
uk: Додатковий аргумент *flag* може бути:

source: Value
uk: Значення

source: Meaning
uk: Значення

source: Open existing database for reading only (default)
uk: Відкрити існуючу базу даних лише для читання (за замовчуванням)

source: Open existing database for reading and writing
uk: Відкрити існуючу базу даних для читання та запису

source: Open database for reading and writing, creating it if it doesn't exist
uk: Відкрити базу даних для читання та запису, створити її, якщо вона не існує

source: Always create a new, empty database, open for reading and writing
uk: Завжди створюйте нову порожню базу даних, відкриту для читання та запису

source: The optional *mode* argument is the Unix mode of the file, used only when the database has to be created. It defaults to octal ``0o666`` (and will be modified by the prevailing umask).
uk: Необов’язковий аргумент *mode* — це режим Unix файлу, який використовується лише тоді, коли потрібно створити базу даних. За замовчуванням він має вісімкове значення ``0o666`` (і буде змінено переважаючою umask).

source: The object returned by :func:`.open` supports the same basic functionality as dictionaries; keys and their corresponding values can be stored, retrieved, and deleted, and the :keyword:`in` operator and the :meth:`keys` method are available, as well as :meth:`get` and :meth:`setdefault`.
uk: Об’єкт, який повертає :func:`.open`, підтримує ту саму базову функціональність, що й словники; ключі та їхні відповідні значення можна зберігати, отримувати та видаляти, а також доступні оператор :keyword:`in` і метод :meth:`keys`, а також :meth:`get` і :meth:`setdefault`.

source: :meth:`get` and :meth:`setdefault` are now available in all database modules.
uk: :meth:`get` і :meth:`setdefault` тепер доступні в усіх модулях бази даних.

source: Deleting a key from a read-only database raises database module specific error instead of :exc:`KeyError`.
uk: Видалення ключа з бази даних, доступної лише для читання, викликає помилку конкретного модуля бази даних замість :exc:`KeyError`.

source: Key and values are always stored as bytes. This means that when strings are used they are implicitly converted to the default encoding before being stored.
uk: Ключі та значення завжди зберігаються як байти. Це означає, що коли рядки використовуються, вони неявно перетворюються на стандартне кодування перед збереженням.

source: These objects also support being used in a :keyword:`with` statement, which will automatically close them when done.
uk: Ці об’єкти також підтримують використання в операторі :keyword:`with`, який автоматично закриє їх після завершення.

source: Added native support for the context management protocol to the objects returned by :func:`.open`.
uk: Додано власну підтримку протоколу керування контекстом для об’єктів, які повертає :func:`.open`.

source: The following example records some hostnames and a corresponding title, and then prints out the contents of the database::
uk: У наступному прикладі записуються деякі імена хостів і відповідний заголовок, а потім друкується вміст бази даних:

source: Module :mod:`shelve`
uk: Модуль :mod:`shelve`

source: Persistence module which stores non-string data.
uk: Модуль постійності, який зберігає нерядкові дані.

source: The individual submodules are described in the following sections.
uk: Окремі субмодулі описані в наступних розділах.

source: :mod:`dbm.gnu` --- GNU's reinterpretation of dbm
uk: :mod:`dbm.gnu` --- GNU перетлумачує dbm

source: **Source code:** :source:`Lib/dbm/gnu.py`
uk: **Вихідний код:** :source:`Lib/dbm/gnu.py`

source: This module is quite similar to the :mod:`dbm` module, but uses the GNU library ``gdbm`` instead to provide some additional functionality. Please note that the file formats created by :mod:`dbm.gnu` and :mod:`dbm.ndbm` are incompatible.
uk: Цей модуль дуже схожий на модуль :mod:`dbm`, але замість нього використовується бібліотека GNU ``gdbm`` для надання деяких додаткових функцій. Зверніть увагу, що формати файлів, створені :mod:`dbm.gnu` і :mod:`dbm.ndbm`, несумісні.

source: The :mod:`dbm.gnu` module provides an interface to the GNU DBM library. ``dbm.gnu.gdbm`` objects behave like mappings (dictionaries), except that keys and values are always converted to bytes before storing. Printing a ``gdbm`` object doesn't print the keys and values, and the :meth:`items` and :meth:`values` methods are not supported.
uk: Модуль :mod:`dbm.gnu` надає інтерфейс до бібліотеки GNU DBM. Об’єкти ``dbm.gnu.gdbm`` поводяться як відображення (словники), за винятком того, що ключі та значення завжди перетворюються на байти перед збереженням. Друк об’єкта ``gdbm`` не друкує ключі та значення, а методи :meth:`items` і :meth:`values` не підтримуються.

source: Raised on :mod:`dbm.gnu`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
uk: Виникає через специфічні помилки :mod:`dbm.gnu`, такі як помилки введення/виведення. :exc:`KeyError` виникає для загальних помилок зіставлення, як-от введення неправильного ключа.

source: Open a ``gdbm`` database and return a :class:`gdbm` object. The *filename* argument is the name of the database file.
uk: Відкрийте базу даних ``gdbm`` і поверніть об’єкт :class:`gdbm`. Аргумент *ім’я_файлу* — це ім’я файлу бази даних.

source: The following additional characters may be appended to the flag to control how the database is opened:
uk: Наступні додаткові символи можуть бути додані до прапора, щоб керувати тим, як відкривається база даних:

source: Open the database in fast mode. Writes to the database will not be synchronized.
uk: Відкрийте базу даних у швидкому режимі. Записи в базу даних не будуть синхронізовані.

source: Synchronized mode. This will cause changes to the database to be immediately written to the file.
uk: Синхронізований режим. Це призведе до негайного запису змін до бази даних у файл.

source: Do not lock database.
uk: Не блокуйте базу даних.

source: Not all flags are valid for all versions of ``gdbm``. The module constant :const:`open_flags` is a string of supported flag characters. The exception :exc:`error` is raised if an invalid flag is specified.
uk: Не всі позначки дійсні для всіх версій ``gdbm``. Константа модуля :const:`open_flags` — це рядок підтримуваних символів прапорців. Виняток :exc:`error` виникає, якщо вказано недійсний прапор.

source: The optional *mode* argument is the Unix mode of the file, used only when the database has to be created. It defaults to octal ``0o666``.
uk: Необов’язковий аргумент *mode* — це режим Unix файлу, який використовується лише тоді, коли потрібно створити базу даних. За замовчуванням він має вісімкове значення ``0o666``.

source: In addition to the dictionary-like methods, ``gdbm`` objects have the following methods:
uk: Окрім словникових методів, об’єкти ``gdbm`` мають такі методи:

source: It's possible to loop over every key in the database using this method and the :meth:`nextkey` method. The traversal is ordered by ``gdbm``'s internal hash values, and won't be sorted by the key values. This method returns the starting key.
uk: За допомогою цього методу та методу :meth:`nextkey` можна перейти до кожного ключа в базі даних. Обхід упорядковується за внутрішніми хеш-значеннями ``gdbm`` і не буде відсортований за значеннями ключа. Цей метод повертає початковий ключ.

source: Returns the key that follows *key* in the traversal. The following code prints every key in the database ``db``, without having to create a list in memory that contains them all::
uk: Повертає ключ, який слідує за *key* під час обходу. Наступний код друкує кожен ключ у базі даних ``db`` без необхідності створювати в пам’яті список, який містить їх усі:

source: If you have carried out a lot of deletions and would like to shrink the space used by the ``gdbm`` file, this routine will reorganize the database. ``gdbm`` objects will not shorten the length of a database file except by using this reorganization; otherwise, deleted file space will be kept and reused as new (key, value) pairs are added.
uk: Якщо ви виконали багато видалень і бажаєте зменшити простір, який використовується файлом ``gdbm``, ця процедура реорганізує базу даних. Об’єкти ``gdbm`` не скоротять довжину файлу бази даних, за винятком використання цієї реорганізації; інакше видалений файловий простір буде збережено та повторно використано, коли додаватимуться нові пари (ключ, значення).

source: When the database has been opened in fast mode, this method forces any unwritten data to be written to the disk.
uk: Коли базу даних відкрито у швидкому режимі, цей метод примусово записує на диск будь-які незаписані дані.

source: Close the ``gdbm`` database.
uk: Закрийте базу даних ``gdbm``.

source: :mod:`dbm.ndbm` --- Interface based on ndbm
uk: :mod:`dbm.ndbm` --- Інтерфейс на основі ndbm

source: **Source code:** :source:`Lib/dbm/ndbm.py`
uk: **Вихідний код:** :source:`Lib/dbm/ndbm.py`

source: The :mod:`dbm.ndbm` module provides an interface to the Unix "(n)dbm" library. Dbm objects behave like mappings (dictionaries), except that keys and values are always stored as bytes. Printing a ``dbm`` object doesn't print the keys and values, and the :meth:`items` and :meth:`values` methods are not supported.
uk: Модуль :mod:`dbm.ndbm` забезпечує інтерфейс до бібліотеки Unix "(n)dbm". Об’єкти Dbm поводяться як зіставлення (словники), за винятком того, що ключі та значення завжди зберігаються як байти. Друк об’єкта ``dbm`` не друкує ключі та значення, а методи :meth:`items` і :meth:`values` не підтримуються.

source: This module can be used with the "classic" ndbm interface or the GNU GDBM compatibility interface. On Unix, the :program:`configure` script will attempt to locate the appropriate header file to simplify building this module.
uk: Цей модуль можна використовувати з "класичним" інтерфейсом ndbm або інтерфейсом сумісності GNU GDBM. В Unix сценарій :program:`configure` намагатиметься знайти відповідний файл заголовка, щоб спростити створення цього модуля.

source: Raised on :mod:`dbm.ndbm`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
uk: Виникає через :mod:`dbm.ndbm`-специфічні помилки, такі як помилки введення/виведення. :exc:`KeyError` виникає для загальних помилок зіставлення, як-от введення неправильного ключа.

source: Name of the ``ndbm`` implementation library used.
uk: Назва використаної бібліотеки реалізації ``ndbm``.

source: Open a dbm database and return a ``ndbm`` object. The *filename* argument is the name of the database file (without the :file:`.dir` or :file:`.pag` extensions).
uk: Відкрийте базу даних dbm і поверніть об’єкт ``ndbm``. Аргумент *filename* — це ім’я файлу бази даних (без розширень :file:`.dir` або :file:`.pag`).

source: The optional *flag* argument must be one of these values:
uk: Необов’язковий аргумент *flag* має мати одне з цих значень:

source: In addition to the dictionary-like methods, ``ndbm`` objects provide the following method:
uk: На додаток до методів, подібних до словника, об’єкти ``ndbm`` забезпечують наступний метод:

source: Close the ``ndbm`` database.
uk: Закрийте базу даних ``ndbm``.

source: :mod:`dbm.dumb` --- Portable DBM implementation
uk: :mod:`dbm.dumb` --- Переносна реалізація DBM

source: **Source code:** :source:`Lib/dbm/dumb.py`
uk: **Вихідний код:** :source:`Lib/dbm/dumb.py`

source: The :mod:`dbm.dumb` module is intended as a last resort fallback for the :mod:`dbm` module when a more robust module is not available. The :mod:`dbm.dumb` module is not written for speed and is not nearly as heavily used as the other database modules.
uk: Модуль :mod:`dbm.dumb` призначений як остання альтернатива для модуля :mod:`dbm`, коли більш надійний модуль недоступний. Модуль :mod:`dbm.dumb` не створений для швидкості і використовується не так активно, як інші модулі бази даних.

source: The :mod:`dbm.dumb` module provides a persistent dictionary-like interface which is written entirely in Python. Unlike other modules such as :mod:`dbm.gnu` no external library is required. As with other persistent mappings, the keys and values are always stored as bytes.
uk: Модуль :mod:`dbm.dumb` забезпечує постійний інтерфейс, схожий на словник, який повністю написаний мовою Python. На відміну від інших модулів, таких як :mod:`dbm.gnu`, зовнішня бібліотека не потрібна. Як і в інших постійних відображеннях, ключі та значення завжди зберігаються як байти.

source: The module defines the following:
uk: Модуль визначає наступне:

source: Raised on :mod:`dbm.dumb`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
uk: Виникає через :mod:`dbm.dumb`-специфічні помилки, такі як помилки введення/виведення. :exc:`KeyError` виникає для загальних помилок зіставлення, як-от введення неправильного ключа.

source: Open a ``dumbdbm`` database and return a dumbdbm object. The *filename* argument is the basename of the database file (without any specific extensions). When a dumbdbm database is created, files with :file:`.dat` and :file:`.dir` extensions are created.
uk: Відкрийте базу даних ``dumbdbm`` і поверніть об’єкт dumbdbm. Аргумент *ім’я_файлу* є базовим ім’ям файлу бази даних (без будь-яких конкретних розширень). Коли створюється база даних dumbdbm, створюються файли з розширеннями :file:`.dat` і :file:`.dir`.

source: It is possible to crash the Python interpreter when loading a database with a sufficiently large/complex entry due to stack depth limitations in Python's AST compiler.
uk: Можливий збій інтерпретатора Python під час завантаження бази даних із достатньо великим/складним записом через обмеження глибини стеку в компіляторі AST Python.

source: :func:`.open` always creates a new database when the flag has the value ``'n'``.
uk: :func:`.open` завжди створює нову базу даних, якщо прапорець має значення ``'n'``.

source: A database opened with flags ``'r'`` is now read-only. Opening with flags ``'r'`` and ``'w'`` no longer creates a database if it does not exist.
uk: База даних, відкрита з прапорцями ``'r''`` тепер доступна лише для читання. Відкриття з прапорцями ``'r'`` і ``'w'`` більше не створює базу даних, якщо вона не існує.

source: In addition to the methods provided by the :class:`collections.abc.MutableMapping` class, :class:`dumbdbm` objects provide the following methods:
uk: На додаток до методів, наданих класом :class:`collections.abc.MutableMapping`, об’єкти :class:`dumbdbm` надають такі методи:

source: Synchronize the on-disk directory and data files. This method is called by the :meth:`Shelve.sync` method.
uk: Синхронізувати каталог на диску та файли даних. Цей метод викликається методом :meth:`Shelve.sync`.

source: Close the ``dumbdbm`` database.
uk: Закрийте базу даних ``dumbdbm``.
