Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/library/pathlib.po
Languages: uk

source: Like :meth:`Path.chmod` but, if the path points to a symbolic link, the symbolic link's mode is changed rather than its target's.
uk: Подібно до :meth:`Path.chmod`, але якщо шлях вказує на символічне посилання, змінюється режим символічного посилання, а не його призначення.

source: Like :meth:`Path.stat` but, if the path points to a symbolic link, return the symbolic link's information rather than its target's.
uk: Подібно до :meth:`Path.stat`, але якщо шлях вказує на символічне посилання, повертається інформація про символічне посилання, а не про його ціль.

source: Create a new directory at this given path. If *mode* is given, it is combined with the process' ``umask`` value to determine the file mode and access flags. If the path already exists, :exc:`FileExistsError` is raised.
uk: Створіть новий каталог за вказаним шляхом. Якщо задано *mode*, воно поєднується зі значенням ``umask`` процесу для визначення режиму файлу та позначок доступу. Якщо шлях уже існує, виникає :exc:`FileExistsError`.

source: If *parents* is true, any missing parents of this path are created as needed; they are created with the default permissions without taking *mode* into account (mimicking the POSIX ``mkdir -p`` command).
uk: Якщо *parents* має значення true, будь-які відсутні батьки цього шляху створюються за потреби; вони створюються з дозволами за замовчуванням без урахування *mode* (імітація команди POSIX ``mkdir -p``).

source: If *parents* is false (the default), a missing parent raises :exc:`FileNotFoundError`.
uk: Якщо *parents* має значення false (за замовчуванням), відсутній батьківський елемент викликає :exc:`FileNotFoundError`.

source: If *exist_ok* is false (the default), :exc:`FileExistsError` is raised if the target directory already exists.
uk: Якщо *exist_ok* має значення false (за замовчуванням), :exc:`FileExistsError` викликається, якщо цільовий каталог уже існує.

source: If *exist_ok* is true, :exc:`FileExistsError` exceptions will be ignored (same behavior as the POSIX ``mkdir -p`` command), but only if the last path component is not an existing non-directory file.
uk: Якщо *exist_ok* має значення true, винятки :exc:`FileExistsError` ігноруватимуться (така ж поведінка, що й команда POSIX ``mkdir -p``), але лише якщо останній компонент шляху не є існуючим файлом, що не є каталогом.

source: The *exist_ok* parameter was added.
uk: Додано параметр *exist_ok*.

source: Open the file pointed to by the path, like the built-in :func:`open` function does::
uk: Відкрийте файл, на який вказує шлях, як це робить вбудована функція :func:`open`:

source: Return the name of the user owning the file. :exc:`KeyError` is raised if the file's uid isn't found in the system database.
uk: Повернути ім’я користувача, якому належить файл. :exc:`KeyError` виникає, якщо uid файлу не знайдено в системній базі даних.

source: Return the binary contents of the pointed-to file as a bytes object::
uk: Повертає двійковий вміст зазначеного файлу як об’єкт bytes::

source: Return the decoded contents of the pointed-to file as a string::
uk: Повертає декодований вміст вказаного файлу як рядок::

source: The file is opened and then closed. The optional parameters have the same meaning as in :func:`open`.
uk: Файл відкривається, а потім закривається. Необов’язкові параметри мають те саме значення, що й у :func:`open`.

source: Return the path to which the symbolic link points (as returned by :func:`os.readlink`)::
uk: Повертає шлях, на який вказує символічне посилання (як повертає :func:`os.readlink`)::

source: Rename this file or directory to the given *target*, and return a new Path instance pointing to *target*. On Unix, if *target* exists and is a file, it will be replaced silently if the user has permission. On Windows, if *target* exists, :exc:`FileExistsError` will be raised. *target* can be either a string or another path object::
uk: Перейменуйте цей файл або каталог на задану *ціль* і поверніть новий екземпляр шляху, що вказує на *ціль*. В Unix, якщо *target* існує і є файлом, його буде замінено мовчки, якщо користувач має дозвіл. У Windows, якщо *ціль* існує, буде викликано :exc:`FileExistsError`. *target* може бути або рядком, або іншим об’єктом шляху::

source: The target path may be absolute or relative. Relative paths are interpreted relative to the current working directory, *not* the directory of the Path object.
uk: Цільовий шлях може бути абсолютним або відносним. Відносні шляхи інтерпретуються відносно поточного робочого каталогу, *а не* каталогу об’єкта Path.

source: Added return value, return the new Path instance.
uk: Додано значення, що повертається, повертає новий екземпляр Path.

source: Rename this file or directory to the given *target*, and return a new Path instance pointing to *target*. If *target* points to an existing file or empty directory, it will be unconditionally replaced.
uk: Перейменуйте цей файл або каталог на задану *ціль* і поверніть новий екземпляр шляху, що вказує на *ціль*. Якщо *target* вказує на існуючий файл або порожній каталог, його буде безумовно замінено.

source: Make the path absolute, resolving any symlinks. A new path object is returned::
uk: Зробіть шлях абсолютним, дозволяючи будь-які символічні посилання. Повертається новий об'єкт шляху::

source: "``..``" components are also eliminated (this is the only method to do so)::
uk: Компоненти "``..``" також видаляються (це єдиний спосіб зробити це):

source: If the path doesn't exist and *strict* is ``True``, :exc:`FileNotFoundError` is raised. If *strict* is ``False``, the path is resolved as far as possible and any remainder is appended without checking whether it exists. If an infinite loop is encountered along the resolution path, :exc:`RuntimeError` is raised.
uk: Якщо шлях не існує і *strict* має значення ``True``, виникає :exc:`FileNotFoundError`. Якщо *strict* має значення ``False``, шлях розв’язується, наскільки це можливо, і будь-який залишок додається без перевірки його існування. Якщо на шляху вирішення зустрічається нескінченний цикл, виникає :exc:`RuntimeError`.

source: The *strict* argument (pre-3.6 behavior is strict).
uk: Аргумент *strict* (поведінка до 3.6 сувора).

source: Raises an :ref:`auditing event <auditing>` ``pathlib.Path.rglob`` with arguments ``self``, ``pattern``.
uk: Викликає :ref:`подію аудиту <auditing>` ``pathlib.Path.rglob`` з аргументами ``self``, ``pattern``.

source: Remove this directory. The directory must be empty.
uk: Видаліть цей каталог. Каталог має бути порожнім.

source: Return whether this path points to the same file as *other_path*, which can be either a Path object, or a string. The semantics are similar to :func:`os.path.samefile` and :func:`os.path.samestat`.
uk: Повертає, чи цей шлях вказує на той самий файл, що й *other_path*, який може бути об’єктом Path або рядком. Семантика подібна до :func:`os.path.samefile` і :func:`os.path.samestat`.

source: An :exc:`OSError` can be raised if either file cannot be accessed for some reason.
uk: :exc:`OSError` може виникнути, якщо з певної причини неможливо отримати доступ до будь-якого файлу.

source: Make this path a symbolic link to *target*. Under Windows, *target_is_directory* must be true (default ``False``) if the link's target is a directory. Under POSIX, *target_is_directory*'s value is ignored.
uk: Зробіть цей шлях символічним посиланням на *target*. У Windows *target_is_directory* має бути істинним (за замовчуванням ``False``), якщо цільовим посиланням є каталог. У POSIX значення *target_is_directory* ігнорується.

source: The order of arguments (link, target) is the reverse of :func:`os.symlink`'s.
uk: Порядок аргументів (посилання, ціль) є зворотним порядку :func:`os.symlink`.

source: Make this path a hard link to the same file as *target*.
uk: Зробіть цей шлях жорстким посиланням на той самий файл, що й *target*.

source: The order of arguments (link, target) is the reverse of :func:`os.link`'s.
uk: Порядок аргументів (посилання, ціль) є зворотним порядку :func:`os.link`.

source: Create a file at this given path. If *mode* is given, it is combined with the process' ``umask`` value to determine the file mode and access flags. If the file already exists, the function succeeds if *exist_ok* is true (and its modification time is updated to the current time), otherwise :exc:`FileExistsError` is raised.
uk: Створіть файл за вказаним шляхом. Якщо задано *mode*, воно поєднується зі значенням ``umask`` процесу для визначення режиму файлу та позначок доступу. Якщо файл уже існує, функція виконується успішно, якщо *exist_ok* має значення true (і час його модифікації оновлюється до поточного часу), інакше виникає :exc:`FileExistsError`.

source: Remove this file or symbolic link. If the path points to a directory, use :func:`Path.rmdir` instead.
uk: Видаліть цей файл або символічне посилання. Якщо шлях вказує на каталог, замість цього використовуйте :func:`Path.rmdir`.

source: If *missing_ok* is false (the default), :exc:`FileNotFoundError` is raised if the path does not exist.
uk: Якщо *missing_ok* має значення false (за замовчуванням), :exc:`FileNotFoundError` викликається, якщо шлях не існує.

source: If *missing_ok* is true, :exc:`FileNotFoundError` exceptions will be ignored (same behavior as the POSIX ``rm -f`` command).
uk: Якщо *missing_ok* має значення true, винятки :exc:`FileNotFoundError` ігноруватимуться (така ж поведінка, що й команда POSIX ``rm -f``).

source: The *missing_ok* parameter was added.
uk: Додано параметр *missing_ok*.

source: Open the file pointed to in bytes mode, write *data* to it, and close the file::
uk: Відкрийте вказаний файл у байтовому режимі, запишіть у нього *data* та закрийте файл::

source: An existing file of the same name is overwritten.
uk: Існуючий файл із такою ж назвою буде перезаписано.

source: Open the file pointed to in text mode, write *data* to it, and close the file::
uk: Відкрийте вказаний файл у текстовому режимі, запишіть у нього *data* та закрийте файл::

source: An existing file of the same name is overwritten. The optional parameters have the same meaning as in :func:`open`.
uk: Існуючий файл із такою ж назвою буде перезаписано. Необов’язкові параметри мають те саме значення, що й у :func:`open`.

source: The *newline* parameter was added.
uk: Додано параметр *новий рядок*.

source: Correspondence to tools in the :mod:`os` module
uk: Відповідність інструментам в модулі :mod:`os`

source: Below is a table mapping various :mod:`os` functions to their corresponding :class:`PurePath`/:class:`Path` equivalent.
uk: Нижче наведено таблицю, що відображає різні функції :mod:`os` на їхні відповідні еквіваленти :class:`PurePath`/:class:`Path`.

source: :mod:`os` and :mod:`os.path`
uk: :mod:`os` і :mod:`os.path`

source: :meth:`Path.mkdir`
uk: :meth:`Шлях.mkdir`

source: :meth:`Path.rmdir`
uk: :meth:`Шлях.rmdir`

source: :meth:`Path.expanduser` and :meth:`Path.home`
uk: :meth:`Path.expanduser` і :meth:`Path.home`

source: :meth:`Path.is_file`
uk: :meth:`Шлях.є_файлом`

source: :meth:`Path.hardlink_to`
uk: :meth:`Шлях.hardlink_to`

source: :meth:`Path.symlink_to`
uk: :meth:`Шлях.симпосилання_до`

source: Footnotes
uk: Виноски

source: :meth:`PurePath.relative_to` requires ``self`` to be the subpath of the argument, but :func:`os.path.relpath` does not.
uk: :meth:`PurePath.relative_to` вимагає, щоб ``self`` був підшляхом аргументу, але :func:`os.path.relpath` ні.
