Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/library/pathlib.po
Languages: uk

source: :mod:`pathlib` --- Object-oriented filesystem paths
uk: :mod:`pathlib` --- Шляхи до об'єктно-орієнтованої файлової системи

source: **Source code:** :source:`Lib/pathlib.py`
uk: **Вихідний код:** :source:`Lib/pathlib.py`

source: This module offers classes representing filesystem paths with semantics appropriate for different operating systems. Path classes are divided between :ref:`pure paths <pure-paths>`, which provide purely computational operations without I/O, and :ref:`concrete paths <concrete-paths>`, which inherit from pure paths but also provide I/O operations.
uk: Цей модуль пропонує класи, що представляють шляхи файлової системи із семантикою, відповідною до різних операційних систем. Класи шляхів поділяються на :ref:`чисті шляхи <pure-paths>`, які забезпечують суто обчислювальні операції без введення/виведення, та :ref:`конкретні шляхи <concrete-paths>`, які успадковують чисті шляхи, але також забезпечують операції введення/виведення.

source: If you've never used this module before or just aren't sure which class is right for your task, :class:`Path` is most likely what you need. It instantiates a :ref:`concrete path <concrete-paths>` for the platform the code is running on.
uk: Якщо ви ніколи раніше не користувалися цим модулем або просто не впевнені, який клас підходить для вашого завдання, :class:`Path`, швидше за все, це те, що вам потрібно. Він створює екземпляр :ref:`конкретного шляху <concrete-paths>` для платформи, на якій працює код.

source: Pure paths are useful in some special cases; for example:
uk: Чисті шляхи корисні в деяких особливих випадках; наприклад:

source: If you want to manipulate Windows paths on a Unix machine (or vice versa). You cannot instantiate a :class:`WindowsPath` when running on Unix, but you can instantiate :class:`PureWindowsPath`.
uk: Якщо ви хочете маніпулювати шляхами Windows на машині Unix (або навпаки). Ви не можете створити екземпляр :class:`WindowsPath` під час роботи в Unix, але ви можете створити екземпляр :class:`PureWindowsPath`.

source: You want to make sure that your code only manipulates paths without actually accessing the OS. In this case, instantiating one of the pure classes may be useful since those simply don't have any OS-accessing operations.
uk: Ви хочете переконатися, що ваш код обробляє лише шляхи без фактичного доступу до ОС. У цьому випадку створення одного з чистих класів може бути корисним, оскільки вони просто не мають жодних операцій доступу до ОС.

source: :pep:`428`: The pathlib module -- object-oriented filesystem paths.
uk: :pep:`428`: Модуль pathlib -- шляхи об'єктно-орієнтованої файлової системи.

source: For low-level path manipulation on strings, you can also use the :mod:`os.path` module.
uk: Для низькорівневих маніпуляцій шляхом до рядків ви також можете використовувати модуль :mod:`os.path`.

source: Basic use
uk: Основне використання

source: Importing the main class::
uk: Імпорт основного класу::

source: Listing subdirectories::
uk: Перелік підкаталогів::

source: Listing Python source files in this directory tree::
uk: Перелік вихідних файлів Python у цьому дереві каталогів::

source: Navigating inside a directory tree::
uk: Навігація всередині дерева каталогів::

source: Querying path properties::
uk: Властивості шляху запиту::

source: Opening a file::
uk: Відкриття файлу::

source: Pure paths
uk: Чисті стежки

source: Pure path objects provide path-handling operations which don't actually access a filesystem. There are three ways to access these classes, which we also call *flavours*:
uk: Об’єкти чистого шляху забезпечують операції обробки шляху, які фактично не мають доступу до файлової системи. Є три способи отримати доступ до цих класів, які ми також називаємо *смаками*:

source: A generic class that represents the system's path flavour (instantiating it creates either a :class:`PurePosixPath` or a :class:`PureWindowsPath`)::
uk: Загальний клас, який представляє шлях до системи (його екземпляр створює або :class:`PurePosixPath`, або :class:`PureWindowsPath`)::

source: When *pathsegments* is empty, the current directory is assumed::
uk: Якщо *pathsegments* порожній, передбачається поточний каталог::

source: Spurious slashes and single dots are collapsed, but double dots (``'..'``) and leading double slashes (``'//'``) are not, since this would change the meaning of a path for various reasons (e.g. symbolic links, UNC paths)::
uk: Фальшиві косі риски та одиночні крапки згортаються, але подвійні крапки (``'..''``) і початкові подвійні косі риски (``'//'``) – ні, оскільки це може змінити значення шляху з різних причин (наприклад, символічні посилання, шляхи UNC):

source: (a naïve approach would make ``PurePosixPath('foo/../bar')`` equivalent to ``PurePosixPath('bar')``, which is wrong if ``foo`` is a symbolic link to another directory)
uk: (наївний підхід зробив би ``PurePosixPath('foo/../bar')`` еквівалентним ``PurePosixPath('bar')``, що є неправильним, якщо ``foo`` є символічним посиланням на інший каталог )

source: Pure path objects implement the :class:`os.PathLike` interface, allowing them to be used anywhere the interface is accepted.
uk: Об’єкти чистого шляху реалізують інтерфейс :class:`os.PathLike`, що дозволяє використовувати їх будь-де, де прийнятний інтерфейс.

source: Added support for the :class:`os.PathLike` interface.
uk: Додано підтримку інтерфейсу :class:`os.PathLike`.

source: A subclass of :class:`PurePath`, this path flavour represents non-Windows filesystem paths::
uk: Підклас :class:`PurePath`, цей варіант шляху представляє шляхи до файлової системи не Windows::

source: *pathsegments* is specified similarly to :class:`PurePath`.
uk: *pathsegments* вказується подібно до :class:`PurePath`.

source: A subclass of :class:`PurePath`, this path flavour represents Windows filesystem paths, including `UNC paths`_::
uk: Підклас :class:`PurePath`, цей варіант шляху представляє шляхи файлової системи Windows, включаючи `шляхи UNC`_::

source: Regardless of the system you're running on, you can instantiate all of these classes, since they don't provide any operation that does system calls.
uk: Незалежно від системи, на якій ви працюєте, ви можете створити екземпляри всіх цих класів, оскільки вони не забезпечують жодних операцій, які виконують системні виклики.

source: General properties
uk: Загальні властивості

source: Paths of a different flavour compare unequal and cannot be ordered::
uk: Шляхи різного смаку порівнюються нерівнозначно і не можуть бути впорядковані::

source: Operators
uk: Оператори

source: A path object can be used anywhere an object implementing :class:`os.PathLike` is accepted::
uk: Об’єкт шляху можна використовувати скрізь, де прийнятний об’єкт, що реалізує :class:`os.PathLike`::

source: The string representation of a path is the raw filesystem path itself (in native form, e.g. with backslashes under Windows), which you can pass to any function taking a file path as a string::
uk: Рядкове представлення шляху — це сам необроблений шлях до файлової системи (у рідній формі, наприклад із зворотними похилими рисками під Windows), який ви можете передати будь-якій функції, яка приймає шлях до файлу як рядок::

source: Similarly, calling :class:`bytes` on a path gives the raw filesystem path as a bytes object, as encoded by :func:`os.fsencode`::
uk: Подібним чином виклик :class:`bytes` для шляху дає необроблений шлях до файлової системи як об’єкт bytes, закодований :func:`os.fsencode`::

source: Calling :class:`bytes` is only recommended under Unix. Under Windows, the unicode form is the canonical representation of filesystem paths.
uk: Виклик :class:`bytes` рекомендовано лише в Unix. У Windows форма Юнікод є канонічним представленням шляхів файлової системи.

source: Accessing individual parts
uk: Доступ до окремих частин

source: To access the individual "parts" (components) of a path, use the following property:
uk: Щоб отримати доступ до окремих "частин" (компонентів) шляху, використовуйте наступну властивість:

source: A tuple giving access to the path's various components::
uk: Кортеж, що надає доступ до різних компонентів шляху::

source: (note how the drive and local root are regrouped in a single part)
uk: (зверніть увагу, як диск і локальний корінь перегруповані в одній частині)

source: Methods and properties
uk: Методи та властивості

source: Pure paths provide the following methods and properties:
uk: Чисті шляхи забезпечують такі методи та властивості:

source: A string representing the drive letter or name, if any::
uk: Рядок, що представляє літеру або назву диска, якщо є:

source: UNC shares are also considered drives::
uk: Акції UNC також вважаються накопичувачами:

source: A string representing the (local or global) root, if any::
uk: Рядок, що представляє (локальний або глобальний) корінь, якщо такий є:

source: UNC shares always have a root::
uk: Акції UNC завжди мають корінь::

source: If the path starts with more than two successive slashes, :class:`~pathlib.PurePosixPath` collapses them::
uk: Якщо шлях починається з більш ніж двох послідовних похилих рисок, :class:`~pathlib.PurePosixPath` їх згортає:

source: *"A pathname that begins with two successive slashes may be interpreted in an implementation-defined manner, although more than two leading slashes shall be treated as a single slash."*
uk: *"Ім'я шляху, що починається з двох послідовних похилих рисок, може інтерпретуватися у спосіб, визначений реалізацією, хоча більше двох початкових похилих рисок повинні розглядатися як одна похила риска."*

source: The concatenation of the drive and root::
uk: Конкатенація диска та кореня::

source: An immutable sequence providing access to the logical ancestors of the path::
uk: Незмінна послідовність, що забезпечує доступ до логічних предків шляху::

source: The parents sequence now supports :term:`slices <slice>` and negative index values.
uk: Батьківська послідовність тепер підтримує :term:`slices <slice>` і від’ємні значення індексу.

source: The logical parent of the path::
uk: Логічний батько шляху::

source: You cannot go past an anchor, or empty path::
uk: Ви не можете пройти повз якір або порожній шлях ::

source: This is a purely lexical operation, hence the following behaviour::
uk: Це суто лексична операція, тому така поведінка:

source: A string representing the final path component, excluding the drive and root, if any::
uk: Рядок, що представляє кінцевий компонент шляху, за винятком диска та кореня, якщо такі є::

source: UNC drive names are not considered::
uk: Назви дисків UNC не враховуються:

source: The file extension of the final component, if any::
uk: Розширення файлу кінцевого компонента, якщо є:

source: A list of the path's file extensions::
uk: Список розширень файлів шляху::

source: The final path component, without its suffix::
uk: Остаточний компонент шляху без суфікса::

source: Return a string representation of the path with forward slashes (``/``)::
uk: Повертає рядкове представлення шляху з похилою рискою (``/``)::

source: Represent the path as a ``file`` URI. :exc:`ValueError` is raised if the path isn't absolute.
uk: Уявіть шлях як URI ``файлу``. :exc:`ValueError` виникає, якщо шлях не є абсолютним.

source: Return whether the path is absolute or not. A path is considered absolute if it has both a root and (if the flavour allows) a drive::
uk: Повернути, чи є шлях абсолютним чи ні. Шлях вважається абсолютним, якщо він має як корінь, так і (якщо дозволяє аромат) диск::

source: Return whether or not this path is relative to the *other* path.
uk: Повертає, чи є цей шлях відносно *іншого* шляху.

source: With :class:`PureWindowsPath`, return ``True`` if the path is considered reserved under Windows, ``False`` otherwise. With :class:`PurePosixPath`, ``False`` is always returned.
uk: За допомогою :class:`PureWindowsPath` поверніть ``True``, якщо шлях вважається зарезервованим під Windows, ``False`` інакше. З :class:`PurePosixPath` завжди повертається ``False``.

source: File system calls on reserved paths can fail mysteriously or have unintended effects.
uk: Виклики файлової системи за зарезервованими шляхами можуть призвести до таємничої помилки або призвести до небажаних наслідків.

source: Match this path against the provided glob-style pattern. Return ``True`` if matching is successful, ``False`` otherwise.
uk: Зіставте цей шлях із наданим шаблоном у стилі glob. Повертає ``True``, якщо зіставлення вдалось, ``False`` інакше.

source: If *pattern* is relative, the path can be either relative or absolute, and matching is done from the right::
uk: Якщо *шаблон* є відносним, шлях може бути відносним або абсолютним, а зіставлення виконується справа:

source: If *pattern* is absolute, the path must be absolute, and the whole path must match::
uk: Якщо *шаблон* є абсолютним, шлях має бути абсолютним, і весь шлях має відповідати::

source: As with other methods, case-sensitivity follows platform defaults::
uk: Як і в інших методах, чутливість до регістру відповідає стандартам платформи:

source: Return a new path with the :attr:`name` changed. If the original path doesn't have a name, ValueError is raised::
uk: Повертає новий шлях зі зміненим :attr:`name`. Якщо вихідний шлях не має імені, виникає ValueError::

source: Return a new path with the :attr:`stem` changed. If the original path doesn't have a name, ValueError is raised::
uk: Повертає новий шлях зі зміненим :attr:`stem`. Якщо вихідний шлях не має імені, виникає ValueError::

source: Return a new path with the :attr:`suffix` changed. If the original path doesn't have a suffix, the new *suffix* is appended instead. If the *suffix* is an empty string, the original suffix is removed::
uk: Повертає новий шлях зі зміненим :attr:`suffix`. Якщо вихідний шлях не має суфікса, замість нього додається новий *суфікс*. Якщо *суфікс* є порожнім рядком, вихідний суфікс видаляється:

source: Concrete paths
uk: Бетонні доріжки

source: Concrete paths are subclasses of the pure path classes. In addition to operations provided by the latter, they also provide methods to do system calls on path objects. There are three ways to instantiate concrete paths:
uk: Конкретні шляхи є підкласами класів чистих шляхів. На додаток до операцій, наданих останнім, вони також надають методи для виконання системних викликів об’єктів шляху. Є три способи створення конкретних шляхів:

source: A subclass of :class:`PurePath`, this class represents concrete paths of the system's path flavour (instantiating it creates either a :class:`PosixPath` or a :class:`WindowsPath`)::
uk: Підклас :class:`PurePath`, цей клас представляє конкретні шляхи шляхів системи (інстанціювання створює або :class:`PosixPath`, або :class:`WindowsPath`)::

source: A subclass of :class:`Path` and :class:`PurePosixPath`, this class represents concrete non-Windows filesystem paths::
uk: Підклас :class:`Path` і :class:`PurePosixPath`, цей клас представляє конкретні шляхи до файлової системи не Windows::

source: A subclass of :class:`Path` and :class:`PureWindowsPath`, this class represents concrete Windows filesystem paths::
uk: Підклас :class:`Path` і :class:`PureWindowsPath`, цей клас представляє конкретні шляхи файлової системи Windows::

source: You can only instantiate the class flavour that corresponds to your system (allowing system calls on non-compatible path flavours could lead to bugs or failures in your application)::
uk: Ви можете створити лише екземпляр класу, який відповідає вашій системі (дозвол системних викликів за несумісними варіантами шляху може призвести до помилок або збоїв у вашій програмі):

source: Methods
uk: методи

source: Concrete paths provide the following methods in addition to pure paths methods. Many of these methods can raise an :exc:`OSError` if a system call fails (for example because the path doesn't exist).
uk: Конкретні шляхи надають наступні методи на додаток до методів чистих шляхів. Багато з цих методів можуть викликати :exc:`OSError`, якщо системний виклик не вдається (наприклад, через те, що шлях не існує).

source: :meth:`~Path.exists()`, :meth:`~Path.is_dir()`, :meth:`~Path.is_file()`, :meth:`~Path.is_mount()`, :meth:`~Path.is_symlink()`, :meth:`~Path.is_block_device()`, :meth:`~Path.is_char_device()`, :meth:`~Path.is_fifo()`, :meth:`~Path.is_socket()` now return ``False`` instead of raising an exception for paths that contain characters unrepresentable at the OS level.
uk: :meth:`~Path.exists()`, :meth:`~Path.is_dir()`, :meth:`~Path.is_file()`, :meth:`~Path.is_mount()`, :meth:`~Path.is_symlink()`, :meth:`~Path.is_block_device()`, :meth:`~Path.is_char_device()`, :meth:`~Path.is_fifo()`, :meth:`~Path.is_socket()` тепер повертає ``False`` замість того, щоб викликати виключення для шляхів, які містять символи, які неможливо відобразити на рівні ОС.

source: Return a new path object representing the current directory (as returned by :func:`os.getcwd`)::
uk: Повертає новий об’єкт шляху, що представляє поточний каталог (як повертає :func:`os.getcwd`)::

source: Return a new path object representing the user's home directory (as returned by :func:`os.path.expanduser` with ``~`` construct). If the home directory can't be resolved, :exc:`RuntimeError` is raised.
uk: Повертає новий об’єкт шляху, що представляє домашній каталог користувача (як повертає :func:`os.path.expanduser` за допомогою конструкції ``~``). Якщо не вдається вирішити домашній каталог, виникає :exc:`RuntimeError`.

source: Return a :class:`os.stat_result` object containing information about this path, like :func:`os.stat`. The result is looked up at each call to this method.
uk: Повертає об’єкт :class:`os.stat_result`, що містить інформацію про цей шлях, наприклад :func:`os.stat`. Результат переглядається під час кожного виклику цього методу.

source: This method normally follows symlinks; to stat a symlink add the argument ``follow_symlinks=False``, or use :meth:`~Path.lstat`.
uk: Цей метод зазвичай слідує за символічними посиланнями; щоб стати символічним посиланням, додайте аргумент ``follow_symlinks=False`` або використовуйте :meth:`~Path.lstat`.

source: The *follow_symlinks* parameter was added.
uk: Додано параметр *follow_symlinks*.

source: Change the file mode and permissions, like :func:`os.chmod`.
uk: Змініть режим файлу та дозволи, наприклад :func:`os.chmod`.

source: This method normally follows symlinks. Some Unix flavours support changing permissions on the symlink itself; on these platforms you may add the argument ``follow_symlinks=False``, or use :meth:`~Path.lchmod`.
uk: Цей метод зазвичай слідує за символічними посиланнями. Деякі різновиди Unix підтримують зміну дозволів для самого символічного посилання; на цих платформах ви можете додати аргумент ``follow_symlinks=False`` або використовувати :meth:`~Path.lchmod`.

source: Return a new path with expanded ``~`` and ``~user`` constructs, as returned by :meth:`os.path.expanduser`. If a home directory can't be resolved, :exc:`RuntimeError` is raised.
uk: Повертає новий шлях із розширеними конструкціями ``~`` і ``~user``, як повертає :meth:`os.path.expanduser`. Якщо не вдається вирішити домашній каталог, виникає :exc:`RuntimeError`.

source: Glob the given relative *pattern* in the directory represented by this path, yielding all matching files (of any kind)::
uk: Помістіть заданий відносний *шаблон* у каталог, представлений цим шляхом, одержуючи всі відповідні файли (будь-якого типу)::

source: Patterns are the same as for :mod:`fnmatch`, with the addition of "``**``" which means "this directory and all subdirectories, recursively". In other words, it enables recursive globbing::
uk: Шаблони такі ж, як і для :mod:`fnmatch`, з додаванням "``**``", що означає "цей каталог і всі підкаталоги, рекурсивно". Іншими словами, це дозволяє рекурсивне глоббування::

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
uk: Використання шаблону "``**``" у великих деревах каталогів може зайняти надто багато часу.

source: Raises an :ref:`auditing event <auditing>` ``pathlib.Path.glob`` with arguments ``self``, ``pattern``.
uk: Викликає :ref:`подію аудиту <auditing>` ``pathlib.Path.glob`` з аргументами ``self``, ``pattern``.

source: Return the name of the group owning the file. :exc:`KeyError` is raised if the file's gid isn't found in the system database.
uk: Повернути назву групи, якій належить файл. :exc:`KeyError` виникає, якщо gid файлу не знайдено в системній базі даних.

source: Return ``True`` if the path points to a directory (or a symbolic link pointing to a directory), ``False`` if it points to another kind of file.
uk: Повертає ``True``, якщо шлях вказує на каталог (або символічне посилання, що вказує на каталог), ``False``, якщо він вказує на інший тип файлу.

source: ``False`` is also returned if the path doesn't exist or is a broken symlink; other errors (such as permission errors) are propagated.
uk: ``False`` також повертається, якщо шлях не існує або це несправне символічне посилання; інші помилки (наприклад, помилки дозволу) поширюються.

source: Return ``True`` if the path points to a regular file (or a symbolic link pointing to a regular file), ``False`` if it points to another kind of file.
uk: Повертає ``True``, якщо шлях вказує на звичайний файл (або символічне посилання, що вказує на звичайний файл), ``False``, якщо він вказує на файл іншого типу.

source: Windows support was added.
uk: Додано підтримку Windows.

source: Return ``True`` if the path points to a symbolic link, ``False`` otherwise.
uk: Повертає ``True``, якщо шлях вказує на символічне посилання, ``False`` інакше.

source: ``False`` is also returned if the path doesn't exist; other errors (such as permission errors) are propagated.
uk: ``False`` також повертається, якщо шлях не існує; інші помилки (наприклад, помилки дозволу) поширюються.

source: Return ``True`` if the path points to a Unix socket (or a symbolic link pointing to a Unix socket), ``False`` if it points to another kind of file.
uk: Повертає ``True``, якщо шлях вказує на сокет Unix (або символічне посилання, що вказує на сокет Unix), ``False``, якщо він вказує на інший тип файлу.

source: Return ``True`` if the path points to a FIFO (or a symbolic link pointing to a FIFO), ``False`` if it points to another kind of file.
uk: Повертає ``True``, якщо шлях вказує на FIFO (або символічне посилання, що вказує на FIFO), ``False``, якщо він вказує на інший тип файлу.

source: Return ``True`` if the path points to a block device (or a symbolic link pointing to a block device), ``False`` if it points to another kind of file.
uk: Повертає ``True``, якщо шлях вказує на блоковий пристрій (або символічне посилання, що вказує на блоковий пристрій), ``False``, якщо він вказує на інший тип файлу.

source: Return ``True`` if the path points to a character device (or a symbolic link pointing to a character device), ``False`` if it points to another kind of file.
uk: Повертає ``True``, якщо шлях вказує на символьний пристрій (або символічне посилання, що вказує на символьний пристрій), ``False``, якщо він вказує на інший тип файлу.

source: When the path points to a directory, yield path objects of the directory contents::
uk: Коли шлях вказує на каталог, видає об’єкти шляху вмісту каталогу::

source: The children are yielded in arbitrary order, and the special entries ``'.'`` and ``'..'`` are not included. If a file is removed from or added to the directory after creating the iterator, whether a path object for that file be included is unspecified.
uk: Дочірні елементи видаються в довільному порядку, і спеціальні записи ``'.'`` і ``'..'`` не включені. Якщо файл видалено з каталогу або додано до нього після створення ітератора, чи буде включений об’єкт шляху для цього файлу, не визначено.
