Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/library/token.po
Languages: id

source: :mod:`token` --- Constants used with Python parse trees
id: :mod:`token` --- Konstanta digunakan dengan pohon pengurai (parse tree) Python

source: **Source code:** :source:`Lib/token.py`
id: **Kode sumber:** :source:`Lib/token.py`

source: This module provides constants which represent the numeric values of leaf nodes of the parse tree (terminal tokens). Refer to the file :file:`Grammar/Grammar` in the Python distribution for the definitions of the names in the context of the language grammar. The specific numeric values which the names map to may change between Python versions.
id: Modul ini menyediakan konstanta yang mewakili nilai numerik dari simpul daun pohon parse (token terminal). Merujuk pada berkas :file:`Grammar/Grammar` dalam distribusi Python untuk definisi nama-nama dalam konteks tata bahasa bahasa. Nilai numerik tertentu yang dipetakan oleh nama-nama dapat berubah antar versi Python.

source: The module also provides a mapping from numeric codes to names and some functions. The functions mirror definitions in the Python C header files.
id: Modul ini juga menyediakan pemetaan dari kode numerik ke nama dan beberapa fungsi. Fungsi mencerminkan definisi pada file header Python C.

source: Dictionary mapping the numeric values of the constants defined in this module back to name strings, allowing more human-readable representation of parse trees to be generated.
id: Kamus memetakan nilai numerik dari konstanta yang didefinisikan dalam modul ini kembali ke string nama, yang memungkinkan dihasilkannya representasi pohon parse yang lebih dapat dibaca oleh manusia.

source: Return ``True`` for terminal token values.
id: Kembalikan ``True`` untuk nilai-nilai token terminal (akhir).

source: Return ``True`` for non-terminal token values.
id: Kembalikan ``True`` untuk nilai-nilai token non-terminal.

source: Return ``True`` if *x* is the marker indicating the end of input.
id: Kembalikan nilai ``True`` jika *x* adalah penanda yang menunjukkan akhir input.

source: The token constants are:
id: Konstanta token antara lain:

source: The following token type values aren't used by the C tokenizer but are needed for the :mod:`tokenize` module.
id: Nilai tipe token berikut tidak digunakan oleh penanda (tokenizer) C tetapi diperlukan untuk modul :mod:`tokenize`.

source: Token value used to indicate a comment.
id: Nilai token digunakan untuk menunjukkan komentar.

source: Token value used to indicate a non-terminating newline. The :data:`NEWLINE` token indicates the end of a logical line of Python code; ``NL`` tokens are generated when a logical line of code is continued over multiple physical lines.
id: Nilai token digunakan untuk menunjukkan baris baru yang tidak berhenti. Token :data:`NEWLINE` menunjukkan akhir baris logika kode Python; token ``NL`` dihasilkan ketika satu baris kode logis diteruskan melalui beberapa baris fisik.

source: Token value that indicates the encoding used to decode the source bytes into text. The first token returned by :func:`tokenize.tokenize` will always be an ``ENCODING`` token.
id: Nilai token yang menunjukkan pengodean yang digunakan untuk mendekode sumber byte menjadi teks. Token pertama yang dikembalikan oleh :func:`tokenize.tokenize` akan selalu menjadi token ``ENCODING``.

source: Added :data:`AWAIT` and :data:`ASYNC` tokens.
id: Menambahkan token :data:`AWAIT` dan :data:`ASYNC`.

source: Added :data:`COMMENT`, :data:`NL` and :data:`ENCODING` tokens.
id: Menambahkan token :data:`COMMENT`, :data:`NL` dan :data:`ENCODING`.

source: Removed :data:`AWAIT` and :data:`ASYNC` tokens. "async" and "await" are now tokenized as :data:`NAME` tokens.
id: Menghapus token :data:`AWAIT` dan :data:`ASYNC`. "async" dan "await" sekarang ditandai sebagai token :data:`NAME`.
