Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/about.po
Languages: ar, cs, fa, ps, tr

source: About these documents
ar: حول المستندات
cs: O těchto dokumentech
ps: د دې اسنادو په اړه
tr: Bu dökümanlar hakkında

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
ar: هذه المستندات التعليمية تمت صنعها بواسطة مصادر `reStructuredText`_ المصنوع من قبل `Sphinx`_, وهو معالج مستندات تمت صنعها خصيصاً لمستندات بايثون.
cs: Tyto stránky jsou generovány ze zdrojového kódu ve formátu `reStructuredText`_ pomocí dokumentového procesoru `Sphinx`_, který byl vytvořen přímo pro dokumentaci Pythonu.
ps: دا اسناد د `reStructuredText`_ سند پروسيسر په ځانګړې توګه د Python اسنادونو لپاره لیکلي چه د « Sphinx`_ » لخوا تولید شوي.
tr: Bu belgeler, 'Sphinx'_ tarafından 'yenidenYapılandırılmışMetin'_ kaynaklarından oluşturulmuştur, belge işlemcisi Python dokümantasyonuna özgün yazılmıştır.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
ar: جميع التحسينات المستندات مع ادواتها هي أعمالٌ تطوعيةٌ بالكاملو كذلك البايثون نفسه. إذا تنوي المشاركة في الأمر، فضلا ألقِ نظرةعلى صفحة :ref:`reporting-bugs` لمزيدٍ من المعلومات حول كيفية العملْ.المتطوعين الجُدد مُرحب بهم دوماً
cs: Rozvoj dokumentace a příslušných nástrojů je zcela v rukách dobrovolníku, stejne jako Python samotný. Pokud se chcete zapojit, podívejte se prosím na stránku :ref:`reporting-bugs`, kde se dozvíte, jak začít. Noví dobrovolníci jsou vždy vítání1
fa: توسعهٔ مستندات و زنجیرهٔ ابزارهایش، همانند خود پایتون تلاشی کاملاً داوطلبانه است. اگر می‌خواهید مشارکت کنید برای اطّلاعات در مورد چگونگی آن نگاهی به صفحهٔ :ref:`reporting-bugs` بیندازید. همواره مقدم داوطلبان جدید را گرامی می‌داریم!
ps: د اسنادو او د دې تجهیزاتو پراختیا د Python په څیر په بشپړ ډول داوطلبۍ هڅه ده. که تاسو وغواړئ چې برخه واخلئ، مهرباني وکړئ د دې کار کولو په اړه د معلوماتو لپاره د:ref:`reporting-bugs` پاڼه وګورئ. د نوي رضاکارانو تل هرکلي کوو!
tr: Dokümantasyonun ve araç zincirinin geliştirilmesi, tıpkı Python'un kendisi gibi tamamen gönüllü bir çabadır. Eğer katkıda bulunmak istiyorsanız, lütfen bunun nasıl yapılacağı hakkında bilgi için: ref: `reporting-bugs` sayfasına bakın. Yeni gönüllüler her zaman açığız!

source: Many thanks go to:
ar: الشكر الجزيل إلى:
cs: Jmenovitá poděkování:
fa: سپاس بسیار از:
ps: ډیره مننه ده چې:
tr: Çok teşekkürler, şuraya gidin:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
ar: Fred L. Drake, Jr., صانع المستندات التعليمية اولَ مرة، وكاتب معظم هذه المستندات؛
cs: Fred L. Drake, Jr., autor původního Python documentation toolsetu and autor velké části samotné dokumentace;
ps: Fred L. Drake, Jr د اصلي Python د اسنادو د تجهیزاتو او د ډیرو محتوياتو لیکوال؛
tr: Fred L. Drake, Jr.; özgün Python belgeleme araç setinin yaratıcısı ve içeriğin çoğunun yazarı;

source: the `Docutils <http://docutils.sourceforge.net/>`_ project for creating reStructuredText and the Docutils suite;
ar: مشروع `Docutils <http://docutils.sourceforge.net/>`_ لصنعِهمreStructuredText و أدوات المستندات Docutils;
cs: projekt `Docutils <http://docutils.sourceforge.net/>`_, za to, že vytvořil reStructuredText a sadu Docutils;
ps: د`Docutils <http://docutils.sourceforge.net/>`_ پروژه د reStructuredText او د Docutils suite جوړولولپاره؛
tr: `Docutils <http://docutils.sourceforge.net / >`_reStructuredText ve Docutils yazılım paketi için oluşturulan proje;

source: Fredrik Lundh for his `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ project from which Sphinx got many good ideas.
ar: Fredrik Lundh لمشروعه `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ لأن Sphinx حصل على أفكار رائعة منها
cs: Fredrik Lundh za jeho projekt `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_, ze kterého Sphinx převzal mnoho dobrých nápadů.
ps: Fredrik Lundh د هغه د متبادل پژین حواله لپاره <http://effbot.org/zone/pyref.htm> `_ پروژه له کوم چې سپنکس ډیر ښه نظرونه ترلاسه کړي.
tr: Fredrik Lundh'un `Python Başvuru Kaynağı Seçeneği için <http://effbot.org/zone/pyref.htm> ` Sphinx'in birçok iyi fikir aldığı proje.

source: Contributors to the Python Documentation
ar: المساهمين في مستندات البايثون التعليمية
cs: Přispěvatelé do Dokumentace jazyka Python
ps: د Python د مستند کولو لپاره ونډه اخیستونکي
tr: Python Belgelerine Katkıda Bulunanlar.

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
ar: العديد من الناس ساهموا في لغة بايثون، وكذلك مكتبات بايثون الأفتراضيةو مستندات بايثون التعليمية. انظر إلى :source:`Misc/ACKS` في توزيعة بايثون المصدرية لترى لائحة جزئية من المشاركين
cs: Do jazyka, standardní knihovny a dokumentace jazyka Python přispělo mnoho lidí. Viz soubor :source:`Misc/ACKS` ve zdrojových kódech Pythonu, kde se nachází neúplný seznam přispěvatelů.
fa: افراد بسیاری در زبان، کتابخانهٔ استاندارد و مستندات پایتون مشارکت کرده‌اند. دیدن :source:`Misc/ACKS` در توزیع منبع پایتون برای سیاهه‌ای جزیی از مشارکت‌کنندگان.
ps: ډیر خلکو د Python ژبې، د معیاري کتابتون او اسنادونو کې مرسته کړې. وګورئ :source: `Misc / ACKS` د Python د سرچینې ویشلو کې د ګډون کوونکو د جزوی لیست لپاره.
tr: Birçok kişi Python dili, Python standart Kütüphanesi ve Python belgelerine katkıda bulunmuştur. Katkıda bulunanların kısmi bir listesi için Python kaynak dağıtımında `` Misc / ACKS`'ye bakınız.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
ar: ما يملكه بايثون من المستندات التعليمية الرائعة.. يرجع إلى مساهمات و تدخلات المجتمع البايثوني -- نقدم لكم جزيل الشكر
cs: Je to jen a pouze díky postřehům a příspěvkům od uživatelské komunity, že má Python tak ucelenou dokumentaci, jakou má -- Děkujeme!
fa: پایتون تنها با مشارکت‌های اجتماعش چنین مستندات فوق‌العاده‌ای دارد -- سپاس از شما!
ps: دا یوازې د Python ټولنه کې د انډول او ونډې سره دي چې Python دا خورا ښه اسناد لري - مننه!
tr: Sadece Python topluluğunun girdisi ve katkıları ile Python'un harika belgeleri var - Teşekkürler!

source: About this documentation
fa: درباره این مستندات

source: Python's documentation is generated from `reStructuredText`_ sources using `Sphinx`_, a documentation generator originally created for Python and now maintained as an independent project.
fa: مستندات Python از منابع `reStructuredText`_ با استفاده از '`Sphinx`_' ، تولید کننده مستند سازی که در ابتدا برای پایتون ایجاد شده و اکنون به عنوان یک پروژه مستقل نگهداری می شود ، تولید می شود.

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and author of much of the content;
fa: فرد ال. درک پسر، خالق مجموعه ابزار اصلی مستندات پایتون و نویسنده بسیاری از محتوا:

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
fa: پروژه `Docutils '<https://docutils.sourceforge.io/>`_' برای ایجاد reStructuredText و مجموعهٔ Docutils؛

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
fa: فردریک لوند برای پروژهٔ مرجع جایگزین پایتون که Sphinx ایده‌های خوبی از آن گرفت.

source: Contributors to the Python documentation
fa: مشارکت کنندگان مستندات پایتون
