Repository: python-docs-translations/transifex-automation
Catalog: */LC_MESSAGES/bugs.po
Languages: ar, es_es, fa, pt_br

source: Dealing with Bugs
ar: التعامل مع الأخطاء البرمجية
es_es: Peleando con Bugs
fa: مقابله با اشکالات
pt_br: Lidando com bugs

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
ar: بايثون هي لغةُ برمجةٍ كاملة ولقد أنشأت سمعة بأستقرارها. بالتالي لكي نحافظ على هذه السمعة، يجب عليك أن تبلّغ أية أخطاء تجدها في بايثون إلى المطورين
es_es: Python es un lenguaje de programación maduro que ha conseguido una reputación de estable. Para mantener esta reputación, a los desarrolladores les gustaría saber sobre cualquier deficiencia que encuentre en Python.
fa: پایتون یک زبان برنامه نویسی بالغ است که به دلیل ثبات شهرت دارد. برای حفظ این شهرت، توسعه‌دهندگان مایلند هر گونه نقصی را که در پایتون پیدا می‌کنید بدانند.
pt_br: Python é uma linguagem de programação madura que tem uma reputação estabelecida por ser estável. Para manter esta reputação, os desenvolvedores gostariam de saber de qualquer deficiência que você encontre em Python.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
ar: ويفضل أحياناً عند معرفة سبب الخطأ أن تصلحها بنفسك و تشارك الإصلاحات إلينا لأنها توفر جهد التحقيقات و بأقل عدد من الناس. لمعرفةِ المزيد عن:ref:`كيفية المشاركة <contributing-to-python>`.
es_es: A veces puede resultar más rápido para usted corregir los errores y contribuir con parches a Python, ya que agiliza el proceso e involucra a menos personas. Aprenda a: ref:`contribuir `. <contributing-to-python>`.
fa: گاهی اوقات ممکن است سریع‌تر باشد که خودتان باگ‌ها را برطرف کنید و وصله‌هایی را به پایتون اضافه کنید زیرا فرآیند را ساده می‌کند و افراد کمتری را درگیر می‌کند. آموزش :ref:`contribute <contributing-to-python>`.
pt_br: Às vezes, pode ser mais rápido você mesmo corrigir bugs e contribuir com patches para o Python, uma vez que agiliza o processo e envolve menos pessoas. Aprenda como pode fazer isso em :ref:`contribute<contributing-to-python> `.

source: Documentation bugs
ar: الأخطاء في المستندات التعليمية
es_es: Errores de documentación
fa: اشکالات مستندات
pt_br: Problemas de documentação

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
ar: إذا كانت هنالك أخطاء في المستندات التعليمية أو تود أن تقترحتحسينات لها، يرجى منك إرسال تقريرٍ عن الخطأ في :ref:`المتعقب <using-the-tracker>`. و الافكار مع معلوماتك عن كيفية التصليح اضمنها في التقرير أيضا
es_es: Si encuentra un error en esta documentación o desea proponer una mejora, envíe un informe de error en el rastreador: ref:`<using-the-tracker>`. Si tiene una sugerencia sobre cómo solucionarlo, inclúyala también.
fa: اگر اشکالی در این مستندات پیدا کردید یا می‌خواهید بهبودی را پیشنهاد دهید، لطفاً یک گزارش اشکال در :ref:`tracker <using-the-tracker>` ارسال کنید. اگر پیشنهادی در مورد چگونگی رفع آن دارید، آن را نیز درج کنید.
pt_br: Se você achar um bug nesta documentação ou gostaria de propor uma melhoria, por favor envie um relatório :ref:`rastreador de defeitos <using-the-tracker>`. Se você tem uma sugestão de como corrigir, coloque-a também.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
es_es: También puede abrir un item de discusión en nuestro ' Foro de discursión de documentación <https://discuss.python.org/c/documentation/26>`_.
fa: همچنین می توانید یک مورد بحث را در `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_ ما باز کنید.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
ar: إذا لم تملك وقتاً أو أنك مستعجل، يمكنك أيضا أن ترسل إيميل عن الأخطاء في المستندات التعليمية إلى docs@python.org (ليس الأخطاء عن البايثون أخطاء البايثون يمكن إرسالها إلى python-list@python.org).علما ان 'docs@' قائمة يديرها متطوعين؛ طلباتك سيتم ملاحظتها، لكن قد تأخذ وقتا للإهتمام بها
es_es: Si tiene poco tiempo, también puede enviar informes de errores de documentación por correo electrónico a docs@python.org (los errores de comportamiento se pueden enviar a python-list@python.org). 'docs@' es una lista de correo dirigida por voluntarios; su solicitud será notada, aunque puede tardar un tiempo en procesarse.
fa: اگر وقتتان کم است، می‌توانید گزارش‌های اشکال مستندات را به docs@python.org ایمیل کنید (اشکالات رفتاری را می‌توان به python-list@python.org ارسال کرد). 'docs@' یک لیست پستی است که توسط داوطلبان اداره می شود. درخواست شما مورد توجه قرار خواهد گرفت، اگرچه ممکن است مدتی طول بکشد تا پردازش شود.
pt_br: Se você esta com pouco tempo, pode também enviar os relatórios de erros de documentação para o e-mail docs@python.org (erros de funcionalidades podem ser enviados para python-list@python.org). 'docs@' é uma lista de e-mail mantida por voluntários; seu pedido será recebido, embora possa levar um tempo para ser processado.

source: `Documentation bugs`_
es_es: 'Errores de documentación`_
pt_br: `Problemas de documentação`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
es_es: Una lista de errores de documentación que se han enviado al rastreador de errores de Python.
fa: لیستی از اشکالات اسنادی که به ردیاب مشکل پایتون ارسال شده است.
pt_br: Uma lista de problemas na documentação que foram reportado no rastreador de defeitos do Python.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
es_es: 'Rastreador de problemas <https://devguide.python.org/tracker/>`_
pt_br: `Rastreando defeitos <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
es_es: Descripción general del proceso involucrado en la notificación de una mejora en el rastreador.
fa: مروری بر فرآیند مربوط به گزارش بهبود در ردیاب.
pt_br: Visão geral do processo de reportar uma melhoria no rastreador.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
es_es: 'Ayuda con la Documentación <https://devguide.python.org/docquality/#helping-with-documentation>`_
pt_br: `Ajudando com documentação <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
es_es: Guía completa para personas interesadas en contribuir a la documentación de Python.
fa: راهنمای جامع برای افرادی که علاقه مند به مشارکت در اسناد پایتون هستند.
pt_br: Guia completo para interessados em contribuir com a documentação do Python.

source: `Documentation Translations <https://devguide.python.org/documenting/#translating>`_
es_es: 'Traducciones de Documentación <https://devguide.python.org/documenting/#translating>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
es_es: Una lista de páginas de GitHub para la traducción de documentación y sus contactos principales.
fa: فهرستی از صفحات GitHub برای ترجمه اسناد و مخاطبین اصلی آنها.

source: Using the Python issue tracker
ar: طريقة استعمال متعقب أخطاء البايثون
es_es: Uso del rastreador de problemas de Python
fa: با استفاده از ردیاب مسئله پایتون
pt_br: Usando o rastreador de defeitos

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
es_es: Los informes de errores para el mismo Python deben enviarse a través del rastreador de problemas de GitHub (https://github.com/python/cpython/issues). El rastreador de problemas de GitHub ofrece un formulario web que permite ingresar y enviar la información oportuna a los desarrolladores.
fa: گزارش های مشکلات خود پایتون باید از طریق ردیاب مسائل GitHub (https://github.com/python/cpython/issues) ارسال شود. ردیاب مسائل GitHub یک فرم وب ارائه می دهد که به توسعه دهندگان اجازه می دهد اطلاعات مربوطه را وارد کرده و ارسال کنید.
pt_br: Relatórios de problemas no Python em si devem ser submetidos via Rastreador de problemas do Python (https://github.com/python/cpython/issues/). O rastreador de problemas do GitHub oferece um formulário web o qual permite que informações pertinentes sejam inseridas e submetidas aos desenvolvedores.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
es_es: El primer paso para presentar un informe es determinar si el problema ya se ha informado. La ventaja de hacerlo, además de ahorrar tiempo a los desarrolladores, es que aprendes lo que se haya hecho para solucionarlo; puede ser que el problema ya esté solucionado para la próxima versión, o que se necesite información adicional (en cuyo caso, ¡puedes proporcionarla si puedes!). Para hacer esto, busca el rastreador usando el cuadro de búsqueda en la parte superior de la página.
fa: اولین قدم در ارائه گزارش این است که مشخص شود آیا مشکل قبلا گزارش شده است یا خیر. مزیت انجام این کار، جدای از صرفه جویی در وقت توسعه دهندگان، این است که یاد می گیرید برای رفع آن چه کاری انجام شده است. ممکن است مشکل قبلاً برای نسخه بعدی برطرف شده باشد یا اطلاعات بیشتری مورد نیاز باشد (در این صورت می توانید در صورت امکان آن را ارائه دهید!). برای انجام این کار، ردیاب را با استفاده از کادر جستجو در بالای صفحه جستجو کنید.
pt_br: O primeiro passo para preencher um relatório é determinar se o problema já foi reportado. A vantagem em fazê-lo além de poupar o tempo dos desenvolvedores é que você aprende o que foi feito para consertá-lo; pode ser que o problema já foi consertado para o próximo lançamento, ou que informação adicional seja necessária (nesse caso, você é bem-vindo para fornecê-la se você puder!). Para fazer isso, procure no rastreador usando a caixa de busca no topo da página.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
es_es: Si el problema que estás informando aún no aparece en la lista, inicia sesión en GitHub. Si aún no tienes una cuenta de GitHub, crea una nueva usando el enlace "Registrarse". Anónimamente no es posible enviar un informe de error.
fa: اگر مشکلی که گزارش می‌کنید قبلاً در لیست نیست، وارد GitHub شوید. اگر قبلاً یک حساب GitHub ندارید، با استفاده از پیوند "ثبت نام" یک حساب کاربری جدید ایجاد کنید. امکان ارسال گزارش اشکال به صورت ناشناس وجود ندارد.
pt_br: Se o problema que você está relatando ainda não estiver na lista, faça login no GitHub. Se você ainda não tiver uma conta do GitHub, crie uma nova conta usando o link "Sing Up". Não é possível enviar um relatório de bug anonimamente.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
es_es: Una vez iniciada sesión, puedes enviar un problema. Clic en el botón" Nuevo problema " en la barra superior para informar de un nuevo problema.
fa: اکنون که وارد سیستم شده اید، می توانید مشکلی را ارسال کنید. برای گزارش یک مشکل جدید، روی دکمه "نسخه جدید" در نوار بالا کلیک کنید.
pt_br: Estando agora autenticado, você pode enviar um problema. Clique no botão "New issue" na barra superior para relatar um novo problema.

source: The submission form has two fields, "Title" and "Comment".
es_es: El formulario de envío tiene dos campos, "Título" y "Comentario".
fa: فرم ارسال دارای دو فیلد «عنوان» و «نظر» است.
pt_br: O formulário de submissão tem dois campos, "Title" e "Comment".

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
es_es: Para el campo" Título", ingresa una descripción *muy* corta del problema; a ser posible menos de diez palabras.
fa: برای فیلد "عنوان", یک توضیح کوتاه *very* از مشکل وارد کنید. کمتر از ده کلمه خوب است

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
ar: في خانة "Comment", أوصف المشكلة بالتفاصيل مع تضمين ما كنت تتوقع أن يحدثو ما حدث بغير توقعاتك. تأكد من تضمين ايً ْمنالاضافات النسبية للخطأ، و مضمّناً معلوماتك عن الهاردوير المستعمل و معلومات عن السوفتوير
es_es: En el campo "Comentario", describe el problema en detalle, incluyendo qué es lo que esperabas que sucediera y que es lo que ha sucedido. Recuerda incluir cualquier módulo de extensión envuelto en el problema, y que hardware y plataforma de software estabas utilizando (incluyendo información de versión apropiadamente).
fa: در قسمت "نظر", مشکل را با جزئیات شرح دهید، از جمله آنچه که انتظار داشتید اتفاق بیفتد و چه اتفاقی افتاده است. مطمئن شوید که آیا ماژول های برنامه افزودنی درگیر هستند یا خیر، و از چه پلتفرم سخت افزاری و نرم افزاری استفاده می کردید (از جمله اطلاعات نسخه در صورت لزوم).
pt_br: No campo "Comment", descreva o problema com detalhes, incluindo o que você esperava que acontecesse e o que aconteceu. Esteja certo de incluir quaisquer módulos de extensão envolvidos, e que hardware e plataforma de software você está usando (incluindo informações sobre versão quando pertinente).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
es_es: Cada informe de problema será revisado por un desarrollador que determinará qué se debe hacer para corregir el problema. Recibirás una actualización cada vez que se realice una acción sobre el problema.
fa: هر گزارش مشکل توسط یک توسعه دهنده بررسی می شود که تعیین می کند برای اصلاح مشکل چه کاری باید انجام شود. هر بار که اقدامی در مورد این مشکل انجام شود، به‌روزرسانی دریافت خواهید کرد.
pt_br: Cada relatório de problema será revisado por um desenvolvedor que determinará o que precisa ser feito para corrigir o problema. Você receberá uma atualização sempre que uma ação for tomada sobre o problema.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
ar: `كيف تقدم تقرير أخطاء وافي <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
es_es: 'Cómo Informar Errores de Manera Efectiva <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
pt_br: `Como reportar defeitos eficientemente <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
ar: مقالة تتحدث عن التفاصيل الموّلدة لتقرير أخطاء جيد و مفيديبين أي نوع من المعلومات مفيدة و لماذا
es_es: Artículo que entra en detalles sobre cómo crear un informe de error útil. Esto describe qué tipo de información es útil y por qué es útil.
fa: مقاله ای که به جزئیات در مورد نحوه ایجاد یک گزارش اشکال مفید می پردازد. این توضیح می دهد که چه نوع اطلاعات مفید است و چرا مفید است.
pt_br: Artigo que entra em algum detalhe sobre como criar um registro de bug (defeitos) útil. Descreve que tipo de informação é útil e por quê.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
es_es: 'Directrices de escritura de errores <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
ar: معلومات عن حول كيفية كتابة تقرير اخطاء جيدة. بعضها خاصةٌلمشروع Mozila, ولكن توضّح تمرينات عامة قد تكون مفيدة
es_es: Información sobre como escribir un buen informe de bug. Cierta parte de esto es específica del proyecto Mozilla, pero describe en general buenas prácticas.
fa: اطلاعاتی در مورد نوشتن یک گزارش اشکال خوب. برخی از این ها مختص پروژه موزیلا است، اما شیوه های خوب کلی را توصیف می کند.
pt_br: Informação sobre como escrever um bom relatório de defeito. Algumas coisas são específicas do Projeto Mozilla, mas descrevem boas práticas em geral.

source: Getting started contributing to Python yourself
ar: البدء في مساهماتك لمشروع بايثون بنفسك
es_es: Comenza tú mismo a contribuir a Python
fa: شروع به مشارکت در پایتون خودتان
pt_br: Começando a contribuir com Python por conta própria

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
ar: بخلاف الإبلاغات فقط عن الأخطاء، فأنت مدعو أيضًا إلى ارسالتعديلاتك لاصلاحها كذلك. لمزيد من المعلومات حول كيفية هذا الامرتفضل إلى `ارشادات بايثون للمطورين`_. إذا كانت لديك أسئلة،فإن `core-mentorship mailing list`_ مكان ستساعدك للحصول على إجاباتحول تصليح أخطاء بايثون
es_es: Más allá de informar los bugs que encuentres, eres bienvenido a enviar parches para arreglarlos. Puedes encontrar más información sobre como comenzar a parchear Python en la `Guía de Desarrolladores de Python`_. Si tienes preguntas, `core-mentorship mailing list`_ es un buen lugar donde tener respuestas de todo y cualquier pregunta pertinente al proceso de resolución de problemas en Python.
fa: علاوه بر گزارش اشکالاتی که پیدا می‌کنید، می‌توانید وصله‌هایی را نیز برای رفع آنها ارسال کنید. می توانید اطلاعات بیشتری در مورد نحوه شروع وصله پایتون در `Python Developer's Guide`_ بیابید. اگر سؤالی دارید، `core-mentorship mailing list`_ مکانی دوستانه برای دریافت پاسخ به همه سؤالات مربوط به فرآیند رفع مشکلات در پایتون است.
pt_br: Além de reportar erros que encontrar, você é bem vindo a submeter suas próprias correções. Você pode encontrar mais informações em como começar a contribuir para o Python no `Python Developer's Guide`_. Se possuir mais questões, a `core-mentorship mailing list`_ é um lugar amigável para toda e qualquer questão relativa ao processo de correção de problemas em Python.

source: For the "Title" field, enter a *very* short description of the problem; less than ten words is good.
pt_br: Para o campo "Title", insira uma descrição *muito* curta do problema; menos de dez palavras é bom.

source: `Bug Report Writing Guidelines <https://developer.mozilla.org/en-US/docs/Mozilla/QA/Bug_writing_guidelines>`_
ar: `قواعد كتابة تقرير عن الأخطاء <https://developer.mozilla.org/en-US/docs/Mozilla/QA/Bug_writing_guidelines>`_
pt_br: `Guia para escrever relatório de defeitos <https://developer.mozilla.org/en-US/docs/Mozilla/QA/Bug_writing_guidelines>`_
